{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. cd "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\HANDLS_PAPER64_HCYDEPANXIETY_LONG\DATA"
{res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\HANDLS_PAPER64_HCYDEPANXIETY_LONG\DATA
{txt}
{com}. 
. 
. 
. //STEP 0: CREATE ANXIETY SCORE LONGITUDINAL AND CHECK ALL VARIABLES IN THE WAVES 1, 3 AND 4 DATASETS//
. 
. use 2023-09-28_anx,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. capture rename HNDWAVE HNDwave
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx.dta{rm}
saved
{p_end}

{com}. 
. 
. capture drop ga0* ga10* anxd*
{txt}
{com}. decode PDSQga01, generate(ga01)
{txt}
{com}. decode PDSQga02, generate(ga02)
{txt}
{com}. decode PDSQga03, generate(ga03)
{txt}
{com}. decode PDSQga04, generate(ga04)
{txt}
{com}. decode PDSQga05, generate(ga05)
{txt}
{com}. decode PDSQga06, generate(ga06)
{txt}
{com}. decode PDSQga07, generate(ga07)
{txt}
{com}. decode PDSQga08, generate(ga08)
{txt}
{com}. decode PDSQga09, generate(ga09)
{txt}
{com}. decode PDSQga10, generate(ga10)
{txt}
{com}. decode AnxietyDisorder, generate(anxd)
{txt}
{com}. 
. 
. replace ga01 = "0" if ga01 == "No"
{txt}(3,513 real changes made)

{com}. replace ga01 = "1" if ga01 == "Yes" 
{txt}(608 real changes made)

{com}. 
. replace ga02 = "0" if ga02 == "No"
{txt}(3,160 real changes made)

{com}. replace ga02 = "1" if ga02 == "Yes" 
{txt}(957 real changes made)

{com}. 
. replace ga03 = "0" if ga03 == "No"
{txt}(3,267 real changes made)

{com}. replace ga03 = "1" if ga03 == "Yes" 
{txt}(847 real changes made)

{com}. 
. replace ga04 = "0" if ga04 == "No"
{txt}(3,048 real changes made)

{com}. replace ga04 = "1" if ga04 == "Yes" 
{txt}(1,066 real changes made)

{com}. 
. replace ga05 = "0" if ga05 == "No"
{txt}(2,775 real changes made)

{com}. replace ga05 = "1" if ga05 == "Yes" 
{txt}(1,338 real changes made)

{com}. 
. replace ga06 = "0" if ga06 == "No"
{txt}(2,684 real changes made)

{com}. replace ga06 = "1" if ga06 == "Yes"
{txt}(1,426 real changes made)

{com}. 
. replace ga07 = "0" if ga07 == "No"
{txt}(2,621 real changes made)

{com}. replace ga07 = "1" if ga07 == "Yes" 
{txt}(1,488 real changes made)

{com}. 
. replace ga08 = "0" if ga08 == "No"
{txt}(2,765 real changes made)

{com}. replace ga08 = "1" if ga08 == "Yes" 
{txt}(1,344 real changes made)

{com}. 
. replace ga09 = "0" if ga09 == "No"
{txt}(2,716 real changes made)

{com}. replace ga09 = "1" if ga09 == "Yes" 
{txt}(1,392 real changes made)

{com}. 
. replace ga10 = "0" if ga10 == "No"
{txt}(3,069 real changes made)

{com}. replace ga10 = "1" if ga10 == "Yes" 
{txt}(1,036 real changes made)

{com}. 
. replace anxd = "0" if anxd == "No"
{txt}(5,764 real changes made)

{com}. replace anxd = "1" if anxd == "Yes" 
{txt}(1,307 real changes made)

{com}. 
. 
. encode ga01, generate(ga01_n)
{txt}
{com}. encode ga02, generate(ga02_n)
{txt}
{com}. encode ga03, generate(ga03_n)
{txt}
{com}. encode ga04, generate(ga04_n)
{txt}
{com}. encode ga05, generate(ga05_n)
{txt}
{com}. encode ga06, generate(ga06_n)
{txt}
{com}. encode ga07, generate(ga07_n)
{txt}
{com}. encode ga08, generate(ga08_n)
{txt}
{com}. encode ga09, generate(ga09_n)
{txt}
{com}. encode ga10, generate(ga10_n)
{txt}
{com}. encode anxd, generate(anxd_n)
{txt}
{com}. 
. capture drop ANXIETY
{txt}
{com}. gen ANXIETY=ga01_n+ga02_n+ga03_n+ga04_n+ga05_n+ga06_n+ga07_n+ga08_n+ga09_n+ga10_n
{txt}(4,254 missing values generated)

{com}. replace ANXIETY=ANXIETY
{txt}(0 real changes made)

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx.dta{rm}
saved
{p_end}

{com}. 
. **********
. use 2023-09-28_anx,clear
{txt}
{com}. keep if HNDwave==1
{txt}(4,639 observations deleted)

{com}. save 2023-09-28_anx_wave1, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. use 2023-09-28_anx,clear
{txt}
{com}. keep if HNDwave==3
{txt}(5,891 observations deleted)

{com}. capture rename HNDID HNDID
{txt}
{com}. save 2023-09-28_anx_wave3, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave3.dta{rm}
saved
{p_end}

{com}. 
. 
. use 2023-09-28_anx,clear
{txt}
{com}. keep if HNDwave==4
{txt}(6,188 observations deleted)

{com}. capture rename HNDID HNDID
{txt}
{com}. save 2023-09-28_anx_wave4, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave4.dta{rm}
saved
{p_end}

{com}. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. 
. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave1.dta
{txt} Observations:{res}         3,720                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      3,720    4173.255    2398.332          1       8358
{txt}{space 7}HNDID {c |}{res}      3,720    8.16e+09    4.20e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      3,720           1           0          1          1
{txt}{space 9}Sex {c |}{res}      3,720    1.452957     .497849          1          2
{txt}{space 8}Race {c |}{res}      3,720     1.59086    .4917412          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      3,720    1.412634    .4923743          1          2
{txt}{space 1}EducationYr {c |}{res}      3,646    12.05129    2.543741          1         20
{txt}{space 9}Age {c |}{res}      3,720    48.26927    9.357168       29.8       66.2
{txt}{space 8}SF01 {c |}{res}      3,717     3.08071    .9902358          1          5
{txt}{space 8}HCys {c |}{res}      1,460    9.176575    5.219708       2.88     112.59
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}      3,628    1.432194    .4954493          1          2
{txt}{space 4}PDSQga01 {c |}{res}      2,228    1.138689    .3456997          1          2
{txt}{space 4}PDSQga02 {c |}{res}      2,227    1.260889    .4392182          1          2
{txt}{space 4}PDSQga03 {c |}{res}      2,227    1.233049    .4228681          1          2
{txt}{space 4}PDSQga04 {c |}{res}      2,227    1.271217    .4446876          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}      2,227    1.351145    .4774354          1          2
{txt}{space 4}PDSQga06 {c |}{res}      2,225    1.377079    .4847638          1          2
{txt}{space 4}PDSQga07 {c |}{res}      2,225    1.374831    .4841882          1          2
{txt}{space 4}PDSQga08 {c |}{res}      2,225    1.363596    .4811422          1          2
{txt}{space 4}PDSQga09 {c |}{res}      2,225    1.349213    .4768287          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}      2,225     1.26382     .440802          1          2
{txt}CigaretteS~s {c |}{res}      2,585    2.958607    1.202193          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,581    3.321193    .9529088          1          4
{txt}{space 3}MarijCurr {c |}{res}      2,579    1.863513    .3433716          1          2
{txt}{space 4}CokeCurr {c |}{res}      2,591     1.93902    .2393404          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      2,509    1.963332    .1879828          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,497    1.271526    .4448357          1          2
{txt}{space 6}CVaFib {c |}{res}      2,504    1.079073    .2699073          1          2
{txt}{space 4}CVangina {c |}{res}      2,504    1.093051    .2905621          1          2
{txt}{space 7}CVcad {c |}{res}      2,505    1.038723    .1929715          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,505    1.028743    .1671153          1          2
{txt}{space 8}CVmi {c |}{res}      2,503    1.036756    .1881995          1          2
{txt}AnxietyDis~r {c |}{res}      2,630    1.129658    .3359904          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,766    121.1312    18.03847         80        194
{txt}{space 3}BPsitRdia {c |}{res}      2,765    73.00434    11.44163         40        144
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,740    120.1639    18.14553         76        217
{txt}{space 3}BPsitLdia {c |}{res}      2,733    73.10392      11.247         37        158
{txt}{space 9}BMI {c |}{res}      2,853     30.0263    7.921048   14.35524     70.069
{txt}{space 7}dxHTN {c |}{res}      2,750    1.467273    .4990185          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,756    1.526488    .7736745          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,177    42.59318    11.48268   12.62117   89.42492
{txt}{space 9}CES {c |}{res}      2,736    15.16301    11.44406          0         59
{txt}{space 6}CES_DA {c |}{res}      2,794    4.651038    5.014007          0         21
{txt}{space 6}CES_IP {c |}{res}      2,794    1.012527      1.3815          0          6
{txt}{space 6}CES_SC {c |}{res}      2,794    6.740157    4.480029          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,794    9.306371     2.96825          0         12
{txt}{space 8}Chol {c |}{res}      2,752    187.0883    43.35285         68        651
{txt}{space 9}HDL {c |}{res}      2,751    52.74264    17.28135         11        175
{txt}{space 6}HgbA1C {c |}{res}      2,754    6.008642     1.31885        3.2       17.5
{txt}{space 5}Albumin {c |}{res}      2,753    4.270432     .343827        2.2        5.3
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,646    5.036731    10.10386       .005        163
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}      2,228    1.138689    .3456997          1          2
{txt}{space 6}ga02_n {c |}{res}      2,227    1.260889    .4392182          1          2
{txt}{space 6}ga03_n {c |}{res}      2,227    1.233049    .4228681          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}      2,227    1.271217    .4446876          1          2
{txt}{space 6}ga05_n {c |}{res}      2,227    1.351145    .4774354          1          2
{txt}{space 6}ga06_n {c |}{res}      2,225    1.377079    .4847638          1          2
{txt}{space 6}ga07_n {c |}{res}      2,225    1.374831    .4841882          1          2
{txt}{space 6}ga08_n {c |}{res}      2,225    1.363596    .4811422          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}      2,225    1.349213    .4768287          1          2
{txt}{space 6}ga10_n {c |}{res}      2,225     1.26382     .440802          1          2
{txt}{space 6}anxd_n {c |}{res}      2,630    1.129658    .3359904          1          2
{txt}{space 5}ANXIETY {c |}{res}      2,225    12.98247    3.224116         10         20
{txt}
{com}. 
. 
. 
. use 2023-09-28_anx_wave3,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave3.dta
{txt} Observations:{res}         2,468                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      2,468    4188.203    2448.433          4       8359
{txt}{space 7}HNDID {c |}{res}      2,468    8.16e+09    4.33e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      2,468           3           0          3          3
{txt}{space 9}Sex {c |}{res}      2,468    1.422609    .4940745          1          2
{txt}{space 8}Race {c |}{res}      2,468    1.616694    .4862905          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      2,468    1.404781    .4909491          1          2
{txt}{space 1}EducationYr {c |}{res}      2,433    12.18496    2.579873          1         20
{txt}{space 9}Age {c |}{res}      2,468    52.97776    9.033023       32.9         73
{txt}{space 8}SF01 {c |}{res}      1,760    3.114773    .9365353          1          5
{txt}{space 8}HCys {c |}{res}      1,486    10.40221    10.36594       3.87     303.93
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}          0
{txt}{space 4}PDSQga01 {c |}{res}          0
{txt}{space 4}PDSQga02 {c |}{res}          0
{txt}{space 4}PDSQga03 {c |}{res}          0
{txt}{space 4}PDSQga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}          0
{txt}{space 4}PDSQga06 {c |}{res}          0
{txt}{space 4}PDSQga07 {c |}{res}          0
{txt}{space 4}PDSQga08 {c |}{res}          0
{txt}{space 4}PDSQga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}          0
{txt}CigaretteS~s {c |}{res}      2,103    2.911555    1.127789          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,134     3.31537      .87919          1          4
{txt}{space 3}MarijCurr {c |}{res}      1,990    1.882412    .3222005          1          2
{txt}{space 4}CokeCurr {c |}{res}      1,942    1.969104    .1730805          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      1,877    1.973362    .1610667          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,285    1.363239     .481038          1          2
{txt}{space 6}CVaFib {c |}{res}      2,285    1.089716    .2858363          1          2
{txt}{space 4}CVangina {c |}{res}      2,285    1.100656    .3009391          1          2
{txt}{space 7}CVcad {c |}{res}      2,285    1.042888    .2026498          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,285    1.034573    .1827364          1          2
{txt}{space 8}CVmi {c |}{res}      2,285    1.039387    .1945572          1          2
{txt}AnxietyDis~r {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,263    122.9585    18.23062         76        220
{txt}{space 3}BPsitRdia {c |}{res}      2,262    70.58267    10.04919         40        120
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,250    122.2787    17.98661         76        216
{txt}{space 3}BPsitLdia {c |}{res}      2,246    71.32502    10.32727         40        116
{txt}{space 9}BMI {c |}{res}      2,291    30.63998    7.955704       12.3         88
{txt}{space 7}dxHTN {c |}{res}      2,293    1.580898    .4935197          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,314    1.589023    .8128245          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,140     46.2576    12.05283   16.62035   98.33624
{txt}{space 9}CES {c |}{res}      2,254    15.81233    11.65942          0         56
{txt}{space 6}CES_DA {c |}{res}      2,290    4.859389    5.135249          0         21
{txt}{space 6}CES_IP {c |}{res}      2,290    1.095197    1.450998          0          6
{txt}{space 6}CES_SC {c |}{res}      2,290    7.213537      4.4828          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,290    9.379476    2.830684          0         12
{txt}{space 8}Chol {c |}{res}      2,269    187.4606    41.57405         78        414
{txt}{space 9}HDL {c |}{res}      2,268    56.65785    18.58656         19        176
{txt}{space 6}HgbA1C {c |}{res}      2,265    6.036865    1.241404        3.8       16.2
{txt}{space 5}Albumin {c |}{res}      2,270    4.333789    .3233109        2.6        5.4
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,216    7.889009    29.71592   .0167696   1277.805
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}          0
{txt}{space 6}ga02_n {c |}{res}          0
{txt}{space 6}ga03_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}          0
{txt}{space 6}ga05_n {c |}{res}          0
{txt}{space 6}ga06_n {c |}{res}          0
{txt}{space 6}ga07_n {c |}{res}          0
{txt}{space 6}ga08_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}          0
{txt}{space 6}ga10_n {c |}{res}          0
{txt}{space 6}anxd_n {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 5}ANXIETY {c |}{res}          0
{txt}
{com}. 
. 
. use 2023-09-28_anx_wave4,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave4.dta
{txt} Observations:{res}         2,171                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      2,171    4182.233    2399.216          5       8357
{txt}{space 7}HNDID {c |}{res}      2,171    8.16e+09    4.24e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      2,171           4           0          4          4
{txt}{space 9}Sex {c |}{res}      2,171    1.413634    .4925979          1          2
{txt}{space 8}Race {c |}{res}      2,171    1.610778    .4876861          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      2,171    1.405343    .4910714          1          2
{txt}{space 1}EducationYr {c |}{res}      2,139    12.15895     2.52434          1         20
{txt}{space 9}Age {c |}{res}      2,171    56.60129     9.10942       36.4       76.9
{txt}{space 8}SF01 {c |}{res}      2,129    3.060592     .930676          1          5
{txt}{space 8}HCys {c |}{res}      1,280    10.68614    4.557427       4.18      53.11
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}          0
{txt}{space 4}PDSQga01 {c |}{res}      1,893     1.15795    .3647908          1          2
{txt}{space 4}PDSQga02 {c |}{res}      1,890    1.198942    .3993098          1          2
{txt}{space 4}PDSQga03 {c |}{res}      1,887    1.173821    .3790558          1          2
{txt}{space 4}PDSQga04 {c |}{res}      1,887    1.244833    .4301022          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}      1,886    1.294804    .4560754          1          2
{txt}{space 4}PDSQga06 {c |}{res}      1,885    1.311406    .4631912          1          2
{txt}{space 4}PDSQga07 {c |}{res}      1,884    1.347134    .4761851          1          2
{txt}{space 4}PDSQga08 {c |}{res}      1,884     1.28397    .4510423          1          2
{txt}{space 4}PDSQga09 {c |}{res}      1,883    1.326606    .4690965          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}      1,880     1.23883     .426482          1          2
{txt}CigaretteS~s {c |}{res}      2,013    2.958768    1.137552          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,030    3.298522    .8664082          1          4
{txt}{space 3}MarijCurr {c |}{res}      1,900    1.841579    .3652315          1          2
{txt}{space 4}CokeCurr {c |}{res}      1,852    1.968683    .1742214          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      1,804    1.972284     .164204          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,107    1.449454    .4975566          1          2
{txt}{space 6}CVaFib {c |}{res}      2,107     1.10916    .3119138          1          2
{txt}{space 4}CVangina {c |}{res}      2,107    1.113906    .3177725          1          2
{txt}{space 7}CVcad {c |}{res}      2,107    1.059801    .2371734          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,107     1.04841    .2146821          1          2
{txt}{space 8}CVmi {c |}{res}      2,107     1.05458    .2272125          1          2
{txt}AnxietyDis~r {c |}{res}      2,151    1.259879    .4386701          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,113    118.6602    17.79255         80        204
{txt}{space 3}BPsitRdia {c |}{res}      2,112    65.94934    9.811911         40        118
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,115     119.079    17.86099         72        208
{txt}{space 3}BPsitLdia {c |}{res}      2,115    67.28747    9.948667         40        120
{txt}{space 9}BMI {c |}{res}      2,142    30.86928    7.952211       13.8       76.5
{txt}{space 7}dxHTN {c |}{res}      2,153    1.648398    .4775815          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,162    1.650786    .8461863          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,066    48.68347    12.09708   14.40958   90.44823
{txt}{space 9}CES {c |}{res}      2,007    13.79771    10.87457          0         57
{txt}{space 6}CES_DA {c |}{res}      2,015    3.893797    4.474094          0         21
{txt}{space 6}CES_IP {c |}{res}      2,015     .830273    1.269134          0          6
{txt}{space 6}CES_SC {c |}{res}      2,015    5.874442    4.275007          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,015    8.808437    3.147015          0         12
{txt}{space 8}Chol {c |}{res}      2,087     187.966    43.12726         58        409
{txt}{space 9}HDL {c |}{res}      2,085    57.31175    19.81095         14        199
{txt}{space 6}HgbA1C {c |}{res}      2,075    6.212386    1.351279        3.8       19.4
{txt}{space 5}Albumin {c |}{res}      2,086      4.2535    .3457376        2.2        5.4
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,082    5.310447    9.392764        .15        125
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}      1,893     1.15795    .3647908          1          2
{txt}{space 6}ga02_n {c |}{res}      1,890    1.198942    .3993098          1          2
{txt}{space 6}ga03_n {c |}{res}      1,887    1.173821    .3790558          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}      1,887    1.244833    .4301022          1          2
{txt}{space 6}ga05_n {c |}{res}      1,886    1.294804    .4560754          1          2
{txt}{space 6}ga06_n {c |}{res}      1,885    1.311406    .4631912          1          2
{txt}{space 6}ga07_n {c |}{res}      1,884    1.347134    .4761851          1          2
{txt}{space 6}ga08_n {c |}{res}      1,884     1.28397    .4510423          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}      1,883    1.326606    .4690965          1          2
{txt}{space 6}ga10_n {c |}{res}      1,880     1.23883     .426482          1          2
{txt}{space 6}anxd_n {c |}{res}      2,151    1.259879    .4386701          1          2
{txt}{space 5}ANXIETY {c |}{res}      1,880    12.58138    3.213161         10         20
{txt}
{com}. 
. 
. 
. 
. //STEP 1: CREATE WAVE 1 DEMOGRAPHIC VARIABLES//
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. 
. keep HNDID HNDwave Race PovStat Sex Age 
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save DEMOw1, replace
{txt}{p 0 4 2}
file {bf}
DEMOw1.dta{rm}
saved
{p_end}

{com}. 
. addstub Race PovStat Sex Age, stub(w1)
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEMOw1.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 2: CREATE DEPRESSIVE SYMPTOMS DATA AT WAVES 1, 3 AND 4, LONG//
. 
. *****DEPRESSIVE SYMPTOMS AND ANXIETY DATA AT WAVE 1**
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. 
. keep HNDID HNDwave CES* PDSQ* ANXIETY AnxietyDisorder HCys
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_wave1long, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave1long.dta{rm}
saved
{p_end}

{com}. 
. 
. *****DEPRESSIVE SYMPTOMS AND ANXIETY DATA AT WAVE 3**
. 
. 
. use 2023-09-28_anx_wave3,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. 
. 
. keep HNDID HNDwave CES* PDSQ* ANXIETY AnxietyDisorder HCys
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_wave3long, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave3long.dta{rm}
saved
{p_end}

{com}. 
. 
. *****DEPRESSIVE SYMPTOMS AND ANXIETY DATA AT WAVE 4**
. 
. 
. use 2023-09-28_anx_wave4,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. 
. 
. keep HNDID HNDwave CES* PDSQ* ANXIETY AnxietyDisorder HCys
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_wave4long, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave4long.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. //STEP 3: CREATE WAVE 1, 3 and 4 DEPRESSIVE SYMPTOMS DATA, WIDE//
. 
. 
. *****DEPRESSIVE SYMPTOMS AND ANXIETY DATA AT WAVE 1**
. 
. use DEPRESSIVE_SYMPTOMS_wave1long, clear
{txt}
{com}. 
. keep HNDID CES* PDSQ* ANXIETY AnxietyDisorder
{txt}
{com}. 
. addstub CES* PDSQ* ANXIETY AnxietyDisorder, stub(w1)
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMSwave1wide, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMSwave1wide.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *****DEPRESSIVE SYMPTOMS AND ANXIETY DATA AT WAVE 3**
. 
. use DEPRESSIVE_SYMPTOMS_wave3long, clear
{txt}
{com}. 
. keep HNDID CES* PDSQ* ANXIETY AnxietyDisorder
{txt}
{com}. 
. addstub CES* PDSQ* ANXIETY AnxietyDisorder, stub(w3)
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMSwave3wide, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMSwave3wide.dta{rm}
saved
{p_end}

{com}. 
. 
. *****DEPRESSIVE SYMPTOMS AND ANXIETY DATA AT WAVE 4**
. 
. use DEPRESSIVE_SYMPTOMS_wave4long, clear
{txt}
{com}. 
. keep HNDID CES* PDSQ* ANXIETY AnxietyDisorder
{txt}
{com}. 
. addstub CES* PDSQ* ANXIETY AnxietyDisorder, stub(w4)
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMSwave4wide, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMSwave4wide.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 4: MERGE AGEw1 with DEP AND ANXIETY DATA AT WAVE 1//
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. 
. keep HNDID Age
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save Agew1, replace
{txt}{p 0 4 2}
file {bf}
Agew1.dta{rm}
saved
{p_end}

{com}. capture rename Age w1Age
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Agew1.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMS_wave1long,clear
{txt}
{com}. merge HNDID using Agew1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. save DEPRESSIVE_SYMPTOMS_wave1longAgew1, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave1longAgew1.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 5: MERGE AGEw3 with DEP AND ANXIETY DATA AT WAVE 3//
. 
. 
. use 2023-09-28_anx_wave3,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. 
. keep HNDID Age
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save Agew3, replace
{txt}{p 0 4 2}
file {bf}
Agew3.dta{rm}
saved
{p_end}

{com}. capture rename Age w3Age
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Agew3.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMS_wave3long,clear
{txt}
{com}. merge HNDID using Agew3
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. save DEPRESSIVE_SYMPTOMS_wave3longAgew3, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave3longAgew3.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 6: MERGE AGEw4 with DEP AND ANXIETY DATA AT WAVE 4//
. 
. 
. use 2023-09-28_anx_wave4,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. 
. keep HNDID Age
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save Agew4, replace
{txt}{p 0 4 2}
file {bf}
Agew4.dta{rm}
saved
{p_end}

{com}. capture rename Age w4Age
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Agew4.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMS_wave4long,clear
{txt}
{com}. merge HNDID using Agew4
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. 
. save DEPRESSIVE_SYMPTOMS_wave4longAgew4, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave4longAgew4.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 7: APPEND LONG DEPRESSIVE SYMPTOMS DATA MERGED WITH AGE VARIABLES//
. 
. use DEPRESSIVE_SYMPTOMS_wave1longAgew1, clear
{txt}
{com}. 
. capture drop _merge
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave1longAgew1.dta{rm}
saved
{p_end}

{com}. 
. 
. use DEPRESSIVE_SYMPTOMS_wave3longAgew3, clear
{txt}
{com}. 
. capture drop _merge
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave3longAgew3.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. use DEPRESSIVE_SYMPTOMS_wave4longAgew4, clear
{txt}
{com}. 
. capture drop _merge
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_wave4longAgew4.dta{rm}
saved
{p_end}

{com}. 
. 
. use DEPRESSIVE_SYMPTOMS_wave1longAgew1, clear
{txt}
{com}. append using DEPRESSIVE_SYMPTOMS_wave3longAgew3
{txt}(label {bf:{txt}AnxietyDisorder} already defined)
(label {bf:{txt}PDSQga10} already defined)
(label {bf:{txt}PDSQga09} already defined)
(label {bf:{txt}PDSQga08} already defined)
(label {bf:{txt}PDSQga07} already defined)
(label {bf:{txt}PDSQga06} already defined)
(label {bf:{txt}PDSQga05} already defined)
(label {bf:{txt}PDSQga04} already defined)
(label {bf:{txt}PDSQga03} already defined)
(label {bf:{txt}PDSQga02} already defined)
(label {bf:{txt}PDSQga01} already defined)

{com}. append using DEPRESSIVE_SYMPTOMS_wave4longAgew4
{txt}(label {bf:{txt}AnxietyDisorder} already defined)
(label {bf:{txt}PDSQga10} already defined)
(label {bf:{txt}PDSQga09} already defined)
(label {bf:{txt}PDSQga08} already defined)
(label {bf:{txt}PDSQga07} already defined)
(label {bf:{txt}PDSQga06} already defined)
(label {bf:{txt}PDSQga05} already defined)
(label {bf:{txt}PDSQga04} already defined)
(label {bf:{txt}PDSQga03} already defined)
(label {bf:{txt}PDSQga02} already defined)
(label {bf:{txt}PDSQga01} already defined)

{com}. 
. 
. save DEPRESSIVE_SYMPTOMS_waves134_append, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_waves134_append.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. keep HNDID HNDwave CES* PDSQ* HCys
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_waves134_appendsmall, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_waves134_appendsmall.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 8: APPEND THE DEPRESSIVE SYMPTOMS (LONG) WITH DEMO AT WAVE 1: CALL THIS LAYER HNDWAVE==0//
. 
. use DEMOw1, clear
{txt}
{com}. recode HNDwave 1=0
{txt}(3,720 changes made to {bf:HNDwave})

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEMOw1.dta{rm}
saved
{p_end}

{com}. 
. append using DEPRESSIVE_SYMPTOMS_waves134_appendsmall
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long.dta{rm}
saved
{p_end}

{com}. 
. sort HNDID
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long.dta{rm}
saved
{p_end}

{com}. 
. use DEMOw1, clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop HNDwave
{txt}
{com}. save DEMOw1wide, replace
{txt}{p 0 4 2}
file {bf}
DEMOw1wide.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long,clear
{txt}
{com}. capture drop w1Sex w1Race w1PovStat w1Age 
{txt}
{com}. 
. merge HNDID using DEMOw1wide
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
(label {bf:{txt}PovStat} already defined)
(label {bf:{txt}Race} already defined)
(label {bf:{txt}Sex} already defined)

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long.dta{rm}
saved
{p_end}

{com}. 
. //STEP 9: MERGE WAVE 1 DEP, WIDE WITH THE APPENDED DATA//
. use  DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMSwave1wide,clear
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMSwave1wide.dta{rm}
saved
{p_end}

{com}. 
. use  DEPRESSIVE_SYMPTOMS_waves134_appendsmallDEMOw1long,clear
{txt}
{com}. merge HNDID using DEPRESSIVE_SYMPTOMSwave1wide
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
(label {bf:{txt}PDSQga10} already defined)
(label {bf:{txt}PDSQga09} already defined)
(label {bf:{txt}PDSQga08} already defined)
(label {bf:{txt}PDSQga07} already defined)
(label {bf:{txt}PDSQga06} already defined)
(label {bf:{txt}PDSQga05} already defined)
(label {bf:{txt}PDSQga04} already defined)
(label {bf:{txt}PDSQga03} already defined)
(label {bf:{txt}PDSQga02} already defined)
(label {bf:{txt}PDSQga01} already defined)

{com}. 
. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}     12,079      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1_APPENDED, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 9: MERGE WAVE 3 DEP, WIDE WITH THE APPENDED DATA//
. use  DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1_APPENDED,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMSwave3wide,clear
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMSwave3wide.dta{rm}
saved
{p_end}

{com}. 
. use  DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1_APPENDED,clear
{txt}
{com}. merge HNDID using DEPRESSIVE_SYMPTOMSwave3wide
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
(label {bf:{txt}AnxietyDisorder} already defined)
(label {bf:{txt}PDSQga10} already defined)
(label {bf:{txt}PDSQga09} already defined)
(label {bf:{txt}PDSQga08} already defined)
(label {bf:{txt}PDSQga07} already defined)
(label {bf:{txt}PDSQga06} already defined)
(label {bf:{txt}PDSQga05} already defined)
(label {bf:{txt}PDSQga04} already defined)
(label {bf:{txt}PDSQga03} already defined)
(label {bf:{txt}PDSQga02} already defined)
(label {bf:{txt}PDSQga01} already defined)

{com}. 
. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      2,734       22.63       22.63
{txt}          3 {c |}{res}      9,345       77.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3_APPENDED, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 10: MERGE WAVE 4 DEP, WIDE WITH THE APPENDED DATA//
. use  DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3_APPENDED,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMSwave4wide,clear
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMSwave4wide.dta{rm}
saved
{p_end}

{com}. 
. use  DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3_APPENDED,clear
{txt}
{com}. merge HNDID using DEPRESSIVE_SYMPTOMSwave4wide
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
(label {bf:{txt}AnxietyDisorder} already defined)
(label {bf:{txt}PDSQga10} already defined)
(label {bf:{txt}PDSQga09} already defined)
(label {bf:{txt}PDSQga08} already defined)
(label {bf:{txt}PDSQga07} already defined)
(label {bf:{txt}PDSQga06} already defined)
(label {bf:{txt}PDSQga05} already defined)
(label {bf:{txt}PDSQga04} already defined)
(label {bf:{txt}PDSQga03} already defined)
(label {bf:{txt}PDSQga02} already defined)
(label {bf:{txt}PDSQga01} already defined)

{com}. 
. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,625       30.01       30.01
{txt}          3 {c |}{res}      8,454       69.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. 
. save DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 11: MERGE THIS FILE WITH WAVE 3 AGE//
. use 2023-09-28_anx_wave3,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave3.dta
{txt} Observations:{res}         2,468                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      2,468    4188.203    2448.433          4       8359
{txt}{space 7}HNDID {c |}{res}      2,468    8.16e+09    4.33e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      2,468           3           0          3          3
{txt}{space 9}Sex {c |}{res}      2,468    1.422609    .4940745          1          2
{txt}{space 8}Race {c |}{res}      2,468    1.616694    .4862905          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      2,468    1.404781    .4909491          1          2
{txt}{space 1}EducationYr {c |}{res}      2,433    12.18496    2.579873          1         20
{txt}{space 9}Age {c |}{res}      2,468    52.97776    9.033023       32.9         73
{txt}{space 8}SF01 {c |}{res}      1,760    3.114773    .9365353          1          5
{txt}{space 8}HCys {c |}{res}      1,486    10.40221    10.36594       3.87     303.93
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}          0
{txt}{space 4}PDSQga01 {c |}{res}          0
{txt}{space 4}PDSQga02 {c |}{res}          0
{txt}{space 4}PDSQga03 {c |}{res}          0
{txt}{space 4}PDSQga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}          0
{txt}{space 4}PDSQga06 {c |}{res}          0
{txt}{space 4}PDSQga07 {c |}{res}          0
{txt}{space 4}PDSQga08 {c |}{res}          0
{txt}{space 4}PDSQga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}          0
{txt}CigaretteS~s {c |}{res}      2,103    2.911555    1.127789          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,134     3.31537      .87919          1          4
{txt}{space 3}MarijCurr {c |}{res}      1,990    1.882412    .3222005          1          2
{txt}{space 4}CokeCurr {c |}{res}      1,942    1.969104    .1730805          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      1,877    1.973362    .1610667          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,285    1.363239     .481038          1          2
{txt}{space 6}CVaFib {c |}{res}      2,285    1.089716    .2858363          1          2
{txt}{space 4}CVangina {c |}{res}      2,285    1.100656    .3009391          1          2
{txt}{space 7}CVcad {c |}{res}      2,285    1.042888    .2026498          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,285    1.034573    .1827364          1          2
{txt}{space 8}CVmi {c |}{res}      2,285    1.039387    .1945572          1          2
{txt}AnxietyDis~r {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,263    122.9585    18.23062         76        220
{txt}{space 3}BPsitRdia {c |}{res}      2,262    70.58267    10.04919         40        120
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,250    122.2787    17.98661         76        216
{txt}{space 3}BPsitLdia {c |}{res}      2,246    71.32502    10.32727         40        116
{txt}{space 9}BMI {c |}{res}      2,291    30.63998    7.955704       12.3         88
{txt}{space 7}dxHTN {c |}{res}      2,293    1.580898    .4935197          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,314    1.589023    .8128245          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,140     46.2576    12.05283   16.62035   98.33624
{txt}{space 9}CES {c |}{res}      2,254    15.81233    11.65942          0         56
{txt}{space 6}CES_DA {c |}{res}      2,290    4.859389    5.135249          0         21
{txt}{space 6}CES_IP {c |}{res}      2,290    1.095197    1.450998          0          6
{txt}{space 6}CES_SC {c |}{res}      2,290    7.213537      4.4828          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,290    9.379476    2.830684          0         12
{txt}{space 8}Chol {c |}{res}      2,269    187.4606    41.57405         78        414
{txt}{space 9}HDL {c |}{res}      2,268    56.65785    18.58656         19        176
{txt}{space 6}HgbA1C {c |}{res}      2,265    6.036865    1.241404        3.8       16.2
{txt}{space 5}Albumin {c |}{res}      2,270    4.333789    .3233109        2.6        5.4
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,216    7.889009    29.71592   .0167696   1277.805
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}          0
{txt}{space 6}ga02_n {c |}{res}          0
{txt}{space 6}ga03_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}          0
{txt}{space 6}ga05_n {c |}{res}          0
{txt}{space 6}ga06_n {c |}{res}          0
{txt}{space 6}ga07_n {c |}{res}          0
{txt}{space 6}ga08_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}          0
{txt}{space 6}ga10_n {c |}{res}          0
{txt}{space 6}anxd_n {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 5}ANXIETY {c |}{res}          0
{txt}
{com}. 
. 
. keep HNDID Age
{txt}
{com}. save Agew3, replace
{txt}{p 0 4 2}
file {bf}
Agew3.dta{rm}
saved
{p_end}

{com}. capture rename Age w3Age
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Agew3.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using Agew3
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. //STEP 12: MERGE THIS FILE WITH WAVE 4 AGE//
. use 2023-09-28_anx_wave3,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave3.dta
{txt} Observations:{res}         2,468                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      2,468    4188.203    2448.433          4       8359
{txt}{space 7}HNDID {c |}{res}      2,468    8.16e+09    4.33e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      2,468           3           0          3          3
{txt}{space 9}Sex {c |}{res}      2,468    1.422609    .4940745          1          2
{txt}{space 8}Race {c |}{res}      2,468    1.616694    .4862905          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      2,468    1.404781    .4909491          1          2
{txt}{space 1}EducationYr {c |}{res}      2,433    12.18496    2.579873          1         20
{txt}{space 9}Age {c |}{res}      2,468    52.97776    9.033023       32.9         73
{txt}{space 8}SF01 {c |}{res}      1,760    3.114773    .9365353          1          5
{txt}{space 8}HCys {c |}{res}      1,486    10.40221    10.36594       3.87     303.93
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}          0
{txt}{space 4}PDSQga01 {c |}{res}          0
{txt}{space 4}PDSQga02 {c |}{res}          0
{txt}{space 4}PDSQga03 {c |}{res}          0
{txt}{space 4}PDSQga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}          0
{txt}{space 4}PDSQga06 {c |}{res}          0
{txt}{space 4}PDSQga07 {c |}{res}          0
{txt}{space 4}PDSQga08 {c |}{res}          0
{txt}{space 4}PDSQga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}          0
{txt}CigaretteS~s {c |}{res}      2,103    2.911555    1.127789          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,134     3.31537      .87919          1          4
{txt}{space 3}MarijCurr {c |}{res}      1,990    1.882412    .3222005          1          2
{txt}{space 4}CokeCurr {c |}{res}      1,942    1.969104    .1730805          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      1,877    1.973362    .1610667          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,285    1.363239     .481038          1          2
{txt}{space 6}CVaFib {c |}{res}      2,285    1.089716    .2858363          1          2
{txt}{space 4}CVangina {c |}{res}      2,285    1.100656    .3009391          1          2
{txt}{space 7}CVcad {c |}{res}      2,285    1.042888    .2026498          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,285    1.034573    .1827364          1          2
{txt}{space 8}CVmi {c |}{res}      2,285    1.039387    .1945572          1          2
{txt}AnxietyDis~r {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,263    122.9585    18.23062         76        220
{txt}{space 3}BPsitRdia {c |}{res}      2,262    70.58267    10.04919         40        120
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,250    122.2787    17.98661         76        216
{txt}{space 3}BPsitLdia {c |}{res}      2,246    71.32502    10.32727         40        116
{txt}{space 9}BMI {c |}{res}      2,291    30.63998    7.955704       12.3         88
{txt}{space 7}dxHTN {c |}{res}      2,293    1.580898    .4935197          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,314    1.589023    .8128245          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,140     46.2576    12.05283   16.62035   98.33624
{txt}{space 9}CES {c |}{res}      2,254    15.81233    11.65942          0         56
{txt}{space 6}CES_DA {c |}{res}      2,290    4.859389    5.135249          0         21
{txt}{space 6}CES_IP {c |}{res}      2,290    1.095197    1.450998          0          6
{txt}{space 6}CES_SC {c |}{res}      2,290    7.213537      4.4828          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,290    9.379476    2.830684          0         12
{txt}{space 8}Chol {c |}{res}      2,269    187.4606    41.57405         78        414
{txt}{space 9}HDL {c |}{res}      2,268    56.65785    18.58656         19        176
{txt}{space 6}HgbA1C {c |}{res}      2,265    6.036865    1.241404        3.8       16.2
{txt}{space 5}Albumin {c |}{res}      2,270    4.333789    .3233109        2.6        5.4
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,216    7.889009    29.71592   .0167696   1277.805
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}          0
{txt}{space 6}ga02_n {c |}{res}          0
{txt}{space 6}ga03_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}          0
{txt}{space 6}ga05_n {c |}{res}          0
{txt}{space 6}ga06_n {c |}{res}          0
{txt}{space 6}ga07_n {c |}{res}          0
{txt}{space 6}ga08_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}          0
{txt}{space 6}ga10_n {c |}{res}          0
{txt}{space 6}anxd_n {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 5}ANXIETY {c |}{res}          0
{txt}
{com}. 
. 
. keep HNDID Age
{txt}
{com}. save Agew3, replace
{txt}{p 0 4 2}
file {bf}
Agew3.dta{rm}
saved
{p_end}

{com}. capture rename Age w4Age
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Agew3.dta{rm}
saved
{p_end}

{com}. 
. use DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using Agew4
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. //STEP 12: CREATE THE TIME VARIABLE BETWEEN WAVES 1, 3 and 4//
. 
. use DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED,clear
{txt}
{com}. 
. capture drop timew1w3w4
{txt}
{com}. gen timew1w3w4=.
{txt}(12,079 missing values generated)

{com}. replace timew1w3w4=0 if HNDwave==1
{txt}(3,720 real changes made)

{com}. replace timew1w3w4=w3Age-w1Age if HNDwave==3
{txt}(2,468 real changes made)

{com}. replace timew1w3w4=w4Age-w1Age if HNDwave==4
{txt}(2,171 real changes made)

{com}. 
. su timew1w3w4 if HNDwave==4

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}timew1w3w4 {c |}{res}      2,171     8.67462    1.657789        4.6       12.5
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED.dta{rm}
saved
{p_end}

{com}. 
. ****************************************************************************************
. //STEP 13A: CREATE THE EXPOSURE VARIABLES AT WAVE 1//
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave1.dta
{txt} Observations:{res}         3,720                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      3,720    4173.255    2398.332          1       8358
{txt}{space 7}HNDID {c |}{res}      3,720    8.16e+09    4.20e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      3,720           1           0          1          1
{txt}{space 9}Sex {c |}{res}      3,720    1.452957     .497849          1          2
{txt}{space 8}Race {c |}{res}      3,720     1.59086    .4917412          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      3,720    1.412634    .4923743          1          2
{txt}{space 1}EducationYr {c |}{res}      3,646    12.05129    2.543741          1         20
{txt}{space 9}Age {c |}{res}      3,720    48.26927    9.357168       29.8       66.2
{txt}{space 8}SF01 {c |}{res}      3,717     3.08071    .9902358          1          5
{txt}{space 8}HCys {c |}{res}      1,460    9.176575    5.219708       2.88     112.59
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}      3,628    1.432194    .4954493          1          2
{txt}{space 4}PDSQga01 {c |}{res}      2,228    1.138689    .3456997          1          2
{txt}{space 4}PDSQga02 {c |}{res}      2,227    1.260889    .4392182          1          2
{txt}{space 4}PDSQga03 {c |}{res}      2,227    1.233049    .4228681          1          2
{txt}{space 4}PDSQga04 {c |}{res}      2,227    1.271217    .4446876          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}      2,227    1.351145    .4774354          1          2
{txt}{space 4}PDSQga06 {c |}{res}      2,225    1.377079    .4847638          1          2
{txt}{space 4}PDSQga07 {c |}{res}      2,225    1.374831    .4841882          1          2
{txt}{space 4}PDSQga08 {c |}{res}      2,225    1.363596    .4811422          1          2
{txt}{space 4}PDSQga09 {c |}{res}      2,225    1.349213    .4768287          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}      2,225     1.26382     .440802          1          2
{txt}CigaretteS~s {c |}{res}      2,585    2.958607    1.202193          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,581    3.321193    .9529088          1          4
{txt}{space 3}MarijCurr {c |}{res}      2,579    1.863513    .3433716          1          2
{txt}{space 4}CokeCurr {c |}{res}      2,591     1.93902    .2393404          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      2,509    1.963332    .1879828          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,497    1.271526    .4448357          1          2
{txt}{space 6}CVaFib {c |}{res}      2,504    1.079073    .2699073          1          2
{txt}{space 4}CVangina {c |}{res}      2,504    1.093051    .2905621          1          2
{txt}{space 7}CVcad {c |}{res}      2,505    1.038723    .1929715          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,505    1.028743    .1671153          1          2
{txt}{space 8}CVmi {c |}{res}      2,503    1.036756    .1881995          1          2
{txt}AnxietyDis~r {c |}{res}      2,630    1.129658    .3359904          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,766    121.1312    18.03847         80        194
{txt}{space 3}BPsitRdia {c |}{res}      2,765    73.00434    11.44163         40        144
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,740    120.1639    18.14553         76        217
{txt}{space 3}BPsitLdia {c |}{res}      2,733    73.10392      11.247         37        158
{txt}{space 9}BMI {c |}{res}      2,853     30.0263    7.921048   14.35524     70.069
{txt}{space 7}dxHTN {c |}{res}      2,750    1.467273    .4990185          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,756    1.526488    .7736745          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,177    42.59318    11.48268   12.62117   89.42492
{txt}{space 9}CES {c |}{res}      2,736    15.16301    11.44406          0         59
{txt}{space 6}CES_DA {c |}{res}      2,794    4.651038    5.014007          0         21
{txt}{space 6}CES_IP {c |}{res}      2,794    1.012527      1.3815          0          6
{txt}{space 6}CES_SC {c |}{res}      2,794    6.740157    4.480029          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,794    9.306371     2.96825          0         12
{txt}{space 8}Chol {c |}{res}      2,752    187.0883    43.35285         68        651
{txt}{space 9}HDL {c |}{res}      2,751    52.74264    17.28135         11        175
{txt}{space 6}HgbA1C {c |}{res}      2,754    6.008642     1.31885        3.2       17.5
{txt}{space 5}Albumin {c |}{res}      2,753    4.270432     .343827        2.2        5.3
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,646    5.036731    10.10386       .005        163
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}      2,228    1.138689    .3456997          1          2
{txt}{space 6}ga02_n {c |}{res}      2,227    1.260889    .4392182          1          2
{txt}{space 6}ga03_n {c |}{res}      2,227    1.233049    .4228681          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}      2,227    1.271217    .4446876          1          2
{txt}{space 6}ga05_n {c |}{res}      2,227    1.351145    .4774354          1          2
{txt}{space 6}ga06_n {c |}{res}      2,225    1.377079    .4847638          1          2
{txt}{space 6}ga07_n {c |}{res}      2,225    1.374831    .4841882          1          2
{txt}{space 6}ga08_n {c |}{res}      2,225    1.363596    .4811422          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}      2,225    1.349213    .4768287          1          2
{txt}{space 6}ga10_n {c |}{res}      2,225     1.26382     .440802          1          2
{txt}{space 6}anxd_n {c |}{res}      2,630    1.129658    .3359904          1          2
{txt}{space 5}ANXIETY {c |}{res}      2,225    12.98247    3.224116         10         20
{txt}
{com}. 
. 
. keep HNDID HCys
{txt}
{com}. 
. 
. addstub HCys, stub(w1)
{txt}
{com}. 
. save HOMOCYSTEINE_EXPOSURES_W1,replace
{txt}{p 0 4 2}
file {bf}
HOMOCYSTEINE_EXPOSURES_W1.dta{rm}
saved
{p_end}

{com}. 
.             
. //STEP 13B: CREATE THE EXPOSURE VARIABLES AT WAVE 3//
. 
. use 2023-09-28_anx_wave3,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave3.dta
{txt} Observations:{res}         2,468                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      2,468    4188.203    2448.433          4       8359
{txt}{space 7}HNDID {c |}{res}      2,468    8.16e+09    4.33e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      2,468           3           0          3          3
{txt}{space 9}Sex {c |}{res}      2,468    1.422609    .4940745          1          2
{txt}{space 8}Race {c |}{res}      2,468    1.616694    .4862905          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      2,468    1.404781    .4909491          1          2
{txt}{space 1}EducationYr {c |}{res}      2,433    12.18496    2.579873          1         20
{txt}{space 9}Age {c |}{res}      2,468    52.97776    9.033023       32.9         73
{txt}{space 8}SF01 {c |}{res}      1,760    3.114773    .9365353          1          5
{txt}{space 8}HCys {c |}{res}      1,486    10.40221    10.36594       3.87     303.93
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}          0
{txt}{space 4}PDSQga01 {c |}{res}          0
{txt}{space 4}PDSQga02 {c |}{res}          0
{txt}{space 4}PDSQga03 {c |}{res}          0
{txt}{space 4}PDSQga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}          0
{txt}{space 4}PDSQga06 {c |}{res}          0
{txt}{space 4}PDSQga07 {c |}{res}          0
{txt}{space 4}PDSQga08 {c |}{res}          0
{txt}{space 4}PDSQga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}          0
{txt}CigaretteS~s {c |}{res}      2,103    2.911555    1.127789          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,134     3.31537      .87919          1          4
{txt}{space 3}MarijCurr {c |}{res}      1,990    1.882412    .3222005          1          2
{txt}{space 4}CokeCurr {c |}{res}      1,942    1.969104    .1730805          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      1,877    1.973362    .1610667          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,285    1.363239     .481038          1          2
{txt}{space 6}CVaFib {c |}{res}      2,285    1.089716    .2858363          1          2
{txt}{space 4}CVangina {c |}{res}      2,285    1.100656    .3009391          1          2
{txt}{space 7}CVcad {c |}{res}      2,285    1.042888    .2026498          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,285    1.034573    .1827364          1          2
{txt}{space 8}CVmi {c |}{res}      2,285    1.039387    .1945572          1          2
{txt}AnxietyDis~r {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,263    122.9585    18.23062         76        220
{txt}{space 3}BPsitRdia {c |}{res}      2,262    70.58267    10.04919         40        120
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,250    122.2787    17.98661         76        216
{txt}{space 3}BPsitLdia {c |}{res}      2,246    71.32502    10.32727         40        116
{txt}{space 9}BMI {c |}{res}      2,291    30.63998    7.955704       12.3         88
{txt}{space 7}dxHTN {c |}{res}      2,293    1.580898    .4935197          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,314    1.589023    .8128245          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,140     46.2576    12.05283   16.62035   98.33624
{txt}{space 9}CES {c |}{res}      2,254    15.81233    11.65942          0         56
{txt}{space 6}CES_DA {c |}{res}      2,290    4.859389    5.135249          0         21
{txt}{space 6}CES_IP {c |}{res}      2,290    1.095197    1.450998          0          6
{txt}{space 6}CES_SC {c |}{res}      2,290    7.213537      4.4828          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,290    9.379476    2.830684          0         12
{txt}{space 8}Chol {c |}{res}      2,269    187.4606    41.57405         78        414
{txt}{space 9}HDL {c |}{res}      2,268    56.65785    18.58656         19        176
{txt}{space 6}HgbA1C {c |}{res}      2,265    6.036865    1.241404        3.8       16.2
{txt}{space 5}Albumin {c |}{res}      2,270    4.333789    .3233109        2.6        5.4
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,216    7.889009    29.71592   .0167696   1277.805
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}          0
{txt}{space 6}ga02_n {c |}{res}          0
{txt}{space 6}ga03_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}          0
{txt}{space 6}ga05_n {c |}{res}          0
{txt}{space 6}ga06_n {c |}{res}          0
{txt}{space 6}ga07_n {c |}{res}          0
{txt}{space 6}ga08_n {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}          0
{txt}{space 6}ga10_n {c |}{res}          0
{txt}{space 6}anxd_n {c |}{res}      2,290    1.177729    .3823682          1          2
{txt}{space 5}ANXIETY {c |}{res}          0
{txt}
{com}. 
. 
. keep HNDID HCys
{txt}
{com}. 
. 
. addstub HCys, stub(w3)
{txt}
{com}. 
. save HOMOCYSTEINE_EXPOSURES_W3,replace
{txt}{p 0 4 2}
file {bf}
HOMOCYSTEINE_EXPOSURES_W3.dta{rm}
saved
{p_end}

{com}. 
.             
. //STEP 13C: CREATE THE EXPOSURE VARIABLES AT WAVE 4//
. 
. use 2023-09-28_anx_wave4,clear
{txt}
{com}. 
. describe

{txt}Contains data from {res}2023-09-28_anx_wave4.dta
{txt} Observations:{res}         2,171                  
{txt}    Variables:{res}            74                  30 Oct 2023 11:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:rownames       }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDID          }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HNDwave        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Sex      }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Race           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:Race     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PovStat        }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PovStat  }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:EducationYr    }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Age            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:SF01           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SF01     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HCys           }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Employment01   }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}Employment01{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga01       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga01 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga02       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga02 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga03       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga03 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga04       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga04 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga05       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga05 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga06       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga06 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga07       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga07 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga08       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga08 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga09       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga09 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:PDSQga10       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:PDSQga10 }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CigaretteStatus}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CigaretteStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AlcStatus      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AlcStatus{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:MarijCurr      }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}MarijCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CokeCurr       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CokeCurr }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:OpiateCurr     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}OpiateCurr{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVhighChol     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}CVhighChol{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVaFib         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVaFib   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVangina       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVangina }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVcad          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVcad    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVchf          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVchf    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CVmi           }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:CVmi     }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:AnxietyDisorder}{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}AnxietyDisorder{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitRdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLsys      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BPsitLdia      }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:BMI            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxHTN          }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:dxHTN    }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:dxDiabetes     }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{txt}dxDiabetes{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hei2010_total~e}{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_DA         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_IP         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_SC         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CES_WB         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Chol           }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HDL            }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:HgbA1C         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:Albumin        }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:CRP            }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd           }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga01_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga01_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga02_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga02_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga03_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga03_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga04_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga04_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga05_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga05_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga06_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga06_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga07_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga07_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga08_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga08_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga09_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga09_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ga10_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:ga10_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:anxd_n         }{txt}{bind: long    }{bind:%8.0g     }{space 1}{bind:anxd_n   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ANXIETY        }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}HNDID
{txt}
{com}. su

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      2,171    4182.233    2399.216          5       8357
{txt}{space 7}HNDID {c |}{res}      2,171    8.16e+09    4.24e+07   8.03e+09   8.22e+09
{txt}{space 5}HNDwave {c |}{res}      2,171           4           0          4          4
{txt}{space 9}Sex {c |}{res}      2,171    1.413634    .4925979          1          2
{txt}{space 8}Race {c |}{res}      2,171    1.610778    .4876861          1          2
{txt}{hline 13}{c +}{hline 57}
{space 5}PovStat {c |}{res}      2,171    1.405343    .4910714          1          2
{txt}{space 1}EducationYr {c |}{res}      2,139    12.15895     2.52434          1         20
{txt}{space 9}Age {c |}{res}      2,171    56.60129     9.10942       36.4       76.9
{txt}{space 8}SF01 {c |}{res}      2,129    3.060592     .930676          1          5
{txt}{space 8}HCys {c |}{res}      1,280    10.68614    4.557427       4.18      53.11
{txt}{hline 13}{c +}{hline 57}
Employment01 {c |}{res}          0
{txt}{space 4}PDSQga01 {c |}{res}      1,893     1.15795    .3647908          1          2
{txt}{space 4}PDSQga02 {c |}{res}      1,890    1.198942    .3993098          1          2
{txt}{space 4}PDSQga03 {c |}{res}      1,887    1.173821    .3790558          1          2
{txt}{space 4}PDSQga04 {c |}{res}      1,887    1.244833    .4301022          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga05 {c |}{res}      1,886    1.294804    .4560754          1          2
{txt}{space 4}PDSQga06 {c |}{res}      1,885    1.311406    .4631912          1          2
{txt}{space 4}PDSQga07 {c |}{res}      1,884    1.347134    .4761851          1          2
{txt}{space 4}PDSQga08 {c |}{res}      1,884     1.28397    .4510423          1          2
{txt}{space 4}PDSQga09 {c |}{res}      1,883    1.326606    .4690965          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}PDSQga10 {c |}{res}      1,880     1.23883     .426482          1          2
{txt}CigaretteS~s {c |}{res}      2,013    2.958768    1.137552          1          4
{txt}{space 3}AlcStatus {c |}{res}      2,030    3.298522    .8664082          1          4
{txt}{space 3}MarijCurr {c |}{res}      1,900    1.841579    .3652315          1          2
{txt}{space 4}CokeCurr {c |}{res}      1,852    1.968683    .1742214          1          2
{txt}{hline 13}{c +}{hline 57}
{space 2}OpiateCurr {c |}{res}      1,804    1.972284     .164204          1          2
{txt}{space 2}CVhighChol {c |}{res}      2,107    1.449454    .4975566          1          2
{txt}{space 6}CVaFib {c |}{res}      2,107     1.10916    .3119138          1          2
{txt}{space 4}CVangina {c |}{res}      2,107    1.113906    .3177725          1          2
{txt}{space 7}CVcad {c |}{res}      2,107    1.059801    .2371734          1          2
{txt}{hline 13}{c +}{hline 57}
{space 7}CVchf {c |}{res}      2,107     1.04841    .2146821          1          2
{txt}{space 8}CVmi {c |}{res}      2,107     1.05458    .2272125          1          2
{txt}AnxietyDis~r {c |}{res}      2,151    1.259879    .4386701          1          2
{txt}{space 3}BPsitRsys {c |}{res}      2,113    118.6602    17.79255         80        204
{txt}{space 3}BPsitRdia {c |}{res}      2,112    65.94934    9.811911         40        118
{txt}{hline 13}{c +}{hline 57}
{space 3}BPsitLsys {c |}{res}      2,115     119.079    17.86099         72        208
{txt}{space 3}BPsitLdia {c |}{res}      2,115    67.28747    9.948667         40        120
{txt}{space 9}BMI {c |}{res}      2,142    30.86928    7.952211       13.8       76.5
{txt}{space 7}dxHTN {c |}{res}      2,153    1.648398    .4775815          1          2
{txt}{space 2}dxDiabetes {c |}{res}      2,162    1.650786    .8461863          1          3
{txt}{hline 13}{c +}{hline 57}
hei2010_to~e {c |}{res}      2,066    48.68347    12.09708   14.40958   90.44823
{txt}{space 9}CES {c |}{res}      2,007    13.79771    10.87457          0         57
{txt}{space 6}CES_DA {c |}{res}      2,015    3.893797    4.474094          0         21
{txt}{space 6}CES_IP {c |}{res}      2,015     .830273    1.269134          0          6
{txt}{space 6}CES_SC {c |}{res}      2,015    5.874442    4.275007          0         21
{txt}{hline 13}{c +}{hline 57}
{space 6}CES_WB {c |}{res}      2,015    8.808437    3.147015          0         12
{txt}{space 8}Chol {c |}{res}      2,087     187.966    43.12726         58        409
{txt}{space 9}HDL {c |}{res}      2,085    57.31175    19.81095         14        199
{txt}{space 6}HgbA1C {c |}{res}      2,075    6.212386    1.351279        3.8       19.4
{txt}{space 5}Albumin {c |}{res}      2,086      4.2535    .3457376        2.2        5.4
{txt}{hline 13}{c +}{hline 57}
{space 9}CRP {c |}{res}      2,082    5.310447    9.392764        .15        125
{txt}{space 8}ga01 {c |}{res}          0
{txt}{space 8}ga02 {c |}{res}          0
{txt}{space 8}ga03 {c |}{res}          0
{txt}{space 8}ga04 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga05 {c |}{res}          0
{txt}{space 8}ga06 {c |}{res}          0
{txt}{space 8}ga07 {c |}{res}          0
{txt}{space 8}ga08 {c |}{res}          0
{txt}{space 8}ga09 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 8}ga10 {c |}{res}          0
{txt}{space 8}anxd {c |}{res}          0
{txt}{space 6}ga01_n {c |}{res}      1,893     1.15795    .3647908          1          2
{txt}{space 6}ga02_n {c |}{res}      1,890    1.198942    .3993098          1          2
{txt}{space 6}ga03_n {c |}{res}      1,887    1.173821    .3790558          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga04_n {c |}{res}      1,887    1.244833    .4301022          1          2
{txt}{space 6}ga05_n {c |}{res}      1,886    1.294804    .4560754          1          2
{txt}{space 6}ga06_n {c |}{res}      1,885    1.311406    .4631912          1          2
{txt}{space 6}ga07_n {c |}{res}      1,884    1.347134    .4761851          1          2
{txt}{space 6}ga08_n {c |}{res}      1,884     1.28397    .4510423          1          2
{txt}{hline 13}{c +}{hline 57}
{space 6}ga09_n {c |}{res}      1,883    1.326606    .4690965          1          2
{txt}{space 6}ga10_n {c |}{res}      1,880     1.23883     .426482          1          2
{txt}{space 6}anxd_n {c |}{res}      2,151    1.259879    .4386701          1          2
{txt}{space 5}ANXIETY {c |}{res}      1,880    12.58138    3.213161         10         20
{txt}
{com}. 
. 
. keep HNDID HCys
{txt}
{com}. 
. 
. addstub HCys, stub(w4)
{txt}
{com}. 
. save HOMOCYSTEINE_EXPOSURES_W4,replace
{txt}{p 0 4 2}
file {bf}
HOMOCYSTEINE_EXPOSURES_W4.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 13D: MERGE WAVES, 1, 3 AND 4 EXPOSURES WITH FINAL FILE///
. 
. use DEPRESSIVE_SYMPTOMS_DEMO_WIDEW1W3W4_APPENDED,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save HANDLS_PAPER64_HCYDEPANXIETY_LONG, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. use HOMOCYSTEINE_EXPOSURES_W1,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save HOMOCYSTEINE_EXPOSURES_W1, replace
{txt}{p 0 4 2}
file {bf}
HOMOCYSTEINE_EXPOSURES_W1.dta{rm}
saved
{p_end}

{com}. 
. 
. use HOMOCYSTEINE_EXPOSURES_W3,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save HOMOCYSTEINE_EXPOSURES_W3, replace
{txt}{p 0 4 2}
file {bf}
HOMOCYSTEINE_EXPOSURES_W3.dta{rm}
saved
{p_end}

{com}. 
. 
. use HOMOCYSTEINE_EXPOSURES_W4,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save HOMOCYSTEINE_EXPOSURES_W4, replace
{txt}{p 0 4 2}
file {bf}
HOMOCYSTEINE_EXPOSURES_W4.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG
{txt}
{com}. merge HNDID using HOMOCYSTEINE_EXPOSURES_W1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}     12,079      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. merge HNDID using HOMOCYSTEINE_EXPOSURES_W3
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      2,734       22.63       22.63
{txt}          3 {c |}{res}      9,345       77.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. merge HNDID using HOMOCYSTEINE_EXPOSURES_W4
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,625       30.01       30.01
{txt}          3 {c |}{res}      8,454       69.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save HANDLS_PAPER64_HCYDEPANXIETY_LONG, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************************************************************************************************
. 
. 
. //STEP 13: CREATE ALL OTHER COVARIATE VARIABLES AT WAVES 1 //
. 
. *************************WAVE 1 VARIABLES************************
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. ///DEMOGRAPHICS//
> 
. keep HNDID Race PovStat Sex 
{txt}
{com}. save DEMOGRAPHICS_wave1, replace
{txt}{p 0 4 2}
file {bf}
DEMOGRAPHICS_wave1.dta{rm}
saved
{p_end}

{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
DEMOGRAPHICS_wave1.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG, clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. merge HNDID using DEMOGRAPHICS_wave1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
(label {bf:{txt}PovStat} already defined)
(label {bf:{txt}Race} already defined)
(label {bf:{txt}Sex} already defined)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. // EDUCATION//
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. keep HNDID Education
{txt}
{com}. capture rename Education w1Education
{txt}
{com}. save Educationw1, replace
{txt}{p 0 4 2}
file {bf}
Educationw1.dta{rm}
saved
{p_end}

{com}. sort HNDID
{txt}
{com}. save,replace
{txt}{p 0 4 2}
file {bf}
Educationw1.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using Educationw1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. tab w1Education if HNDwave==1

{txt}w1Education {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}          5        0.14        0.14
{txt}          2 {c |}{res}          9        0.25        0.38
{txt}          3 {c |}{res}          5        0.14        0.52
{txt}          4 {c |}{res}          4        0.11        0.63
{txt}          5 {c |}{res}          5        0.14        0.77
{txt}          6 {c |}{res}         31        0.85        1.62
{txt}          7 {c |}{res}         65        1.78        3.40
{txt}          8 {c |}{res}        134        3.68        7.08
{txt}          9 {c |}{res}        213        5.84       12.92
{txt}         10 {c |}{res}        364        9.98       22.90
{txt}         11 {c |}{res}        410       11.25       34.15
{txt}         12 {c |}{res}      1,253       34.37       68.51
{txt}         13 {c |}{res}        254        6.97       75.48
{txt}         14 {c |}{res}        402       11.03       86.51
{txt}         15 {c |}{res}         76        2.08       88.59
{txt}         16 {c |}{res}        246        6.75       95.34
{txt}         17 {c |}{res}         74        2.03       97.37
{txt}         18 {c |}{res}         70        1.92       99.29
{txt}         20 {c |}{res}         26        0.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,646      100.00
{txt}
{com}. 
. capture drop w1edubr
{txt}
{com}. gen w1edubr=.
{txt}(12,079 missing values generated)

{com}. replace w1edubr=1 if w1Education>=1 & w1Education<=8
{txt}(822 real changes made)

{com}. replace w1edubr=2 if w1Education>=9 & w1Education<=12
{txt}(7,228 real changes made)

{com}. replace w1edubr=3 if w1Education>=13 & w1Education~=.
{txt}(3,814 real changes made)

{com}. 
. tab w1edubr if HNDwave==1

    {txt}w1edubr {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        258        7.08        7.08
{txt}          2 {c |}{res}      2,240       61.44       68.51
{txt}          3 {c |}{res}      1,148       31.49      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,646      100.00
{txt}
{com}. tab w1edubr w1Education

           {txt}{c |}                                                       w1Education
   w1edubr {c |}         1          2          3          4          5          6          7          8          9         10         11 {c |}     Total
{hline 11}{c +}{hline 121}{c +}{hline 10}
         1 {c |}{res}        16         30         17         11         16         94        206        432          0          0          0 {txt}{c |}{res}       822 
{txt}         2 {c |}{res}         0          0          0          0          0          0          0          0        670      1,128      1,349 {txt}{c |}{res}     7,228 
{txt}         3 {c |}{res}         0          0          0          0          0          0          0          0          0          0          0 {txt}{c |}{res}     3,814 
{txt}{hline 11}{c +}{hline 121}{c +}{hline 10}
     Total {c |}{res}        16         30         17         11         16         94        206        432        670      1,128      1,349 {txt}{c |}{res}    11,864 


           {txt}{c |}                                       w1Education
   w1edubr {c |}        12         13         14         15         16         17         18         20 {c |}     Total
{hline 11}{c +}{hline 88}{c +}{hline 10}
         1 {c |}{res}         0          0          0          0          0          0          0          0 {txt}{c |}{res}       822 
{txt}         2 {c |}{res}     4,081          0          0          0          0          0          0          0 {txt}{c |}{res}     7,228 
{txt}         3 {c |}{res}         0        827      1,329        255        831        246        241         85 {txt}{c |}{res}     3,814 
{txt}{hline 11}{c +}{hline 88}{c +}{hline 10}
     Total {c |}{res}     4,081        827      1,329        255        831        246        241         85 {txt}{c |}{res}    11,864 
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. //LIFESTYLE FACTORS: SMOKING AND DRUG USE: CigaretteStatus //
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. keep HNDID CigaretteStatus MarijCurr CokeCurr OpiateCurr
{txt}
{com}. addstub CigaretteStatus MarijCurr CokeCurr OpiateCurr,stub(w1)
{txt}
{com}. sort HNDID
{txt}
{com}. save Smoke_drugsw1,replace
{txt}{p 0 4 2}
file {bf}
Smoke_drugsw1.dta{rm}
saved
{p_end}

{com}. 
. 
. **Current smoking status**
. 
. tab  w1CigaretteStatus

          {txt}w1CigaretteStatus {c |}      Freq.     Percent        Cum.
{hline 28}{c +}{hline 35}
                Never tried {c |}{res}        554       21.43       21.43
{txt}Tried, never used regularly {c |}{res}        261       10.10       31.53
{txt}                Former user {c |}{res}        508       19.65       51.18
{txt}               Current user {c |}{res}      1,262       48.82      100.00
{txt}{hline 28}{c +}{hline 35}
                      Total {c |}{res}      2,585      100.00
{txt}
{com}. su w1CigaretteStatus

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
w1Cigarett~s {c |}{res}      2,585    2.958607    1.202193          1          4
{txt}
{com}. 
. capture drop w1smoke
{txt}
{com}. gen w1smoke=.
{txt}(3,720 missing values generated)

{com}. replace w1smoke=1 if w1CigaretteStatus==4 
{txt}(1,262 real changes made)

{com}. replace w1smoke=0 if w1CigaretteStatus~=4 & w1CigaretteStatus~=.
{txt}(1,323 real changes made)

{com}. replace w1smoke=9 if w1smoke==.
{txt}(1,135 real changes made)

{com}. 
. tab1 w1smoke w1CigaretteStatus w1MarijCurr w1CokeCurr w1OpiateCurr

{res}-> tabulation of w1smoke  

    {txt}w1smoke {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,323       35.56       35.56
{txt}          1 {c |}{res}      1,262       33.92       69.49
{txt}          9 {c |}{res}      1,135       30.51      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00

-> tabulation of w1CigaretteStatus  

          {txt}w1CigaretteStatus {c |}      Freq.     Percent        Cum.
{hline 28}{c +}{hline 35}
                Never tried {c |}{res}        554       21.43       21.43
{txt}Tried, never used regularly {c |}{res}        261       10.10       31.53
{txt}                Former user {c |}{res}        508       19.65       51.18
{txt}               Current user {c |}{res}      1,262       48.82      100.00
{txt}{hline 28}{c +}{hline 35}
                      Total {c |}{res}      2,585      100.00

-> tabulation of w1MarijCurr  

{txt}w1MarijCurr {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        Yes {c |}{res}        352       13.65       13.65
{txt}         No {c |}{res}      2,227       86.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,579      100.00

-> tabulation of w1CokeCurr  

 {txt}w1CokeCurr {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        Yes {c |}{res}        158        6.10        6.10
{txt}         No {c |}{res}      2,433       93.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,591      100.00

-> tabulation of w1OpiateCurr  

{txt}w1OpiateCur {c |}
          r {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        Yes {c |}{res}         92        3.67        3.67
{txt}         No {c |}{res}      2,417       96.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,509      100.00
{txt}
{com}. 
. capture drop w1smoke1 w1smoke9
{txt}
{com}. gen w1smoke1=1 if w1smoke==1
{txt}(2,458 missing values generated)

{com}. replace w1smoke1=0 if w1smoke~=1
{txt}(2,458 real changes made)

{com}. 
. gen w1smoke9=1 if w1smoke==9
{txt}(2,585 missing values generated)

{com}. replace w1smoke9=0 if w1smoke~=9
{txt}(2,585 real changes made)

{com}. 
. sort HNDID
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
Smoke_drugsw1.dta{rm}
saved
{p_end}

{com}. 
. 
. **Current drug use**
. 
. tab1 w1MarijCurr w1CokeCurr w1OpiateCurr

{res}-> tabulation of w1MarijCurr  

{txt}w1MarijCurr {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        Yes {c |}{res}        352       13.65       13.65
{txt}         No {c |}{res}      2,227       86.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,579      100.00

-> tabulation of w1CokeCurr  

 {txt}w1CokeCurr {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        Yes {c |}{res}        158        6.10        6.10
{txt}         No {c |}{res}      2,433       93.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,591      100.00

-> tabulation of w1OpiateCurr  

{txt}w1OpiateCur {c |}
          r {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        Yes {c |}{res}         92        3.67        3.67
{txt}         No {c |}{res}      2,417       96.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,509      100.00
{txt}
{com}. 
. capture drop w1currdrugs
{txt}
{com}. gen w1currdrugs=.
{txt}(3,720 missing values generated)

{com}. replace w1currdrugs=1 if w1MarijCurr==1 | w1CokeCurr==1 | w1OpiateCurr==1
{txt}(453 real changes made)

{com}. replace w1currdrugs=0 if w1currdrugs~=1 & w1MarijCurr~=. & w1CokeCurr~=. & w1OpiateCurr~=.
{txt}(2,044 real changes made)

{com}. replace w1currdrugs=9 if w1currdrugs==.
{txt}(1,223 real changes made)

{com}. 
. tab w1currdrugs

{txt}w1currdrugs {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,044       54.95       54.95
{txt}          1 {c |}{res}        453       12.18       67.12
{txt}          9 {c |}{res}      1,223       32.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. tab w1currdrugs w1MarijCurr

{txt}w1currdrug {c |}      w1MarijCurr
         s {c |}       Yes         No {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         0      2,044 {txt}{c |}{res}     2,044 
{txt}         1 {c |}{res}       352         99 {txt}{c |}{res}       451 
{txt}         9 {c |}{res}         0         84 {txt}{c |}{res}        84 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       352      2,227 {txt}{c |}{res}     2,579 
{txt}
{com}. tab w1currdrugs w1CokeCurr

{txt}w1currdrug {c |}      w1CokeCurr
         s {c |}       Yes         No {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         0      2,044 {txt}{c |}{res}     2,044 
{txt}         1 {c |}{res}       158        293 {txt}{c |}{res}       451 
{txt}         9 {c |}{res}         0         96 {txt}{c |}{res}        96 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       158      2,433 {txt}{c |}{res}     2,591 
{txt}
{com}. tab w1currdrugs w1OpiateCurr

{txt}w1currdrug {c |}     w1OpiateCurr
         s {c |}       Yes         No {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         0      2,044 {txt}{c |}{res}     2,044 
{txt}         1 {c |}{res}        92        347 {txt}{c |}{res}       439 
{txt}         9 {c |}{res}         0         26 {txt}{c |}{res}        26 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        92      2,417 {txt}{c |}{res}     2,509 
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
Smoke_drugsw1.dta{rm}
saved
{p_end}

{com}. 
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using Smoke_drugsw1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. //CES-D, BMI, SELF-RATED HEALTH AND CO-MORBIND CONDITIONS//
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. keep HNDID BMI SF01 dxHTN dxDiabetes CVhighChol CVaFib CVangina CVcad CVchf CVmi 
{txt}
{com}. 
. addstub SF01-dxDiabetes,stub(w1)
{txt}
{com}. 
. save HEALTH_w1, replace
{txt}{p 0 4 2}
file {bf}
HEALTH_w1.dta{rm}
saved
{p_end}

{com}. 
. tab w1SF01

     {txt}w1SF01 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       Poor {c |}{res}        187        5.03        5.03
{txt}       Fair {c |}{res}        827       22.25       27.28
{txt}       Good {c |}{res}      1,498       40.30       67.58
{txt}      vGood {c |}{res}        909       24.46       92.04
{txt}  Excellent {c |}{res}        296        7.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,717      100.00
{txt}
{com}. 
. 
. capture drop w1SRH
{txt}
{com}. gen w1SRH=.
{txt}(3,720 missing values generated)

{com}. replace w1SRH=1 if w1SF01==1 | w1SF01==2
{txt}(1,014 real changes made)

{com}. replace w1SRH=2 if w1SF01==3
{txt}(1,498 real changes made)

{com}. replace w1SRH=3 if w1SF01==4 | w1SF01==5
{txt}(1,205 real changes made)

{com}. 
. 
. tab w1SRH

      {txt}w1SRH {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,014       27.28       27.28
{txt}          2 {c |}{res}      1,498       40.30       67.58
{txt}          3 {c |}{res}      1,205       32.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,717      100.00
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HEALTH_w1.dta{rm}
saved
{p_end}

{com}. 
. su w1dxHTN w1dxDiabetes

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}w1dxHTN {c |}{res}      2,750    1.467273    .4990185          1          2
{txt}w1dxDiabetes {c |}{res}      2,756    1.526488    .7736745          1          3
{txt}
{com}. 
. tab1 w1dxHTN w1dxDiabetes

{res}-> tabulation of w1dxHTN  

    {txt}w1dxHTN {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      1,465       53.27       53.27
{txt}        Yes {c |}{res}      1,285       46.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,750      100.00

-> tabulation of w1dxDiabetes  

{txt}w1dxDiabete {c |}
          s {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       NoDx {c |}{res}      1,786       64.80       64.80
{txt}preDiabetes {c |}{res}        489       17.74       82.55
{txt}   Diabetes {c |}{res}        481       17.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,756      100.00
{txt}
{com}. 
. 
. tab1 w1CVhighChol 

{res}-> tabulation of w1CVhighChol  

{txt}w1CVhighCho {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      1,819       72.85       72.85
{txt}        Yes {c |}{res}        678       27.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,497      100.00
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HEALTH_w1.dta{rm}
saved
{p_end}

{com}. 
. tab1  w1CVaFib w1CVangina w1CVcad w1CVchf w1CVmi

{res}-> tabulation of w1CVaFib  

   {txt}w1CVaFib {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,306       92.09       92.09
{txt}        Yes {c |}{res}        198        7.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,504      100.00

-> tabulation of w1CVangina  

 {txt}w1CVangina {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,271       90.69       90.69
{txt}        Yes {c |}{res}        233        9.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,504      100.00

-> tabulation of w1CVcad  

    {txt}w1CVcad {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,408       96.13       96.13
{txt}        Yes {c |}{res}         97        3.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,505      100.00

-> tabulation of w1CVchf  

    {txt}w1CVchf {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,433       97.13       97.13
{txt}        Yes {c |}{res}         72        2.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,505      100.00

-> tabulation of w1CVmi  

     {txt}w1CVmi {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,411       96.32       96.32
{txt}        Yes {c |}{res}         92        3.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,503      100.00
{txt}
{com}. 
. capture drop w1cvdbr
{txt}
{com}. gen w1cvdbr=.
{txt}(3,720 missing values generated)

{com}. replace w1cvdbr=1 if w1CVaFib==2 | w1CVangina==2 | w1CVcad==2 | w1CVchf==2 | w1CVmi==2
{txt}(461 real changes made)

{com}. replace w1cvdbr=0 if w1cvdbr~=1 & w1CVaFib~=. & w1CVangina~=. & w1CVcad~=. & w1CVchf~=. & w1CVmi~=.
{txt}(2,042 real changes made)

{com}. 
. 
. tab w1cvdbr

    {txt}w1cvdbr {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,042       81.58       81.58
{txt}          1 {c |}{res}        461       18.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,503      100.00
{txt}
{com}. 
. 
. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HEALTH_w1.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. merge HNDID using HEALTH_w1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. //HEI, Wave 1://
. 
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. keep HNDID hei2010_total_score
{txt}
{com}. addstub hei2010_total_score,stub(w1)
{txt}
{com}. sort HNDID
{txt}
{com}. save Otherdietarysw1,replace
{txt}{p 0 4 2}
file {bf}
Otherdietarysw1.dta{rm}
saved
{p_end}

{com}. 
. 
. su w1hei2010_total_score

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
w1hei2010_~e {c |}{res}      2,177    42.59318    11.48268   12.62117   89.42492
{txt}
{com}. histogram w1hei2010_total_score
{txt}(bin={res}33{txt}, start={res}12.62117{txt}, width={res}2.3273864{txt})
{res}{txt}
{com}. 
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. merge HNDID using Otherdietarysw1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANXIETY VARIABLES, WAVE 1//
. 
. 
. use 2023-09-28_anx_wave1,clear
{txt}
{com}. capture rename HNDID HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. capture drop ANXIETY_ORD
{txt}
{com}. gen ANXIETY_ORD=ANXIETY-10
{txt}(1,495 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
2023-09-28_anx_wave1.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. keep HNDID ANXIETY* AnxietyDisorder ga* anxd
{txt}
{com}. addstub ANXIETY* AnxietyDisorder ga* anxd,stub(w1)
{txt}
{com}. sort HNDID
{txt}
{com}. save ANXIETYw1,replace
{txt}{p 0 4 2}
file {bf}
ANXIETYw1.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. merge HNDID using ANXIETYw1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
(label {bf:{txt}AnxietyDisorder} already defined)

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 14: CREATE DEPRESSIVE SYMPTOMS SELECTION VARIABLES//
. 
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. capture drop sample_CES=.
{txt}
{com}. gen sample_CES=1 if w1CES~=. | w3CES~=. | w4CES~=.
{txt}(1,459 missing values generated)

{com}. replace sample_CES=0 if sample_CES~=1
{txt}(1,459 real changes made)

{com}. 
. tab sample_CES if HNDwave==1

 {txt}sample_CES {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        692       18.60       18.60
{txt}          1 {c |}{res}      3,028       81.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. //STEP 15A: RENAME FIXED COVARIATES///
. 
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. capture rename w1Sex Sex
{txt}
{com}. capture rename w1Race Race
{txt}
{com}. capture rename w1PovStat PovStat
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 15B: CREATE EMPIRICAL BAYES ESTIMATORS FOR CES-D TOTAL SCORE AND DOMAINS ANNUALIZED RATE OF CHANGE: //
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. 
. 
. **CES**
. 
. xtmixed CES timew1w3w4 ||HNDID: timew1w3w4, cov(un)
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-26047.164}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-26021.171}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-26020.415}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-26020.406}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-26020.406}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 6,997
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 3,028
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.3
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res} 23.90
{txt}Log likelihood = {res}-26020.406{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         CES{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2}-.1279407{col 26}{space 2} .0261719{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.1792366{col 67}{space 3}-.0766448
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 15.63814{col 26}{space 2} .2115595{col 37}{space 1}   73.92{col 46}{space 3}0.000{col 54}{space 4} 15.22349{col 67}{space 3} 16.05279
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Unstructured{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .3485934{col 44} .0903266{col 58} .2097771{col 70} .5792689
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 9.083296{col 44} .2062307{col 58} 8.687953{col 70} 9.496629
{txt}{space 6}corr(timew1w3w4,_cons) {c |}{res}{col 33}-.3817178{col 44} .0745101{col 58}-.5175696{col 70}-.2270942
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 7.243474{col 44} .1140634{col 58} 7.023329{col 70}  7.47052
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}3{txt}) = {res}1830.25{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. 
. capture drop e_consCES e_TIMECES
{txt}
{com}. predict  e_TIMECES e_consCES, reffects level(HNDID)
{txt}(1,459 missing values generated)
(1,459 missing values generated)

{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}     6,997{col 28}        .{col 39}-26020.41{col 50}     6{col 58} 52052.81{col 69} 52093.93
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. capture drop bayes1CES
{txt}
{com}. gen bayes1CES= -.1279407  +e_TIMECES
{txt}(1,459 missing values generated)

{com}. 
. 
. su bayes1CES  

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}bayes1CES {c |}{res}     10,620     -.12722    .1112121  -.6282941   .2223563
{txt}
{com}. 
. 
. su bayes1CES if HNDwave==1,det

                          {txt}bayes1CES
{hline 61}
      Percentiles      Smallest
 1%    {res}-.4401833      -.6282941
{txt} 5%    {res}-.3371408      -.5566962
{txt}10%    {res}-.2831894      -.5534463       {txt}Obs         {res}      3,028
{txt}25%    {res}-.1871673      -.5395759       {txt}Sum of wgt. {res}      3,028

{txt}50%    {res} -.110424                      {txt}Mean          {res}-.1279407
                        {txt}Largest       Std. dev.     {res} .1101825
{txt}75%    {res}-.0499281       .2054381
{txt}90%    {res}-.0092219       .2077951       {txt}Variance      {res} .0121402
{txt}95%    {res} .0120952       .2212858       {txt}Skewness      {res}-.7375311
{txt}99%    {res}  .085207       .2223563       {txt}Kurtosis      {res} 3.796309
{txt}
{com}. su bayes1CES if HNDwave==3,det

                          {txt}bayes1CES
{hline 61}
      Percentiles      Smallest
 1%    {res}-.4478911      -.5566962
{txt} 5%    {res}-.3384229      -.5534463
{txt}10%    {res}-.2811071      -.5395759       {txt}Obs         {res}      2,399
{txt}25%    {res} -.185408      -.5324442       {txt}Sum of wgt. {res}      2,399

{txt}50%    {res}-.1063404                      {txt}Mean          {res}-.1257214
                        {txt}Largest       Std. dev.     {res}  .111613
{txt}75%    {res}-.0460021       .2054381
{txt}90%    {res}-.0074193       .2077951       {txt}Variance      {res} .0124575
{txt}95%    {res} .0160277       .2212858       {txt}Skewness      {res}-.7270684
{txt}99%    {res} .0953117       .2223563       {txt}Kurtosis      {res} 3.795737
{txt}
{com}. 
. 
. histogram bayes1CES if HNDwave==1
{txt}(bin={res}34{txt}, start={res}-.62829405{txt}, width={res}.02501913{txt})
{res}{txt}
{com}. 
. 
. 
. **CES_DA**
. 
. xtmixed CES_DA timew1w3w4 ||HNDID: timew1w3w4, cov(un)
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-20603.873}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-20568.841}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-20566.666}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-20566.443}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-20566.405}  
{res}{txt}Iteration 5:{space 2}Log likelihood = {res:-20566.404}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 7,099
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 3,058
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.3
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res} 44.66
{txt}Log likelihood = {res}-20566.404{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_DA{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2} -.075786{col 26}{space 2} .0113402{col 37}{space 1}   -6.68{col 46}{space 3}0.000{col 54}{space 4}-.0980124{col 67}{space 3}-.0535595
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  4.82739{col 26}{space 2} .0921623{col 37}{space 1}   52.38{col 46}{space 3}0.000{col 54}{space 4} 4.646755{col 67}{space 3} 5.008025
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Unstructured{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .0690563{col 44}        .{col 58}        .{col 70}        .
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 3.891876{col 44}        .{col 58}        .{col 70}        .
{txt}{space 6}corr(timew1w3w4,_cons) {c |}{res}{col 33}-.9999992{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 3.315684{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}3{txt}) = {res}1614.66{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. 
. capture drop e_consCES_DA e_TIMECES_DA
{txt}
{com}. predict  e_TIMECES_DA e_consCES_DA, reffects level(HNDID)
{txt}(1,389 missing values generated)
(1,389 missing values generated)

{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}     7,099{col 28}        .{col 39} -20566.4{col 50}     2{col 58} 41136.81{col 69} 41150.54
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. capture drop bayes1CES_DA
{txt}
{com}. gen bayes1CES_DA= -.075786  +e_TIMECES_DA
{txt}(1,389 missing values generated)

{com}. 
. 
. su bayes1CES_DA  

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bayes1CES_DA {c |}{res}     10,690   -.0756385     .059132   -.312223  -.0076478
{txt}
{com}. 
. 
. su bayes1CES_DA if HNDwave==1,det

                        {txt}bayes1CES_DA
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2493804       -.312223
{txt} 5%    {res}-.1945109      -.3003779
{txt}10%    {res}-.1639393      -.2792588       {txt}Obs         {res}      3,058
{txt}25%    {res}-.1084046      -.2754567       {txt}Sum of wgt. {res}      3,058

{txt}50%    {res}-.0594996                      {txt}Mean          {res} -.075786
                        {txt}Largest       Std. dev.     {res} .0584691
{txt}75%    {res}-.0276845      -.0077714
{txt}90%    {res}-.0142135      -.0077587       {txt}Variance      {res} .0034186
{txt}95%    {res} -.008857       -.007746       {txt}Skewness      {res}-1.078277
{txt}99%    {res}-.0082223      -.0076478       {txt}Kurtosis      {res} 3.620301
{txt}
{com}. su bayes1CES_DA if HNDwave==3,det

                        {txt}bayes1CES_DA
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2530487       -.312223
{txt} 5%    {res}-.1975328      -.3003779
{txt}10%    {res}-.1666555      -.2792588       {txt}Obs         {res}      2,408
{txt}25%    {res}-.1084613      -.2754567       {txt}Sum of wgt. {res}      2,408

{txt}50%    {res}-.0596093                      {txt}Mean          {res}-.0756838
                        {txt}Largest       Std. dev.     {res}  .060226
{txt}75%    {res}-.0271471      -.0077714
{txt}90%    {res}-.0138288      -.0077587       {txt}Variance      {res} .0036272
{txt}95%    {res}-.0085932       -.007746       {txt}Skewness      {res}-1.082558
{txt}99%    {res}  -.00817      -.0076478       {txt}Kurtosis      {res} 3.610137
{txt}
{com}. 
. 
. histogram bayes1CES_DA if HNDwave==1
{txt}(bin={res}34{txt}, start={res}-.31222299{txt}, width={res}.00895809{txt})
{res}{txt}
{com}. 
. 
. 
. **CES_SC**
. 
. xtmixed CES_SC timew1w3w4 ||HNDID: timew1w3w4, cov(un)
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-20107.431}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-20078.729}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-20077.807}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-20077.789}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-20077.789}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 7,099
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 3,058
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.3
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res} 51.57
{txt}Log likelihood = {res}-20077.789{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_SC{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2}-.0806016{col 26}{space 2} .0112242{col 37}{space 1}   -7.18{col 46}{space 3}0.000{col 54}{space 4}-.1026007{col 67}{space 3}-.0586025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.994053{col 26}{space 2} .0816427{col 37}{space 1}   85.67{col 46}{space 3}0.000{col 54}{space 4} 6.834036{col 67}{space 3} 7.154069
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Unstructured{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .1381727{col 44} .0415158{col 58} .0766774{col 70} .2489872
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 3.219574{col 44} .0900939{col 58} 3.047748{col 70} 3.401087
{txt}{space 6}corr(timew1w3w4,_cons) {c |}{res}{col 33}-.4052348{col 44} .0822736{col 58}-.5530973{col 70}-.2326224
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 3.192472{col 44} .0485514{col 58} 3.098717{col 70} 3.289063
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}3{txt}) = {res}1161.47{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. 
. capture drop e_consCES_SC e_TIMECES_SC
{txt}
{com}. predict  e_TIMECES_SC e_consCES_SC, reffects level(HNDID)
{txt}(1,389 missing values generated)
(1,389 missing values generated)

{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}     7,099{col 28}        .{col 39}-20077.79{col 50}     6{col 58} 40167.58{col 69} 40208.78
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. capture drop bayes1CES_SC
{txt}
{com}. gen bayes1CES_SC= -.0806016 +e_TIMECES_SC
{txt}(1,389 missing values generated)

{com}. 
. 
. su bayes1CES_SC  

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bayes1CES_SC {c |}{res}     10,690   -.0805261    .0415586  -.2841231   .0506789
{txt}
{com}. 
. 
. su bayes1CES_SC if HNDwave==1,det

                        {txt}bayes1CES_SC
{hline 61}
      Percentiles      Smallest
 1%    {res}-.1861448      -.2841231
{txt} 5%    {res}-.1557833       -.229719
{txt}10%    {res}-.1366988      -.2235658       {txt}Obs         {res}      3,058
{txt}25%    {res}-.1069611      -.2194345       {txt}Sum of wgt. {res}      3,058

{txt}50%    {res}-.0784511                      {txt}Mean          {res}-.0806016
                        {txt}Largest       Std. dev.     {res} .0412628
{txt}75%    {res}-.0509052       .0218509
{txt}90%    {res}-.0281804       .0257232       {txt}Variance      {res} .0017026
{txt}95%    {res}-.0192699       .0382957       {txt}Skewness      {res}-.4600571
{txt}99%    {res}-.0045237       .0506789       {txt}Kurtosis      {res} 3.133082
{txt}
{com}. su bayes1CES_SC if HNDwave==3,det

                        {txt}bayes1CES_SC
{hline 61}
      Percentiles      Smallest
 1%    {res}-.1864711       -.229719
{txt} 5%    {res}-.1560849      -.2235658
{txt}10%    {res}-.1368594      -.2194345       {txt}Obs         {res}      2,408
{txt}25%    {res}-.1063582      -.2127995       {txt}Sum of wgt. {res}      2,408

{txt}50%    {res}-.0766746                      {txt}Mean          {res}-.0802532
                        {txt}Largest       Std. dev.     {res} .0415938
{txt}75%    {res}-.0502262       .0210982
{txt}90%    {res}-.0284054       .0218509       {txt}Variance      {res}   .00173
{txt}95%    {res}-.0191254       .0382957       {txt}Skewness      {res}-.4446882
{txt}99%    {res}-.0029759       .0506789       {txt}Kurtosis      {res}  2.99746
{txt}
{com}. 
. 
. histogram bayes1CES_SC if HNDwave==1
{txt}(bin={res}34{txt}, start={res}-.28412309{txt}, width={res}.00984712{txt})
{res}{txt}
{com}. 
. **CES_IP**
. 
. xtmixed CES_IP timew1w3w4 ||HNDID: timew1w3w4, cov(un)
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-11963.658}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-11924.068}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-11920.932}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-11920.714}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-11920.687}  
{res}{txt}Iteration 5:{space 2}Log likelihood = {res:-11920.687}  
{res}
{txt}Computing standard errors:
standard-error calculation has failed
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 7,099
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 3,058
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.3
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res} 16.30
{txt}Log likelihood = {res}-11920.687{col 54}{txt}Prob > chi2{col 70} = {res}0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_IP{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2}-.0144396{col 26}{space 2} .0035761{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.0214486{col 67}{space 3}-.0074305
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.054208{col 26}{space 2} .0253822{col 37}{space 1}   41.53{col 46}{space 3}0.000{col 54}{space 4}  1.00446{col 67}{space 3} 1.103956
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Unstructured{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .0144438{col 44}        .{col 58}        .{col 70}        .
{txt}{space 19}sd(_cons) {c |}{res}{col 33} .9361761{col 44}        .{col 58}        .{col 70}        .
{txt}{space 6}corr(timew1w3w4,_cons) {c |}{res}{col 33}       -1{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 1.061049{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}3{txt}) = {res}841.60{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}
{p 0 9 4}Warning: Standard-error calculation {mansection ME meRemarksandexamplesDiagnosingconvergenceproblems:failed}.{p_end}

{com}. 
. 
. capture drop e_cons_CES_IP e_TIMECES_IP
{txt}
{com}. predict  e_TIME_CES_IP e_cons_CES_IP, reffects level(HNDID)
{txt}(1,389 missing values generated)
(1,389 missing values generated)

{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}     7,099{col 28}        .{col 39}-11920.69{col 50}     2{col 58} 23845.37{col 69} 23859.11
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. capture drop bayes1CES_IP
{txt}
{com}. gen bayes1CES_IP= -.0144396 +e_TIME_CES_IP
{txt}(1,389 missing values generated)

{com}. 
. 
. su bayes1CES_IP  

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bayes1CES_IP {c |}{res}     10,690   -.0143708    .0112845  -.0697646  -.0032558
{txt}
{com}. 
. 
. su bayes1CES_IP if HNDwave==1,det

                        {txt}bayes1CES_IP
{hline 61}
      Percentiles      Smallest
 1%    {res}-.0480206      -.0697646
{txt} 5%    {res}-.0367633      -.0697564
{txt}10%    {res}-.0298647      -.0661646       {txt}Obs         {res}      3,058
{txt}25%    {res}-.0208269      -.0659743       {txt}Sum of wgt. {res}      3,058

{txt}50%    {res}-.0105754                      {txt}Mean          {res}-.0144396
                        {txt}Largest       Std. dev.     {res}  .011162
{txt}75%    {res}-.0055326      -.0032836
{txt}90%    {res}-.0034694      -.0032829       {txt}Variance      {res} .0001246
{txt}95%    {res}-.0034266      -.0032559       {txt}Skewness      {res} -1.33933
{txt}99%    {res}-.0033109      -.0032558       {txt}Kurtosis      {res} 4.736336
{txt}
{com}. su bayes1CES_IP if HNDwave==3,det

                        {txt}bayes1CES_IP
{hline 61}
      Percentiles      Smallest
 1%    {res}-.0505922      -.0697646
{txt} 5%    {res}-.0370135      -.0697564
{txt}10%    {res}-.0298965      -.0661646       {txt}Obs         {res}      2,408
{txt}25%    {res} -.020715      -.0659743       {txt}Sum of wgt. {res}      2,408

{txt}50%    {res}-.0106714                      {txt}Mean          {res}-.0142882
                        {txt}Largest       Std. dev.     {res} .0113657
{txt}75%    {res}-.0048162      -.0032836
{txt}90%    {res} -.003453      -.0032829       {txt}Variance      {res} .0001292
{txt}95%    {res}-.0034107      -.0032559       {txt}Skewness      {res}-1.362528
{txt}99%    {res}-.0033014      -.0032558       {txt}Kurtosis      {res} 4.890318
{txt}
{com}. 
. 
. histogram bayes1CES_IP if HNDwave==1
{txt}(bin={res}34{txt}, start={res}-.06976456{txt}, width={res}.00195614{txt})
{res}{txt}
{com}. 
. **CES_WB**
. 
. xtmixed CES_WB timew1w3w4 ||HNDID: timew1w3w4, cov(un)
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-17406.468}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-17386.301}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-17386.139}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-17386.139}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 7,099
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 3,058
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.3
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res} 36.54
{txt}Log likelihood = {res}-17386.139{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_WB{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2}-.0491547{col 26}{space 2} .0081316{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.0650923{col 67}{space 3}-.0332171
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 9.345061{col 26}{space 2} .0536589{col 37}{space 1}  174.16{col 46}{space 3}0.000{col 54}{space 4} 9.239892{col 67}{space 3} 9.450231
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Unstructured{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .1553915{col 44} .0194933{col 58} .1215198{col 70} .1987043
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 2.031183{col 44} .0634125{col 58} 1.910623{col 70}  2.15935
{txt}{space 6}corr(timew1w3w4,_cons) {c |}{res}{col 33}-.2370659{col 44} .0740837{col 58}-.3761012{col 70}-.0875902
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 2.177357{col 44} .0344455{col 58} 2.110881{col 70} 2.245927
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}3{txt}) = {res}890.63{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. 
. capture drop e_cons_CES_WB e_TIMECES_WB
{txt}
{com}. predict  e_TIMECES_WB e_cons_CES_WB, reffects level(HNDID)
{txt}(1,389 missing values generated)
(1,389 missing values generated)

{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}     7,099{col 28}        .{col 39}-17386.14{col 50}     6{col 58} 34784.28{col 69} 34825.48
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. capture drop bayes1CES_WB
{txt}
{com}. gen bayes1CES_WB=   -.0491547 +e_TIMECES_WB
{txt}(1,389 missing values generated)

{com}. 
. 
. su bayes1CES_WB  

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
bayes1CES_WB {c |}{res}     10,690   -.0496128    .0559275  -.2831072   .2008129
{txt}
{com}. 
. 
. su bayes1CES_WB if HNDwave==1,det

                        {txt}bayes1CES_WB
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2146019      -.2831072
{txt} 5%    {res}-.1456454      -.2791547
{txt}10%    {res}-.1131017      -.2750199       {txt}Obs         {res}      3,058
{txt}25%    {res}-.0715596      -.2672825       {txt}Sum of wgt. {res}      3,058

{txt}50%    {res}-.0462427                      {txt}Mean          {res}-.0491547
                        {txt}Largest       Std. dev.     {res} .0539053
{txt}75%    {res}-.0195747       .1950778
{txt}90%    {res}  .007636       .1953543       {txt}Variance      {res} .0029058
{txt}95%    {res} .0297079       .1982135       {txt}Skewness      {res} -.317404
{txt}99%    {res} .0814298       .2008129       {txt}Kurtosis      {res}  5.56077
{txt}
{com}. su bayes1CES_WB if HNDwave==3,det

                        {txt}bayes1CES_WB
{hline 61}
      Percentiles      Smallest
 1%    {res}-.2209693      -.2831072
{txt} 5%    {res}-.1532451      -.2791547
{txt}10%    {res} -.120123      -.2750199       {txt}Obs         {res}      2,408
{txt}25%    {res}-.0790599      -.2672825       {txt}Sum of wgt. {res}      2,408

{txt}50%    {res}-.0457797                      {txt}Mean          {res}-.0505188
                        {txt}Largest       Std. dev.     {res} .0566731
{txt}75%    {res}-.0186531       .1950778
{txt}90%    {res}  .007947       .1953543       {txt}Variance      {res} .0032118
{txt}95%    {res} .0291976       .1982135       {txt}Skewness      {res}-.3320984
{txt}99%    {res} .0863636       .2008129       {txt}Kurtosis      {res} 5.240606
{txt}
{com}. 
. 
. histogram bayes1CES_WB if HNDwave==1
{txt}(bin={res}34{txt}, start={res}-.28310716{txt}, width={res}.01423294{txt})
{res}{txt}
{com}. 
. 
. **HCY***
. capture drop LnHCys
{txt}
{com}. gen LnHCys=ln(HCys)
{txt}(7,853 missing values generated)

{com}. 
. xtmixed LnHCys timew1w3w4 ||HNDID: timew1w3w4, cov(un)
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-672.99393}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-659.64166}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-658.91821}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-658.88234}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-658.88185}  
{res}{txt}Iteration 5:{space 2}Log likelihood = {res:-658.88185}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 4,226
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 1,576
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.7
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res}419.29
{txt}Log likelihood = {res}-658.88185{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      LnHCys{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2} .0185574{col 26}{space 2} .0009063{col 37}{space 1}   20.48{col 46}{space 3}0.000{col 54}{space 4} .0167811{col 67}{space 3} .0203336
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.155515{col 26}{space 2} .0084456{col 37}{space 1}  255.22{col 46}{space 3}0.000{col 54}{space 4} 2.138962{col 67}{space 3} 2.172068
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Unstructured{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .0053417{col 44} .0052747{col 58} .0007712{col 70} .0370003
{txt}{space 19}sd(_cons) {c |}{res}{col 33} .2743762{col 44} .0076972{col 58} .2596972{col 70} .2898848
{txt}{space 6}corr(timew1w3w4,_cons) {c |}{res}{col 33} .3854822{col 44} .5768318{col 58}-.7265621{col 70} .9395705
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .2000513{col 44} .0037809{col 58} .1927765{col 70} .2076007
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}3{txt}) = {res}1677.50{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. 
. capture drop e_cons_LnHcys e_TIME_LnHcys
{txt}
{com}. predict  e_TIME_LnHcys e_cons_LnHcys, reffects level(HNDID)
{txt}(6,046 missing values generated)
(6,046 missing values generated)

{com}. 
. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}     4,226{col 28}        .{col 39}-658.8819{col 50}     6{col 58} 1329.764{col 69} 1367.858
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] IC note}}.{p_end}

{com}. 
. capture drop bayes1HCys
{txt}
{com}. gen bayes1HCys=   .0185574  + e_TIME_LnHcys
{txt}(6,046 missing values generated)

{com}. 
. 
. su bayes1HCys  

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}bayes1HCys {c |}{res}      6,033    .0185374    .0022863   .0130147    .034075
{txt}
{com}. 
. 
. su bayes1HCys if HNDwave==1,det

                         {txt}bayes1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res} .0141261       .0130147
{txt} 5%    {res} .0152401       .0131037
{txt}10%    {res} .0159896       .0132496       {txt}Obs         {res}      1,576
{txt}25%    {res} .0170537       .0133357       {txt}Sum of wgt. {res}      1,576

{txt}50%    {res} .0183289                      {txt}Mean          {res} .0185574
                        {txt}Largest       Std. dev.     {res}  .002299
{txt}75%    {res} .0197171       .0296737
{txt}90%    {res} .0213793       .0296941       {txt}Variance      {res} 5.29e-06
{txt}95%    {res} .0226486       .0303369       {txt}Skewness      {res}  1.05313
{txt}99%    {res}  .025649        .034075       {txt}Kurtosis      {res} 6.101011
{txt}
{com}. su bayes1HCys if HNDwave==3,det

                         {txt}bayes1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res} .0141261       .0130147
{txt} 5%    {res} .0152376       .0131037
{txt}10%    {res} .0159867       .0132496       {txt}Obs         {res}      1,542
{txt}25%    {res} .0170307       .0133357       {txt}Sum of wgt. {res}      1,542

{txt}50%    {res} .0183215                      {txt}Mean          {res} .0185359
                        {txt}Largest       Std. dev.     {res} .0022836
{txt}75%    {res} .0196907       .0285485
{txt}90%    {res} .0213458       .0296941       {txt}Variance      {res} 5.21e-06
{txt}95%    {res} .0226261       .0303369       {txt}Skewness      {res} 1.017795
{txt}99%    {res} .0254272        .034075       {txt}Kurtosis      {res} 5.994339
{txt}
{com}. 
. 
. histogram bayes1HCys if HNDwave==1
{txt}(bin={res}31{txt}, start={res}.01301472{txt}, width={res}.00067936{txt})
{res}{txt}
{com}. 
. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. //STEP 16: COLLAPSE THE EMPIRICAL BAYES ESTIMATORS AND RE-MERGE WITH DATA//
. 
. use  HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. 
. keep HNDID bayes1*
{txt}
{com}. 
. save bayes1_depchange, replace
{txt}{p 0 4 2}
file {bf}
bayes1_depchange.dta{rm}
saved
{p_end}

{com}. 
. collapse (mean) bayes1*, by(HNDID)
{res}{txt}
{com}. 
. save bayes1_depchange_collapse, replace
{txt}{p 0 4 2}
file {bf}
bayes1_depchange_collapse.dta{rm}
saved
{p_end}

{com}. 
. addstub bayes1*, stub(w1w3w4)
{txt}
{com}. 
. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
bayes1_depchange_collapse.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using bayes1_depchange_collapse
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}     12,079      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 17: CREATE STEPWISE SELECTION PROCESS FOR FLOWCHART//
. 
. **Initial wave 1 sample: SAMPLE1**
. 
. capture drop sample1
{txt}
{com}. gen sample1=1 if w1Age~=.
{txt}
{com}. replace sample1=0 if sample1~=1
{txt}(0 real changes made)

{com}. 
. tab sample1

    {txt}sample1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     12,079      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. tab sample1 if HNDwave==1

    {txt}sample1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. **Sample with complete w1 HCys load  exposure data: SAMPLE2**
. 
. capture drop sample2
{txt}
{com}. gen sample2=1 if w1HCys~=.
{txt}(6,495 missing values generated)

{com}. replace sample2=0 if sample2~=1
{txt}(6,495 real changes made)

{com}. 
. tab sample2

    {txt}sample2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,495       53.77       53.77
{txt}          1 {c |}{res}      5,584       46.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. tab sample2 if HNDwave==1

    {txt}sample2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,260       60.75       60.75
{txt}          1 {c |}{res}      1,460       39.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. save, replace 
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. **Samples with complete CES-D data at waves 1 and/or 3 and/or 4: SAMPLE3**
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. 
. keep HNDID sample_CES
{txt}
{com}. 
. save selectCES, replace
{txt}{p 0 4 2}
file {bf}
selectCES.dta{rm}
saved
{p_end}

{com}. collapse (mean) sample_CES, by(HNDID)
{res}{txt}
{com}. 
. save sampleCES_collapse, replace
{txt}{p 0 4 2}
file {bf}
sampleCES_collapse.dta{rm}
saved
{p_end}

{com}. sort HNDID
{txt}
{com}. addstub sample_CES, stub(w1w3w4)
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
sampleCES_collapse.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. 
. merge HNDID using sampleCES_collapse
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}     12,079      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. capture drop sample3obs
{txt}
{com}. gen sample3obs=.
{txt}(12,079 missing values generated)

{com}. replace sample3obs=1 if w1w3w4sample_CES>0 & w1w3w4sample_CES~=. & sample_CES==1 & HNDwave==1 | w1w3w4sample_CES>0 & w1w3w4sample_CES~=. & sample_CES==1 & HNDwave==3 | w1w3w4sample_CES>0 & w1w3w4sample_CES~=. & sample_CES==1 & HNDwave==4 
{txt}(7,592 real changes made)

{com}. replace sample3obs=0 if sample3obs~=1 
{txt}(4,487 real changes made)

{com}. 
. capture drop sample3part
{txt}
{com}. gen sample3part=.
{txt}(12,079 missing values generated)

{com}. replace sample3part=1 if w1w3w4sample_CES>0 & w1w3w4sample_CES~=. & HNDwave==1 | w1w3w4sample_CES>0 & w1w3w4sample_CES~=.  & HNDwave==3 | w1w3w4sample_CES>0 & w1w3w4sample_CES~=.  & HNDwave==4 
{txt}(7,592 real changes made)

{com}. replace sample3part=0 if sample3part~=1 
{txt}(4,487 real changes made)

{com}. 
. tab sample3obs if HNDwave==1  | HNDwave==3  | HNDwave==4

 {txt}sample3obs {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        767        9.18        9.18
{txt}          1 {c |}{res}      7,592       90.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,359      100.00
{txt}
{com}. tab sample3part if HNDwave==1

{txt}sample3part {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        692       18.60       18.60
{txt}          1 {c |}{res}      3,028       81.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. xtmixed CES timew1w3w4 || HNDID: timew1w3w4
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26070.03}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-26028.825}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-26026.076}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-26025.883}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-26025.877}  
{res}{txt}Iteration 5:{space 2}Log likelihood = {res:-26025.877}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 6,997
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 3,028
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.3
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}1{txt}){col 70} = {res} 23.30
{txt}Log likelihood = {res}-26025.877{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         CES{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}timew1w3w4 {c |}{col 14}{res}{space 2}-.1241456{col 26}{space 2} .0257213{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-.1745585{col 67}{space 3}-.0737327
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 15.62451{col 26}{space 2} .2063698{col 37}{space 1}   75.71{col 46}{space 3}0.000{col 54}{space 4} 15.22003{col 67}{space 3} 16.02899
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Independent{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} 1.29e-07{col 44} 5.47e-08{col 58} 5.60e-08{col 70} 2.96e-07
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 8.617701{col 44} .1530456{col 58} 8.322898{col 70} 8.922946
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 7.408574{col 44} .0827102{col 58} 7.248226{col 70}  7.57247
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1819.31{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. **Samples with complete depressive symptoms data at waves 1 and/or 3 and HCys data at wave 1: SAMPLE4 SERIES**
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. 
. 
. **sample4: N=2,298; N'=5,548, k=2.4**
. 
. 
. capture drop sample4obs
{txt}
{com}. gen sample4obs=.
{txt}(12,079 missing values generated)

{com}. replace sample4obs=1 if sample3obs==1 & w1HCys~=.
{txt}(4,124 real changes made)

{com}. replace sample4obs=0 if sample4obs~=1 
{txt}(7,955 real changes made)

{com}. 
. capture drop sample4part
{txt}
{com}. gen sample4part=1 if sample3part==1 &  w1HCys~=.
{txt}(7,955 missing values generated)

{com}. replace sample4part=0 if sample4part~=1 
{txt}(7,955 real changes made)

{com}. 
. tab sample4obs if HNDwave==1  | HNDwave==3  

 {txt}sample4obs {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,300       53.33       53.33
{txt}          1 {c |}{res}      2,888       46.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      6,188      100.00
{txt}
{com}. tab sample4part if HNDwave==1

{txt}sample4part {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,260       60.75       60.75
{txt}          1 {c |}{res}      1,460       39.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. 
. xtmixed CES c.timew1w3##c.w1HCys || HNDID: timew1w3w4
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-14766.093}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-14748.932}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res: -14747.96}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-14747.919}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-14747.918}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 4,015
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 1,460
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.8
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}3{txt}){col 70} = {res} 12.77
{txt}Log likelihood = {res}-14747.918{col 54}{txt}Prob > chi2{col 70} = {res}0.0052

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  CES{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}timew1w3w4 {c |}{col 23}{res}{space 2}-.0812394{col 35}{space 2} .0664584{col 46}{space 1}   -1.22{col 55}{space 3}0.222{col 63}{space 4}-.2114956{col 76}{space 3} .0490167
{txt}{space 15}w1HCys {c |}{col 23}{res}{space 2} .0431124{col 35}{space 2} .0541301{col 46}{space 1}    0.80{col 55}{space 3}0.426{col 63}{space 4}-.0629807{col 76}{space 3} .1492055
{txt}{space 21} {c |}
c.timew1w3w4#c.w1HCys {c |}{col 23}{res}{space 2}-.0034461{col 35}{space 2} .0064178{col 46}{space 1}   -0.54{col 55}{space 3}0.591{col 63}{space 4}-.0160247{col 76}{space 3} .0091325
{txt}{space 21} {c |}
{space 16}_cons {c |}{col 23}{res}{space 2} 14.00033{col 35}{space 2} .5703457{col 46}{space 1}   24.55{col 55}{space 3}0.000{col 63}{space 4} 12.88247{col 76}{space 3} 15.11818
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Independent{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .0000776{col 44} .0133455{col 58} 3.0e-151{col 70} 2.0e+142
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 8.483653{col 44} .2013171{col 58} 8.098114{col 70} 8.887547
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 7.160936{col 44} .1001956{col 58} 6.967225{col 70} 7.360033
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1222.72{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. xtmixed CES_DA c.timew1w3##c.w1HCys || HNDID: timew1w3w4
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-11482.645}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-11456.179}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-11455.084}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res: -11455.08}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res: -11455.08}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 4,032
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 1,460
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.8
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}3{txt}){col 70} = {res} 28.09
{txt}Log likelihood = {res} -11455.08{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               CES_DA{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}timew1w3w4 {c |}{col 23}{res}{space 2}-.0623699{col 35}{space 2} .0294034{col 46}{space 1}   -2.12{col 55}{space 3}0.034{col 63}{space 4}-.1199995{col 76}{space 3}-.0047402
{txt}{space 15}w1HCys {c |}{col 23}{res}{space 2} .0110212{col 35}{space 2} .0230789{col 46}{space 1}    0.48{col 55}{space 3}0.633{col 63}{space 4}-.0342127{col 76}{space 3}  .056255
{txt}{space 21} {c |}
c.timew1w3w4#c.w1HCys {c |}{col 23}{res}{space 2}-.0014315{col 35}{space 2}  .002841{col 46}{space 1}   -0.50{col 55}{space 3}0.614{col 63}{space 4}-.0069997{col 76}{space 3} .0041367
{txt}{space 21} {c |}
{space 16}_cons {c |}{col 23}{res}{space 2} 4.378544{col 35}{space 2} .2430675{col 46}{space 1}   18.01{col 55}{space 3}0.000{col 63}{space 4} 3.902141{col 76}{space 3} 4.854948
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Independent{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} 9.94e-11{col 44} 5.53e-11{col 58} 3.34e-11{col 70} 2.96e-10
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 3.527891{col 44}  .086398{col 58} 3.362554{col 70} 3.701358
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 3.173729{col 44} .0443067{col 58} 3.088067{col 70} 3.261767
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1070.17{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. xtmixed CES_IP c.timew1w3##c.w1HCys || HNDID: timew1w3w4
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-6520.5602}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-6497.8931}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-6497.1181}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-6497.1174}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-6497.1174}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 4,032
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 1,460
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.8
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}3{txt}){col 70} = {res}  7.14
{txt}Log likelihood = {res}-6497.1174{col 54}{txt}Prob > chi2{col 70} = {res}0.0676

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               CES_IP{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}timew1w3w4 {c |}{col 23}{res}{space 2} -.006571{col 35}{space 2} .0092555{col 46}{space 1}   -0.71{col 55}{space 3}0.478{col 63}{space 4}-.0247114{col 76}{space 3} .0115693
{txt}{space 15}w1HCys {c |}{col 23}{res}{space 2} .0070484{col 35}{space 2}  .006239{col 46}{space 1}    1.13{col 55}{space 3}0.259{col 63}{space 4}-.0051798{col 76}{space 3} .0192766
{txt}{space 21} {c |}
c.timew1w3w4#c.w1HCys {c |}{col 23}{res}{space 2}-.0004704{col 35}{space 2} .0008944{col 46}{space 1}   -0.53{col 55}{space 3}0.599{col 63}{space 4}-.0022235{col 76}{space 3} .0012826
{txt}{space 21} {c |}
{space 16}_cons {c |}{col 23}{res}{space 2} .8769231{col 35}{space 2} .0656475{col 46}{space 1}   13.36{col 55}{space 3}0.000{col 63}{space 4} .7482563{col 76}{space 3}  1.00559
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Independent{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} 2.60e-12{col 44} 1.55e-12{col 58} 8.09e-13{col 70} 8.37e-12
{txt}{space 19}sd(_cons) {c |}{res}{col 33} .8228982{col 44}  .024317{col 58} .7765916{col 70} .8719659
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 1.003451{col 44} .0139672{col 58} .9764454{col 70} 1.031203
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}551.07{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. xtmixed CES_SC c.timew1w3##c.w1HCys || HNDID: timew1w3w4
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-11264.009}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-11246.754}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-11245.849}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-11245.806}  
{res}{txt}Iteration 4:{space 2}Log likelihood = {res:-11245.805}  
{res}{txt}Iteration 5:{space 2}Log likelihood = {res:-11245.805}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 4,032
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 1,460
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.8
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}3{txt}){col 70} = {res} 36.53
{txt}Log likelihood = {res}-11245.805{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               CES_SC{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}timew1w3w4 {c |}{col 23}{res}{space 2}-.0840625{col 35}{space 2} .0288088{col 46}{space 1}   -2.92{col 55}{space 3}0.004{col 63}{space 4}-.1405267{col 76}{space 3}-.0275983
{txt}{space 15}w1HCys {c |}{col 23}{res}{space 2} .0166912{col 35}{space 2} .0211482{col 46}{space 1}    0.79{col 55}{space 3}0.430{col 63}{space 4}-.0247585{col 76}{space 3} .0581408
{txt}{space 21} {c |}
c.timew1w3w4#c.w1HCys {c |}{col 23}{res}{space 2} .0000613{col 35}{space 2} .0027837{col 46}{space 1}    0.02{col 55}{space 3}0.982{col 63}{space 4}-.0053947{col 76}{space 3} .0055173
{txt}{space 21} {c |}
{space 16}_cons {c |}{col 23}{res}{space 2} 6.539215{col 35}{space 2} .2226508{col 46}{space 1}   29.37{col 55}{space 3}0.000{col 63}{space 4} 6.102827{col 76}{space 3} 6.975602
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Independent{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} 7.74e-08{col 44} 4.14e-08{col 58} 2.72e-08{col 70} 2.21e-07
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 3.062848{col 44} .0797567{col 58}  2.91045{col 70} 3.223226
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 3.114738{col 44} .0433526{col 58} 3.030917{col 70} 3.200877
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}846.32{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. xtmixed CES_WB c.timew1w3##c.w1HCys || HNDID: timew1w3w4
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-9547.8178}  
{res}{txt}Iteration 1:{space 2}Log likelihood = {res:-9542.9612}  
{res}{txt}Iteration 2:{space 2}Log likelihood = {res:-9542.9321}  
{res}{txt}Iteration 3:{space 2}Log likelihood = {res:-9542.9321}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 54}Number of obs{col 70} = {res} 4,032
{txt}Group variable: {res}HNDID{col 54}{txt}Number of groups{col 70} = {res} 1,460
{txt}{col 54}Obs per group:
{col 67}min = {res}     1
{txt}{col 67}avg = {res}   2.8
{txt}{col 67}max = {res}     3
{col 54}{txt}Wald chi2({res}3{txt}){col 70} = {res} 33.85
{txt}Log likelihood = {res}-9542.9321{col 54}{txt}Prob > chi2{col 70} = {res}0.0000

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               CES_WB{col 23}{c |} Coefficient{col 35}  Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}timew1w3w4 {c |}{col 23}{res}{space 2}-.0734598{col 35}{space 2} .0205602{col 46}{space 1}   -3.57{col 55}{space 3}0.000{col 63}{space 4}-.1137571{col 76}{space 3}-.0331625
{txt}{space 15}w1HCys {c |}{col 23}{res}{space 2}-.0070254{col 35}{space 2} .0129428{col 46}{space 1}   -0.54{col 55}{space 3}0.587{col 63}{space 4}-.0323928{col 76}{space 3}  .018342
{txt}{space 21} {c |}
c.timew1w3w4#c.w1HCys {c |}{col 23}{res}{space 2} .0017226{col 35}{space 2} .0019799{col 46}{space 1}    0.87{col 55}{space 3}0.384{col 63}{space 4}-.0021579{col 76}{space 3} .0056031
{txt}{space 21} {c |}
{space 16}_cons {c |}{col 23}{res}{space 2} 9.790284{col 35}{space 2} .1362189{col 46}{space 1}   71.87{col 55}{space 3}0.000{col 63}{space 4}   9.5233{col 76}{space 3} 10.05727
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}HNDID{txt}: Independent{col 30}{c |}
{space 14}sd(timew1w3w4) {c |}{res}{col 33} .1410697{col 44} .0153832{col 58} .1139233{col 70} .1746845
{txt}{space 19}sd(_cons) {c |}{res}{col 33} 1.746625{col 44} .0543134{col 58} 1.643351{col 70} 1.856388
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} 2.036133{col 44} .0330576{col 58} 1.972361{col 70} 2.101966
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}640.60{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}. 
. 
. save HANDLS_PAPER64_HCYDEPANXIETY_LONG, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. //STEP 18: CREATE INVERSE MILLS RATIOS FOR FINAL SELECTED SAMPLES FOR MIXED-EFFECTS REGRESSION MODELS//
. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG, clear
{txt}
{com}. 
. 
. xi:probit sample4obs w1Age Race PovStat Sex

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-7754.3822}  
Iteration 1:{space 2}Log likelihood = {res:-7710.9748}  
Iteration 2:{space 2}Log likelihood = {res:-7710.9676}  
Iteration 3:{space 2}Log likelihood = {res:-7710.9676}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:12,079}
{txt}{col 57}{lalign 13:LR chi2({res:4})}{col 70} = {res}{ralign 6:86.83}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-7710.9676}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0056}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  sample4obs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0041239{col 26}{space 2} .0012809{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.0066345{col 67}{space 3}-.0016133
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.1066353{col 26}{space 2} .0242149{col 37}{space 1}   -4.40{col 46}{space 3}0.000{col 54}{space 4}-.1540957{col 67}{space 3} -.059175
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.1559099{col 26}{space 2} .0244117{col 37}{space 1}   -6.39{col 46}{space 3}0.000{col 54}{space 4}-.2037559{col 67}{space 3}-.1080638
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0820968{col 26}{space 2} .0238142{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.1287718{col 67}{space 3}-.0354217
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2962679{col 26}{space 2} .0887148{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .1223901{col 67}{space 3} .4701456
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. capture drop p1CES
{txt}
{com}. predict p1CES, xb
{txt}
{com}. 
. capture drop phiCES
{txt}
{com}. capture drop caphiCES
{txt}
{com}. capture drop invmillsCES
{txt}
{com}. 
. gen phiCES=(1/sqrt(2*_pi))*exp(-(p1CES^2/2))
{txt}
{com}. 
. egen caphiCES=std(p1CES)
{txt}
{com}. 
. capture drop invmillsCES
{txt}
{com}. gen invmillsCES=phiCES/caphiCES
{txt}
{com}. 
. 
. su invmillsCES

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}invmillsCES {c |}{res}     12,079    .7446791    45.62387  -256.8285     3476.2
{txt}
{com}. 
. save , replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}