{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\HANDLS_PAPER64_HCYDEPANXIETY_LONG\OUTPUT\TABLE1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Jun 2024, 09:15:26
{txt}
{com}. 
. 
. //////////////////////////TABLE 1: STUDY CHARACTERISTICS OVERALL AND BY W1 HCys LOAD TERTILE/////////////////////////////////////
> 
. 
. use finaldata_imputed_FINAL,clear
{txt}
{com}. 
. 
. capture drop CESDcut16
{txt}
{com}. mi passive: gen CESDcut16=.
{res}{txt}{it:m}=0:
(12,079 missing values generated)
{it:m}=1:
(12,079 missing values generated)
{it:m}=2:
(12,079 missing values generated)
{it:m}=3:
(12,079 missing values generated)
{it:m}=4:
(12,079 missing values generated)
{it:m}=5:
(12,079 missing values generated)

{com}. mi passive: replace CESDcut16=1 if CES>=16 & CES~=.
{res}{txt}{it:m}=0:
(2,817 real changes made)
{it:m}=1:
(2,817 real changes made)
{it:m}=2:
(2,817 real changes made)
{it:m}=3:
(2,817 real changes made)
{it:m}=4:
(2,817 real changes made)
{it:m}=5:
(2,817 real changes made)

{com}. mi passive: replace CESDcut16=0 if CESDcut16~=1 & CES~=.
{res}{txt}{it:m}=0:
(4,180 real changes made)
{it:m}=1:
(4,180 real changes made)
{it:m}=2:
(4,180 real changes made)
{it:m}=3:
(4,180 real changes made)
{it:m}=4:
(4,180 real changes made)
{it:m}=5:
(4,180 real changes made)

{com}. 
. mi estimate: prop CESDcut16 if sample4part==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     4,015
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      4014
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  4,012.00
{txt}{col 35}        avg{col 51}= {res}  4,012.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  4,012.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}CESDcut16 {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .6400996{col 26}{space 2} .0075748{col 37}{space 5} .6252488{col 51}{space 3} .6549505
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .3599004{col 26}{space 2} .0075748{col 37}{space 5} .3450495{col 51}{space 3} .3747512
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_55ec_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_55ec_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. *******PRELIMINARY ANALYSIS******************
. 
. tab w1ANXIETY_ORD if sample4part==1 & _mi_m==0

{txt}w1ANXIETY_O {c |}
         RD {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,289       38.58       38.58
{txt}          1 {c |}{res}        436       13.05       51.63
{txt}          2 {c |}{res}        264        7.90       59.53
{txt}          3 {c |}{res}        212        6.35       65.88
{txt}          4 {c |}{res}        190        5.69       71.57
{txt}          5 {c |}{res}        210        6.29       77.85
{txt}          6 {c |}{res}        159        4.76       82.61
{txt}          7 {c |}{res}        145        4.34       86.95
{txt}          8 {c |}{res}        146        4.37       91.32
{txt}          9 {c |}{res}        171        5.12       96.44
{txt}         10 {c |}{res}        119        3.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,341      100.00
{txt}
{com}. 
. capture drop w1ANXIETYbr
{txt}
{com}. xtile w1ANXIETYbr=w1ANXIETY_ORD if sample4part==1,nq(2)
{txt}
{com}. 
. tab w1ANXIETYbr

{txt}2 quantiles {c |}
         of {c |}
w1ANXIETY_O {c |}
        RD  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     10,350       51.63       51.63
{txt}          2 {c |}{res}      9,696       48.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     20,046      100.00
{txt}
{com}. tab w1ANXIETYbr if HNDwave==1 & sample4part==1 & _mi_m==0

{txt}2 quantiles {c |}
         of {c |}
w1ANXIETY_O {c |}
        RD  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        610       51.65       51.65
{txt}          2 {c |}{res}        571       48.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,181      100.00
{txt}
{com}. 
. tab w1AnxietyDisorder if HNDwave==1 & sample4part==1 & _mi_m==0

{txt}w1AnxietyDi {c |}
     sorder {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      1,201       89.23       89.23
{txt}        Yes {c |}{res}        145       10.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,346      100.00
{txt}
{com}. 
. tab w1AnxietyDisorder w1ANXIETYbr if HNDwave==1 & sample4part==1 & _mi_m==0, row col chi
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}    2 quantiles of
w1AnxietyD {c |}    w1ANXIETY_ORD 
   isorder {c |}         1          2 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
        No {c |}{res}       532        431 {txt}{c |}{res}       963 
           {txt}{c |}{res}     55.24      44.76 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     95.86      82.25 {txt}{c |}{res}     89.25 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
       Yes {c |}{res}        23         93 {txt}{c |}{res}       116 
           {txt}{c |}{res}     19.83      80.17 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}      4.14      17.75 {txt}{c |}{res}     10.75 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       555        524 {txt}{c |}{res}     1,079 
           {txt}{c |}{res}     51.44      48.56 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}          Pearson chi2({res}1{txt}) = {res} 51.9866  {txt} Pr = {res}0.000
{txt}
{com}. 
. capture drop zR_traj_ProbG2ANXIETY
{txt}
{com}. egen zR_traj_ProbG2ANXIETY=std(R_traj_ProbG2ANXIETY)
{txt}(13,956 missing values generated)

{com}. su R_traj_ProbG2ANXIETY

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
R_t~2ANXIETY {c |}{res}     58,518    .4647508    .4676884   .0000323          1
{txt}
{com}. 
. 
. 
. capture drop w1w3HCys_change
{txt}
{com}. gen w1w3HCys_change=(w3HCys-w1HCys)/(w3Age-w1Age)
{txt}(40,620 missing values generated)

{com}. 
. capture drop zw1w3HCys_change
{txt}
{com}. mi passive: egen zw1w3HCys_change=std(w1w3HCys_change) if sample4obs==1
{res}{txt}{it:m}=0:
(8,152 missing values generated)
{err}{p 0 4 2}
file {bf:{err}C:\Users\baydounm\AppData\Local\Temp\ST_55ec_000002.tmp}
already exists
{p_end}
{txt}{search r(602), local:r(602);}

end of do-file

{search r(602), local:r(602);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD55ec_000000.tmp"
{txt}
{com}. mi passive: egen zw1w3HCys_change=std(w1w3HCys_change) if sample4obs==1
{res}{txt}{it:m}=0:
(8,152 missing values generated)
{it:m}=1:
(8,152 missing values generated)
{it:m}=2:
(8,152 missing values generated)
{it:m}=3:
(8,152 missing values generated)
{it:m}=4:
(8,152 missing values generated)
{it:m}=5:
(8,152 missing values generated)

{com}. 
. 
. capture drop Lnodds_highANXIETY
{txt}
{com}. gen Lnodds_highANXIETY=ln(R_traj_ProbG2ANXIETY/(1-R_traj_ProbG2ANXIETY))
{txt}(20,280 missing values generated)

{com}. 
. 
. su w1w3HCys_change if sample4obs==1 & HNDwave==1 & _mi_m==0, det

                       {txt}w1w3HCys_change
{hline 61}
      Percentiles      Smallest
 1%    {res}-1.745455      -16.27805
{txt} 5%    {res}-.6255814      -8.709524
{txt}10%    {res}      -.4      -6.953571       {txt}Obs         {res}      1,382
{txt}25%    {res}-.1105263      -4.931707       {txt}Sum of wgt. {res}      1,382

{txt}50%    {res}     .156                      {txt}Mean          {res} .2514102
                        {txt}Largest       Std. dev.     {res} 1.664265
{txt}75%    {res} .4653061       10.33654
{txt}90%    {res}    .7875       13.15636       {txt}Variance      {res} 2.769777
{txt}95%    {res} 1.077586       31.99811       {txt}Skewness      {res} 12.62292
{txt}99%    {res}     3.23       36.79615       {txt}Kurtosis      {res}   277.66
{txt}
{com}. su w1w3w4HCysTRAJ if sample4obs==1 & HNDwave==1 & _mi_m==0, det

                       {txt}w1w3w4HCysTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0000168       7.15e-06
{txt} 5%    {res} .0000676       7.80e-06
{txt}10%    {res} .0002518       8.32e-06       {txt}Obs         {res}      1,457
{txt}25%    {res} .0016011       9.84e-06       {txt}Sum of wgt. {res}      1,457

{txt}50%    {res} .0073214                      {txt}Mean          {res} .1190203
                        {txt}Largest       Std. dev.     {res} .2789834
{txt}75%    {res} .0317507              1
{txt}90%    {res} .5914975              1       {txt}Variance      {res} .0778317
{txt}95%    {res}  .993731              1       {txt}Skewness      {res} 2.500619
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 7.667722
{txt}
{com}. bysort w1HCystert: su w1HCys if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1HCystert = 1

                           w1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res}     3.68           2.88
{txt} 5%    {res}     4.73           3.61
{txt}10%    {res}     5.18           3.63       {txt}Obs         {res}        485
{txt}25%    {res}     5.83           3.68       {txt}Sum of wgt. {res}        485

{txt}50%    {res}     6.43                      {txt}Mean          {res} 6.287897
                        {txt}Largest       Std. dev.     {res} .7986795
{txt}75%    {res}     6.92           7.35
{txt}90%    {res}     7.19           7.36       {txt}Variance      {res}  .637889
{txt}95%    {res}     7.26           7.37       {txt}Skewness      {res} -.955659
{txt}99%    {res}     7.35           7.37       {txt}Kurtosis      {res} 3.839676

{txt}{hline}
-> w1HCystert = 2

                           w1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res}     7.39           7.38
{txt} 5%    {res}     7.48           7.38
{txt}10%    {res}     7.59           7.38       {txt}Obs         {res}        489
{txt}25%    {res}      7.9           7.39       {txt}Sum of wgt. {res}        489

{txt}50%    {res}     8.39                      {txt}Mean          {res} 8.423252
                        {txt}Largest       Std. dev.     {res} .6127069
{txt}75%    {res}     8.95           9.52
{txt}90%    {res}     9.31           9.52       {txt}Variance      {res} .3754097
{txt}95%    {res}     9.42           9.52       {txt}Skewness      {res} .0939394
{txt}99%    {res}     9.51           9.52       {txt}Kurtosis      {res} 1.841086

{txt}{hline}
-> w1HCystert = 3

                           w1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res}     9.57           9.53
{txt} 5%    {res}     9.67           9.54
{txt}10%    {res}     9.77           9.54       {txt}Obs         {res}        486
{txt}25%    {res}    10.25           9.56       {txt}Sum of wgt. {res}        486

{txt}50%    {res}    11.23                      {txt}Mean          {res} 12.81728
                        {txt}Largest       Std. dev.     {res} 7.664707
{txt}75%    {res}    12.72           56.7
{txt}90%    {res}    15.82          65.19       {txt}Variance      {res} 58.74773
{txt}95%    {res}    19.79           90.8       {txt}Skewness      {res} 8.400445
{txt}99%    {res}    49.13         112.59       {txt}Kurtosis      {res} 90.69033

{txt}{hline}
-> w1HCystert = .

                           w1HCys
{hline 61}
no observations


{com}. bysort w1HCystert: su Lnw1HCys if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1HCystert = 1

                          Lnw1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res} 1.302913        1.05779
{txt} 5%    {res} 1.553925       1.283708
{txt}10%    {res} 1.644805       1.289233       {txt}Obs         {res}        485
{txt}25%    {res} 1.763017       1.302913       {txt}Sum of wgt. {res}        485

{txt}50%    {res} 1.860975                      {txt}Mean          {res} 1.829577
                        {txt}Largest       Std. dev.     {res} .1391454
{txt}75%    {res} 1.934416         1.9947
{txt}90%    {res} 1.972691        1.99606       {txt}Variance      {res} .0193615
{txt}95%    {res}  1.98238       1.997418       {txt}Skewness      {res}-1.466951
{txt}99%    {res}   1.9947       1.997418       {txt}Kurtosis      {res}  6.13651

{txt}{hline}
-> w1HCystert = 2

                          Lnw1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res} 2.000128       1.998774
{txt} 5%    {res} 2.012233       1.998774
{txt}10%    {res} 2.026832       1.998774       {txt}Obs         {res}        489
{txt}25%    {res} 2.066863       2.000128       {txt}Sum of wgt. {res}        489

{txt}50%    {res} 2.127041                      {txt}Mean          {res} 2.128355
                        {txt}Largest       Std. dev.     {res} .0727667
{txt}75%    {res} 2.191653       2.253395
{txt}90%    {res} 2.231089       2.253395       {txt}Variance      {res}  .005295
{txt}95%    {res} 2.242835       2.253395       {txt}Skewness      {res}  .002812
{txt}99%    {res} 2.252344       2.253395       {txt}Kurtosis      {res} 1.839519

{txt}{hline}
-> w1HCystert = 3

                          Lnw1HCys
{hline 61}
      Percentiles      Smallest
 1%    {res} 2.258633       2.254445
{txt} 5%    {res} 2.269028       2.255493
{txt}10%    {res} 2.279316       2.255493       {txt}Obs         {res}        486
{txt}25%    {res} 2.327278       2.257588       {txt}Sum of wgt. {res}        486

{txt}50%    {res} 2.418589                      {txt}Mean          {res} 2.489648
                        {txt}Largest       Std. dev.     {res} .2827109
{txt}75%    {res} 2.543175       4.037774
{txt}90%    {res} 2.761275       4.177306       {txt}Variance      {res} .0799255
{txt}95%    {res} 2.985177       4.508659       {txt}Skewness      {res} 3.728283
{txt}99%    {res}  3.89447       4.723753       {txt}Kurtosis      {res} 22.61876

{txt}{hline}
-> w1HCystert = .

                          Lnw1HCys
{hline 61}
no observations


{com}. bysort w1ANXIETYbr: su w1ANXIETY_ORD if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1ANXIETYbr = 1

                        w1ANXIETY_ORD
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        610
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}        610

{txt}50%    {res}        0                      {txt}Mean          {res} .2508197
                        {txt}Largest       Std. dev.     {res} .4338407
{txt}75%    {res}        1              1
{txt}90%    {res}        1              1       {txt}Variance      {res} .1882177
{txt}95%    {res}        1              1       {txt}Skewness      {res} 1.149661
{txt}99%    {res}        1              1       {txt}Kurtosis      {res}  2.32172

{txt}{hline}
-> w1ANXIETYbr = 2

                        w1ANXIETY_ORD
{hline 61}
      Percentiles      Smallest
 1%    {res}        2              2
{txt} 5%    {res}        2              2
{txt}10%    {res}        2              2       {txt}Obs         {res}        571
{txt}25%    {res}        3              2       {txt}Sum of wgt. {res}        571

{txt}50%    {res}        5                      {txt}Mean          {res} 5.476357
                        {txt}Largest       Std. dev.     {res} 2.588921
{txt}75%    {res}        8             10
{txt}90%    {res}        9             10       {txt}Variance      {res}  6.70251
{txt}95%    {res}       10             10       {txt}Skewness      {res} .2447458
{txt}99%    {res}       10             10       {txt}Kurtosis      {res} 1.809846

{txt}{hline}
-> w1ANXIETYbr = .

                        w1ANXIETY_ORD
{hline 61}
no observations


{com}. bysort w1ANXIETYbr: su w1w4ANXIETYTRAJ if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1ANXIETYbr = 1

                       w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0000358        .000033
{txt} 5%    {res} .0000431       .0000333
{txt}10%    {res} .0000521        .000034       {txt}Obs         {res}        610
{txt}25%    {res} .0000926        .000034       {txt}Sum of wgt. {res}        610

{txt}50%    {res} .0008526                      {txt}Mean          {res} .1064699
                        {txt}Largest       Std. dev.     {res} .2774526
{txt}75%    {res} .0102245       .9999998
{txt}90%    {res} .5476592       .9999999       {txt}Variance      {res} .0769799
{txt}95%    {res} .9899545              1       {txt}Skewness      {res} 2.625772
{txt}99%    {res}  .999998              1       {txt}Kurtosis      {res} 8.210591

{txt}{hline}
-> w1ANXIETYbr = 2

                       w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0025802       .0014823
{txt} 5%    {res} .0164517       .0016023
{txt}10%    {res} .1248035       .0016771       {txt}Obs         {res}        571
{txt}25%    {res} .8713382       .0018231       {txt}Sum of wgt. {res}        571

{txt}50%    {res}  .999774                      {txt}Mean          {res}  .816692
                        {txt}Largest       Std. dev.     {res} .3373462
{txt}75%    {res}        1              1
{txt}90%    {res}        1              1       {txt}Variance      {res} .1138025
{txt}95%    {res}        1              1       {txt}Skewness      {res}-1.604597
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 3.840119

{txt}{hline}
-> w1ANXIETYbr = .

                       w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0058442       .0055233
{txt} 5%    {res} .0063654       .0055329
{txt}10%    {res} .0069909       .0058442       {txt}Obs         {res}        202
{txt}25%    {res} .0087164       .0059591       {txt}Sum of wgt. {res}        202

{txt}50%    {res} .0681027                      {txt}Mean          {res} .3790371
                        {txt}Largest       Std. dev.     {res} .4481791
{txt}75%    {res} .9931216              1
{txt}90%    {res} .9999996              1       {txt}Variance      {res} .2008645
{txt}95%    {res} .9999999              1       {txt}Skewness      {res} .5521184
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 1.393617

{txt}
{com}. bysort w1AnxietyDisorder: su w1ANXIETY_ORD if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1AnxietyDisorder = No

                        w1ANXIETY_ORD
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        963
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}        963

{txt}50%    {res}        1                      {txt}Mean          {res} 2.433022
                        {txt}Largest       Std. dev.     {res} 2.987227
{txt}75%    {res}        4             10
{txt}90%    {res}        8             10       {txt}Variance      {res} 8.923524
{txt}95%    {res}        9             10       {txt}Skewness      {res} 1.086411
{txt}99%    {res}       10             10       {txt}Kurtosis      {res} 2.972972

{txt}{hline}
-> w1AnxietyDisorder = Yes

                        w1ANXIETY_ORD
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        116
{txt}25%    {res}        3              0       {txt}Sum of wgt. {res}        116

{txt}50%    {res}        6                      {txt}Mean          {res} 5.715517
                        {txt}Largest       Std. dev.     {res} 3.340935
{txt}75%    {res}        9             10
{txt}90%    {res}       10             10       {txt}Variance      {res} 11.16184
{txt}95%    {res}       10             10       {txt}Skewness      {res}-.4264306
{txt}99%    {res}       10             10       {txt}Kurtosis      {res} 1.862083

{txt}{hline}
-> w1AnxietyDisorder = .

                        w1ANXIETY_ORD
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        102
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}        102

{txt}50%    {res}        1                      {txt}Mean          {res} 2.686275
                        {txt}Largest       Std. dev.     {res} 3.152809
{txt}75%    {res}        5              9
{txt}90%    {res}        8             10       {txt}Variance      {res} 9.940206
{txt}95%    {res}        9             10       {txt}Skewness      {res} .8985033
{txt}99%    {res}       10             10       {txt}Kurtosis      {res} 2.418964

{txt}
{com}. bysort w1AnxietyDisorder: su w1w4ANXIETYTRAJ if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1AnxietyDisorder = No

                       w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0000389        .000033
{txt} 5%    {res} .0000524       .0000333
{txt}10%    {res} .0000771        .000034       {txt}Obs         {res}      1,136
{txt}25%    {res} .0010895        .000034       {txt}Sum of wgt. {res}      1,136

{txt}50%    {res} .0571559                      {txt}Mean          {res} .4050921
                        {txt}Largest       Std. dev.     {res} .4612891
{txt}75%    {res} .9983136              1
{txt}90%    {res} .9999999              1       {txt}Variance      {res} .2127876
{txt}95%    {res}        1              1       {txt}Skewness      {res} .4013223
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 1.236431

{txt}{hline}
-> w1AnxietyDisorder = Yes

                       w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0001135       .0000737
{txt} 5%    {res}  .000322       .0001135
{txt}10%    {res} .0092976       .0001141       {txt}Obs         {res}        136
{txt}25%    {res} .4175791       .0001396       {txt}Sum of wgt. {res}        136

{txt}50%    {res} .9999957                      {txt}Mean          {res} .7467107
                        {txt}Largest       Std. dev.     {res} .4047026
{txt}75%    {res}        1              1
{txt}90%    {res}        1              1       {txt}Variance      {res} .1637842
{txt}95%    {res}        1              1       {txt}Skewness      {res} -1.09131
{txt}99%    {res}        1              1       {txt}Kurtosis      {res}  2.29343

{txt}{hline}
-> w1AnxietyDisorder = .

                       w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0000393       .0000365
{txt} 5%    {res} .0000553       .0000393
{txt}10%    {res} .0001243       .0000423       {txt}Obs         {res}        111
{txt}25%    {res} .0058442       .0000484       {txt}Sum of wgt. {res}        111

{txt}50%    {res} .0529824                      {txt}Mean          {res}  .415369
                        {txt}Largest       Std. dev.     {res} .4659635
{txt}75%    {res} .9984336              1
{txt}90%    {res} .9999999              1       {txt}Variance      {res}  .217122
{txt}95%    {res}        1              1       {txt}Skewness      {res} .3376981
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 1.177508

{txt}
{com}. bysort w1AnxietyDisorder: su Lnodds_highANXIETY if sample4obs==1 & HNDwave==1 & _mi_m==0, det

{txt}{hline}
-> w1AnxietyDisorder = No

                     Lnodds_highANXIETY
{hline 61}
      Percentiles      Smallest
 1%    {res}-10.18262      -10.32014
{txt} 5%    {res}-9.891422      -10.31066
{txt}10%    {res} -9.53848      -10.29044       {txt}Obs         {res}      1,034
{txt}25%    {res}-7.502555      -10.28898       {txt}Sum of wgt. {res}      1,034

{txt}50%    {res}-4.400213                      {txt}Mean          {res}-1.543503
                        {txt}Largest       Std. dev.     {res} 7.323061
{txt}75%    {res} 3.132231       16.63553
{txt}90%    {res} 10.27247       16.63553       {txt}Variance      {res} 53.62722
{txt}95%    {res} 13.10917       16.63553       {txt}Skewness      {res} .8126672
{txt}99%    {res} 16.63553       16.63553       {txt}Kurtosis      {res} 2.645099

{txt}{hline}
-> w1AnxietyDisorder = Yes

                     Lnodds_highANXIETY
{hline 61}
      Percentiles      Smallest
 1%    {res}-9.515824      -9.515824
{txt} 5%    {res}-8.876248      -9.083841
{txt}10%    {res}-5.028718      -9.078617       {txt}Obs         {res}         88
{txt}25%    {res}-2.457667      -8.876341       {txt}Sum of wgt. {res}         88

{txt}50%    {res} 2.698743                      {txt}Mean          {res} 4.090484
                        {txt}Largest       Std. dev.     {res}  8.09192
{txt}75%    {res} 12.07118       16.63553
{txt}90%    {res} 15.53692       16.63553       {txt}Variance      {res} 65.47916
{txt}95%    {res} 16.63553       16.63553       {txt}Skewness      {res} .1018841
{txt}99%    {res} 16.63553       16.63553       {txt}Kurtosis      {res}  1.68797

{txt}{hline}
-> w1AnxietyDisorder = .

                     Lnodds_highANXIETY
{hline 61}
      Percentiles      Smallest
 1%    {res}-10.14317      -10.21768
{txt} 5%    {res}-9.801928      -10.14317
{txt}10%    {res} -9.14812      -10.07006       {txt}Obs         {res}        102
{txt}25%    {res} -5.24768      -9.936862       {txt}Sum of wgt. {res}        102

{txt}50%    {res}-3.333839                      {txt}Mean          {res}-1.122589
                        {txt}Largest       Std. dev.     {res} 7.189252
{txt}75%    {res}  3.07915       15.94238
{txt}90%    {res} 10.23027       15.94238       {txt}Variance      {res} 51.68534
{txt}95%    {res}  12.7037       16.63553       {txt}Skewness      {res} .8130536
{txt}99%    {res} 16.63553       16.63553       {txt}Kurtosis      {res} 2.695621

{txt}
{com}. 
. su w1ANXIETY_ORD if sample4obs==1 & HNDwave==1 & _mi_m==0, det

                        {txt}w1ANXIETY_ORD
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,181
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      1,181

{txt}50%    {res}        1                      {txt}Mean          {res} 2.777307
                        {txt}Largest       Std. dev.     {res} 3.187427
{txt}75%    {res}        5             10
{txt}90%    {res}        8             10       {txt}Variance      {res} 10.15969
{txt}95%    {res}        9             10       {txt}Skewness      {res} .8883441
{txt}99%    {res}       10             10       {txt}Kurtosis      {res} 2.451871
{txt}
{com}. su w1w4ANXIETYTRAJ if sample4obs==1 & HNDwave==1 & _mi_m==0, det

                       {txt}w1w4ANXIETYTRAJ
{hline 61}
      Percentiles      Smallest
 1%    {res} .0000393        .000033
{txt} 5%    {res} .0000564       .0000333
{txt}10%    {res} .0000873        .000034       {txt}Obs         {res}      1,383
{txt}25%    {res} .0021244        .000034       {txt}Sum of wgt. {res}      1,383

{txt}50%    {res} .1097111                      {txt}Mean          {res} .4395107
                        {txt}Largest       Std. dev.     {res} .4672744
{txt}75%    {res} .9997519              1
{txt}90%    {res}        1              1       {txt}Variance      {res} .2183453
{txt}95%    {res}        1              1       {txt}Skewness      {res} .2575893
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 1.136785
{txt}
{com}. tab w1AnxietyDisorder if sample4obs==1 & HNDwave==1 & _mi_m==0

{txt}w1AnxietyDi {c |}
     sorder {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      1,201       89.23       89.23
{txt}        Yes {c |}{res}        145       10.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,346      100.00
{txt}
{com}. tab w1ANXIETYbr if sample4obs==1 & HNDwave==1 & _mi_m==0

{txt}2 quantiles {c |}
         of {c |}
w1ANXIETY_O {c |}
        RD  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        610       51.65       51.65
{txt}          2 {c |}{res}        571       48.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,181      100.00
{txt}
{com}. su Lnodds_highANXIETY if sample4obs==1 & HNDwave==1 & _mi_m==0

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
Lnodds_hig~Y {c |}{res}      1,224   -1.103369    7.505139  -10.32014   16.63553
{txt}
{com}. 
. 
. 
. save "finaldata_imputed_FINAL.dta", replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *****MAIN  TABLE ****
. mi estimate: mean w1HCys if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}w1HCys {c |}{col 14}{res}{space 2} 9.176575{col 26}{space 2}  .136606{col 37}{space 5}  8.90861{col 51}{space 3} 9.444541
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnw1HCys if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}Lnw1HCys {c |}{col 14}{res}{space 2} 2.149369{col 26}{space 2} .0085799{col 37}{space 5} 2.132539{col 51}{space 3}   2.1662
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4HCysTRAJ if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,457
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1456
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,454.00
{txt}{col 35}        avg{col 51}= {res}  1,454.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,454.00

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4HCysTRAJ {c |}{col 16}{res}{space 2} .1190203{col 28}{space 2} .0073088{col 39}{space 5} .1046833{col 53}{space 3} .1333573
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3HCys_change if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,382
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1381
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,379.00
{txt}{col 35}        avg{col 51}= {res}  1,379.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,379.00

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3HCys_change {c |}{col 17}{res}{space 2} .2514102{col 29}{space 2} .0447681{col 40}{space 5} .1635893{col 54}{space 3} .3392311
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. mi estimate: prop Sex  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}Sex {c |}
{space 6}Women  {c |}{col 14}{res}{space 2} .5760274{col 26}{space 2} .0129334{col 37}{space 5} .5506572{col 51}{space 3} .6013975
{txt}{space 8}Men  {c |}{col 14}{res}{space 2} .4239726{col 26}{space 2} .0129334{col 37}{space 5} .3986025{col 51}{space 3} .4493428
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1Age  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1Age {c |}{col 14}{res}{space 2} 47.92253{col 26}{space 2} .2398758{col 37}{space 5}   47.452{col 51}{space 3} 48.39307
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop Race  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}Race {c |}
{space 6}White  {c |}{col 14}{res}{space 2} .4315068{col 26}{space 2} .0129622{col 37}{space 5} .4060802{col 51}{space 3} .4569335
{txt}{space 6}AfrAm  {c |}{col 14}{res}{space 2} .5684932{col 26}{space 2} .0129622{col 37}{space 5} .5430665{col 51}{space 3} .5939198
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop PovStat  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PovStat {c |}
{space 6}Above  {c |}{col 14}{res}{space 2} .6308219{col 26}{space 2} .0126298{col 37}{space 5} .6060475{col 51}{space 3} .6555964
{txt}{space 6}Below  {c |}{col 14}{res}{space 2} .3691781{col 26}{space 2} .0126298{col 37}{space 5} .3444036{col 51}{space 3} .3939525
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1edubr  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0094
{txt}{col 35}Largest FMI{col 51}= {res}    0.0182
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,281.75
{txt}{col 35}        avg{col 51}= {res}  1,355.53
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,409.85

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1edubr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0620548{col 26}{space 2} .0063716{col 37}{space 5} .0495549{col 51}{space 3} .0745547
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .5664384{col 26}{space 2} .0130237{col 37}{space 5} .5408905{col 51}{space 3} .5919862
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3715068{col 26}{space 2} .0127193{col 37}{space 5} .3465555{col 51}{space 3} .3964582
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1currdrugs if sample4part==1 & HNDwave==1 
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.1803
{txt}{col 35}Largest FMI{col 51}= {res}    0.1626
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    150.53
{txt}{col 35}        avg{col 51}= {res}    150.53
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    150.53

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1currdrugs {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8176712{col 26}{space 2} .0109779{col 37}{space 5} .7959806{col 51}{space 3} .8393618
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1823288{col 26}{space 2} .0109779{col 37}{space 5} .1606382{col 51}{space 3} .2040194
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1smoke if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0224
{txt}{col 35}Largest FMI{col 51}= {res}    0.0222
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,216.82
{txt}{col 35}        avg{col 51}= {res}  1,216.82
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,216.82

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1smoke {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .5652055{col 26}{space 2} .0131183{col 37}{space 5} .5394684{col 51}{space 3} .5909426
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .4347945{col 26}{space 2} .0131183{col 37}{space 5} .4090574{col 51}{space 3} .4605316
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1BMI if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0003
{txt}{col 35}Largest FMI{col 51}= {res}    0.0003
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,456.52
{txt}{col 35}        avg{col 51}= {res}  1,456.52
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,456.52

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1BMI {c |}{col 14}{res}{space 2} 29.89112{col 26}{space 2} .1949441{col 37}{space 5} 29.50872{col 51}{space 3} 30.27352
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1SRH if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0011
{txt}{col 35}Largest FMI{col 51}= {res}    0.0015
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,453.68
{txt}{col 35}        avg{col 51}= {res}  1,454.79
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,455.76

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1SRH {c |}
{space 10}1  {c |}{col 14}{res}{space 2}  .209863{col 26}{space 2} .0106651{col 37}{space 5} .1889424{col 51}{space 3} .2307837
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .3913699{col 26}{space 2} .0127796{col 37}{space 5} .3663014{col 51}{space 3} .4164383
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3987671{col 26}{space 2}  .012819{col 37}{space 5} .3736215{col 51}{space 3} .4239128
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1hei2010_total_score if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.1641
{txt}{col 35}Largest FMI{col 51}= {res}    0.1496
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    173.37
{txt}{col 35}        avg{col 51}= {res}    173.37
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    173.37

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1hei2010_total_score {c |}{col 23}{res}{space 2} 43.11454{col 35}{space 2} .3302665{col 46}{space 5} 42.46268{col 60}{space 3}  43.7664
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxHTN if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0435
{txt}{col 35}Largest FMI{col 51}= {res}    0.0426
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    869.47
{txt}{col 35}        avg{col 51}= {res}    869.47
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    869.47

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1dxHTN {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .5994521{col 26}{space 2} .0130998{col 37}{space 5} .5737411{col 51}{space 3}  .625163
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .4005479{col 26}{space 2} .0130998{col 37}{space 5}  .374837{col 51}{space 3} .4262589
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxDiabetes if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0335
{txt}{col 35}Largest FMI{col 51}= {res}    0.0579
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    657.66
{txt}{col 35}        avg{col 51}= {res}  1,089.37
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,349.11

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1dxDiabetes {c |}
{space 7}NoDx  {c |}{col 14}{res}{space 2} .6806849{col 26}{space 2} .0123206{col 37}{space 5} .6565137{col 51}{space 3} .7048561
{txt}preDiabetes  {c |}{col 14}{res}{space 2}  .179589{col 26}{space 2}  .010341{col 37}{space 5} .1592837{col 51}{space 3} .1998944
{txt}{space 3}Diabetes  {c |}{col 14}{res}{space 2}  .139726{col 26}{space 2} .0091354{col 37}{space 5} .1218048{col 51}{space 3} .1576472
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1CVhighChol  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0340
{txt}{col 35}Largest FMI{col 51}= {res}    0.0334
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,021.16
{txt}{col 35}        avg{col 51}= {res}  1,021.16
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,021.16

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1CVhighChol {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .7616438{col 26}{space 2} .0113386{col 37}{space 5} .7393942{col 51}{space 3} .7838935
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .2383562{col 26}{space 2} .0113386{col 37}{space 5} .2161065{col 51}{space 3} .2606058
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1cvdbr  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.3058
{txt}{col 35}Largest FMI{col 51}= {res}    0.2546
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}     68.44
{txt}{col 35}        avg{col 51}= {res}     68.44
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}     68.44

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1cvdbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8554795{col 26}{space 2}  .010515{col 37}{space 5} .8344996{col 51}{space 3} .8764593
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1445205{col 26}{space 2}  .010515{col 37}{space 5} .1235407{col 51}{space 3} .1655004
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean CES if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,445
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1444
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,442.00
{txt}{col 35}        avg{col 51}= {res}  1,442.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,442.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}CES {c |}{col 14}{res}{space 2}   14.009{col 26}{space 2} .2938918{col 37}{space 5}  13.4325{col 51}{space 3}  14.5855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_DA if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,449
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1448
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,446.00
{txt}{col 35}        avg{col 51}= {res}  1,446.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,446.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_DA {c |}{col 14}{res}{space 2} 4.340925{col 26}{space 2} .1273831{col 37}{space 5} 4.091049{col 51}{space 3}   4.5908
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_IP if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,449
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1448
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,446.00
{txt}{col 35}        avg{col 51}= {res}  1,446.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,446.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_IP {c |}{col 14}{res}{space 2}  .905452{col 26}{space 2} .0335526{col 37}{space 5} .8396351{col 51}{space 3}  .971269
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_SC if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,449
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1448
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,446.00
{txt}{col 35}        avg{col 51}= {res}  1,446.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,446.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_SC {c |}{col 14}{res}{space 2}  6.42029{col 26}{space 2} .1162756{col 37}{space 5} 6.192203{col 51}{space 3} 6.648377
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_WB if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,449
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1448
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,446.00
{txt}{col 35}        avg{col 51}= {res}  1,446.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,446.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_WB {c |}{col 14}{res}{space 2} 9.663216{col 26}{space 2} .0688214{col 37}{space 5} 9.528216{col 51}{space 3} 9.798216
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop CESDcut16 if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,445
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1444
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,442.00
{txt}{col 35}        avg{col 51}= {res}  1,442.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,442.00

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}CESDcut16 {c |}
{space 10}0  {c |}{col 14}{res}{space 2}   .63391{col 26}{space 2} .0126728{col 37}{space 5} .6090509{col 51}{space 3} .6587692
{txt}{space 10}1  {c |}{col 14}{res}{space 2}   .36609{col 26}{space 2} .0126728{col 37}{space 5} .3412308{col 51}{space 3} .3909491
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. mi estimate: mean w1ANXIETY_ORD if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,181
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1180
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,178.01
{txt}{col 35}        avg{col 51}= {res}  1,178.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,178.01

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1ANXIETY_ORD {c |}{col 15}{res}{space 2} 2.777307{col 27}{space 2} .0927503{col 38}{space 5} 2.595333{col 52}{space 3} 2.959282
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean zR_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,383
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1382
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,380.00
{txt}{col 35}        avg{col 51}= {res}  1,380.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,380.00

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zR_traj_ProbG2ANXIETY {c |}{col 23}{res}{space 2}-.0539678{col 35}{space 2} .0268661{col 46}{space 5}-.1066706{col 60}{space 3} -.001265
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean R_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,383
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1382
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,380.00
{txt}{col 35}        avg{col 51}= {res}  1,380.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,380.00

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
R_traj_ProbG2ANXIETY {c |}{col 22}{res}{space 2} .4395107{col 34}{space 2}  .012565{col 45}{space 5} .4148622{col 59}{space 3} .4641592
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnodds_highANXIETY if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,224
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1223
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,221.00
{txt}{col 35}        avg{col 51}= {res}  1,221.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,221.00

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
Lnodds_highANXIETY {c |}{col 20}{res}{space 2}-1.103369{col 32}{space 2} .2145201{col 43}{space 5}-1.524238{col 57}{space 3}-.6824999
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1ANXIETYbr if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,181
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1180
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,178.01
{txt}{col 35}        avg{col 51}= {res}  1,178.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,178.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1ANXIETYbr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .5165114{col 26}{space 2} .0145415{col 37}{space 5} .4879814{col 51}{space 3} .5450415
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .4834886{col 26}{space 2} .0145415{col 37}{space 5} .4549585{col 51}{space 3} .5120186
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1AnxietyDisorder if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}     1,346
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1345
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,343.00
{txt}{col 35}        avg{col 51}= {res}  1,343.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,343.00

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}{col 42}             N{col 56}ormal
{col 19}{c |} Proportion{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1AnxietyDisorder {c |}
{space 14}No  {c |}{col 19}{res}{space 2} .8922734{col 31}{space 2} .0084506{col 42}{space 5} .8756956{col 56}{space 3} .9088512
{txt}{space 13}Yes  {c |}{col 19}{res}{space 2} .1077266{col 31}{space 2} .0084506{col 42}{space 5} .0911488{col 56}{space 3} .1243044
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: mean w1w3w4bayes1CES if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES {c |}{col 17}{res}{space 2}-.1185621{col 29}{space 2} .0029091{col 40}{space 5}-.1242686{col 54}{space 3}-.1128555
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_DA if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_DA {c |}{col 20}{res}{space 2}-.0706991{col 32}{space 2} .0015342{col 43}{space 5}-.0737085{col 57}{space 3}-.0676896
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_IP if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_IP {c |}{col 20}{res}{space 2}-.0133796{col 32}{space 2} .0002868{col 43}{space 5}-.0139421{col 57}{space 3}-.0128171
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_SC if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_SC {c |}{col 20}{res}{space 2}-.0784661{col 32}{space 2} .0011037{col 43}{space 5}-.0806311{col 57}{space 3}-.0763011
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_WB if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}     1,460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}      1459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}  1,457.00
{txt}{col 35}        avg{col 51}= {res}  1,457.00
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}  1,457.00

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_WB {c |}{col 20}{res}{space 2}-.0492176{col 32}{space 2} .0014351{col 43}{space 5}-.0520327{col 57}{space 3}-.0464024
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. ****************First HCys load tertile*********************
. 
. mi estimate: mean w1HCys if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}w1HCys {c |}{col 14}{res}{space 2} 6.287897{col 26}{space 2} .0362662{col 37}{space 5} 6.216638{col 51}{space 3} 6.359156
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnw1HCys if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}Lnw1HCys {c |}{col 14}{res}{space 2} 1.829577{col 26}{space 2} .0063183{col 37}{space 5} 1.817162{col 51}{space 3} 1.841992
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4HCysTRAJ if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       484
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       483
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    481.01
{txt}{col 35}        avg{col 51}= {res}    481.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    481.01

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4HCysTRAJ {c |}{col 16}{res}{space 2} .0218664{col 28}{space 2} .0046694{col 39}{space 5} .0126914{col 53}{space 3} .0310415
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3HCys_change if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       462
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       461
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    459.01
{txt}{col 35}        avg{col 51}= {res}    459.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    459.01

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3HCys_change {c |}{col 17}{res}{space 2}  .300956{col 29}{space 2} .0164634{col 40}{space 5} .2686031{col 54}{space 3} .3333089
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: prop Sex  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}Sex {c |}
{space 6}Women  {c |}{col 14}{res}{space 2} .7587629{col 26}{space 2} .0194269{col 37}{space 5}  .720591{col 51}{space 3} .7969348
{txt}{space 8}Men  {c |}{col 14}{res}{space 2} .2412371{col 26}{space 2} .0194269{col 37}{space 5} .2030652{col 51}{space 3}  .279409
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1Age  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1Age {c |}{col 14}{res}{space 2} 45.73278{col 26}{space 2} .4152209{col 37}{space 5} 44.91692{col 51}{space 3} 46.54865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop Race  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}Race {c |}
{space 6}White  {c |}{col 14}{res}{space 2}  .443299{col 26}{space 2} .0225574{col 37}{space 5}  .398976{col 51}{space 3} .4876219
{txt}{space 6}AfrAm  {c |}{col 14}{res}{space 2}  .556701{col 26}{space 2} .0225574{col 37}{space 5} .5123781{col 51}{space 3}  .601024
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop PovStat  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PovStat {c |}
{space 6}Above  {c |}{col 14}{res}{space 2} .6268041{col 26}{space 2} .0219616{col 37}{space 5} .5836519{col 51}{space 3} .6699564
{txt}{space 6}Below  {c |}{col 14}{res}{space 2} .3731959{col 26}{space 2} .0219616{col 37}{space 5} .3300436{col 51}{space 3} .4163481
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1edubr  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0203
{txt}{col 35}Largest FMI{col 51}= {res}    0.0341
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    412.37
{txt}{col 35}        avg{col 51}= {res}    454.15
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    475.49

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1edubr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0610309{col 26}{space 2} .0110559{col 37}{space 5}  .039298{col 51}{space 3} .0827639
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .5558763{col 26}{space 2} .0226518{col 37}{space 5} .5113662{col 51}{space 3} .6003864
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3830928{col 26}{space 2} .0221551{col 37}{space 5} .3395587{col 51}{space 3} .4266269
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1currdrugs if sample4part==1 & HNDwave==1 & w1HCystert==1 
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.1407
{txt}{col 35}Largest FMI{col 51}= {res}    0.1304
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    162.13
{txt}{col 35}        avg{col 51}= {res}    162.13
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    162.13

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1currdrugs {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8486598{col 26}{space 2} .0173783{col 37}{space 5} .8143427{col 51}{space 3} .8829769
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1513402{col 26}{space 2} .0173783{col 37}{space 5} .1170231{col 51}{space 3} .1856573
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1smoke if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0382
{txt}{col 35}Largest FMI{col 51}= {res}    0.0376
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    401.15
{txt}{col 35}        avg{col 51}= {res}    401.15
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    401.15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1smoke {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .6024742{col 26}{space 2}  .022642{col 37}{space 5} .5579623{col 51}{space 3} .6469861
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .3975258{col 26}{space 2}  .022642{col 37}{space 5} .3530139{col 51}{space 3} .4420377
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1BMI if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0012
{txt}{col 35}Largest FMI{col 51}= {res}    0.0013
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    481.32
{txt}{col 35}        avg{col 51}= {res}    481.32
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    481.32

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1BMI {c |}{col 14}{res}{space 2} 30.07867{col 26}{space 2} .3367982{col 37}{space 5} 29.41689{col 51}{space 3} 30.74045
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1SRH if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1SRH {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1917526{col 26}{space 2} .0178761{col 37}{space 5} .1566279{col 51}{space 3} .2268772
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .3917526{col 26}{space 2} .0221654{col 37}{space 5} .3481999{col 51}{space 3} .4353053
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .4164948{col 26}{space 2}  .022385{col 37}{space 5} .3725107{col 51}{space 3}  .460479
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1hei2010_total_score if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.2710
{txt}{col 35}Largest FMI{col 51}= {res}    0.2312
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}     71.43
{txt}{col 35}        avg{col 51}= {res}     71.43
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}     71.43

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1hei2010_total_score {c |}{col 23}{res}{space 2} 44.34375{col 35}{space 2} .6291571{col 46}{space 5} 43.08938{col 60}{space 3} 45.59812
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxHTN if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0584
{txt}{col 35}Largest FMI{col 51}= {res}    0.0568
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    338.33
{txt}{col 35}        avg{col 51}= {res}    338.33
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    338.33

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1dxHTN {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .6717526{col 26}{space 2} .0219347{col 37}{space 5} .6286069{col 51}{space 3} .7148982
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .3282474{col 26}{space 2} .0219347{col 37}{space 5} .2851018{col 51}{space 3} .3713931
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxDiabetes if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0352
{txt}{col 35}Largest FMI{col 51}= {res}    0.0663
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    308.21
{txt}{col 35}        avg{col 51}= {res}    392.05
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1dxDiabetes {c |}
{space 7}NoDx  {c |}{col 14}{res}{space 2} .7216495{col 26}{space 2} .0207846{col 37}{space 5} .6807843{col 51}{space 3} .7625147
{txt}preDiabetes  {c |}{col 14}{res}{space 2} .1484536{col 26}{space 2} .0166877{col 37}{space 5} .1156173{col 51}{space 3} .1812899
{txt}{space 3}Diabetes  {c |}{col 14}{res}{space 2} .1298969{col 26}{space 2} .0152656{col 37}{space 5} .0999016{col 51}{space 3} .1598923
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1CVhighChol  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0493
{txt}{col 35}Largest FMI{col 51}= {res}    0.0482
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    366.44
{txt}{col 35}        avg{col 51}= {res}    366.44
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    366.44

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1CVhighChol {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .7905155{col 26}{space 2} .0189277{col 37}{space 5}  .753295{col 51}{space 3} .8277359
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .2094845{col 26}{space 2} .0189277{col 37}{space 5} .1722641{col 51}{space 3}  .246705
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1cvdbr  if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0621
{txt}{col 35}Largest FMI{col 51}= {res}    0.0603
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    327.12
{txt}{col 35}        avg{col 51}= {res}    327.12
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    327.12

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1cvdbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8441237{col 26}{space 2} .0169738{col 37}{space 5} .8107322{col 51}{space 3} .8775152
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1558763{col 26}{space 2} .0169738{col 37}{space 5} .1224848{col 51}{space 3} .1892678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean CES if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       480
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       479
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    477.01
{txt}{col 35}        avg{col 51}= {res}    477.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    477.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}CES {c |}{col 14}{res}{space 2} 14.33542{col 26}{space 2} .5080125{col 37}{space 5}  13.3372{col 51}{space 3} 15.33364
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_DA if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       481
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       480
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    478.01
{txt}{col 35}        avg{col 51}= {res}    478.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    478.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_DA {c |}{col 14}{res}{space 2} 4.509356{col 26}{space 2} .2183758{col 37}{space 5}  4.08026{col 51}{space 3} 4.938451
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_IP if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       481
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       480
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    478.01
{txt}{col 35}        avg{col 51}= {res}    478.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    478.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_IP {c |}{col 14}{res}{space 2} .9459459{col 26}{space 2} .0596171{col 37}{space 5} .8288019{col 51}{space 3}  1.06309
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_SC if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       481
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       480
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    478.01
{txt}{col 35}        avg{col 51}= {res}    478.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    478.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_SC {c |}{col 14}{res}{space 2}  6.56341{col 26}{space 2} .2019302{col 37}{space 5} 6.166629{col 51}{space 3}  6.96019
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_WB if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       481
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       480
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    478.01
{txt}{col 35}        avg{col 51}= {res}    478.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    478.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_WB {c |}{col 14}{res}{space 2}  9.68815{col 26}{space 2} .1195398{col 37}{space 5} 9.453261{col 51}{space 3} 9.923038
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop CESDcut16 if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       480
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       479
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    477.01
{txt}{col 35}        avg{col 51}= {res}    477.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    477.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}CESDcut16 {c |}
{space 10}0  {c |}{col 14}{res}{space 2}   .63125{col 26}{space 2} .0220215{col 37}{space 5} .5879789{col 51}{space 3} .6745211
{txt}{space 10}1  {c |}{col 14}{res}{space 2}   .36875{col 26}{space 2} .0220215{col 37}{space 5} .3254789{col 51}{space 3} .4120211
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean w1ANXIETY_ORD if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       390
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       389
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    387.02
{txt}{col 35}        avg{col 51}= {res}    387.02
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    387.02

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1ANXIETY_ORD {c |}{col 15}{res}{space 2} 2.776923{col 27}{space 2}  .154035{col 38}{space 5} 2.474073{col 52}{space 3} 3.079773
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean zR_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       461
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       460
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    458.01
{txt}{col 35}        avg{col 51}= {res}    458.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    458.01

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zR_traj_ProbG2ANXIETY {c |}{col 23}{res}{space 2}-.0343067{col 35}{space 2} .0461962{col 46}{space 5}-.1250894{col 60}{space 3} .0564761
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean R_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       461
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       460
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    458.01
{txt}{col 35}        avg{col 51}= {res}    458.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    458.01

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
R_traj_ProbG2ANXIETY {c |}{col 22}{res}{space 2}  .448706{col 34}{space 2} .0216054{col 45}{space 5} .4062479{col 59}{space 3}  .491164
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnodds_highANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       417
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       416
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    414.01
{txt}{col 35}        avg{col 51}= {res}    414.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    414.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
Lnodds_highANXIETY {c |}{col 20}{res}{space 2}-.6202195{col 32}{space 2} .3628127{col 43}{space 5}-1.333404{col 57}{space 3} .0929653
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1ANXIETYbr if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       390
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       389
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    387.02
{txt}{col 35}        avg{col 51}= {res}    387.02
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    387.02

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1ANXIETYbr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .4871795{col 26}{space 2} .0253102{col 37}{space 5} .4374169{col 51}{space 3} .5369421
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .5128205{col 26}{space 2} .0253102{col 37}{space 5} .4630579{col 51}{space 3} .5625831
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1AnxietyDisorder if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       453
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       452
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    450.01
{txt}{col 35}        avg{col 51}= {res}    450.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    450.01

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}{col 42}             N{col 56}ormal
{col 19}{c |} Proportion{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1AnxietyDisorder {c |}
{space 14}No  {c |}{col 19}{res}{space 2} .8852097{col 31}{space 2} .0149771{col 42}{space 5} .8557761{col 56}{space 3} .9146434
{txt}{space 13}Yes  {c |}{col 19}{res}{space 2} .1147903{col 31}{space 2} .0149771{col 42}{space 5} .0853566{col 56}{space 3} .1442239
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: mean w1w3w4bayes1CES if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES {c |}{col 17}{res}{space 2}-.1219468{col 29}{space 2} .0050504{col 40}{space 5}-.1318703{col 54}{space 3}-.1120233
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_DA if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_DA {c |}{col 20}{res}{space 2}-.0732013{col 32}{space 2} .0026575{col 43}{space 5}-.0784229{col 57}{space 3}-.0679797
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_IP if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_IP {c |}{col 20}{res}{space 2}-.0135501{col 32}{space 2}  .000503{col 43}{space 5}-.0145383{col 57}{space 3}-.0125618
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_SC if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_SC {c |}{col 20}{res}{space 2}-.0801081{col 32}{space 2} .0019239{col 43}{space 5}-.0838884{col 57}{space 3}-.0763279
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_WB if sample4part==1 & HNDwave==1 & w1HCystert==1
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_WB {c |}{col 20}{res}{space 2}-.0468605{col 32}{space 2} .0024477{col 43}{space 5}-.0516699{col 57}{space 3} -.042051
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. ****************Second HCys load tertile: HCys load=2*********************
. mi estimate: mean w1HCys if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}w1HCys {c |}{col 14}{res}{space 2} 8.423252{col 26}{space 2} .0277076{col 37}{space 5}  8.36881{col 51}{space 3} 8.477693
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnw1HCys if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}Lnw1HCys {c |}{col 14}{res}{space 2} 2.128355{col 26}{space 2} .0032906{col 37}{space 5} 2.121889{col 51}{space 3} 2.134821
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4HCysTRAJ if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       488
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       487
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    485.01
{txt}{col 35}        avg{col 51}= {res}    485.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    485.01

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4HCysTRAJ {c |}{col 16}{res}{space 2} .0488634{col 28}{space 2} .0073225{col 39}{space 5} .0344756{col 53}{space 3} .0632512
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3HCys_change if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       461
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       460
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    458.01
{txt}{col 35}        avg{col 51}= {res}    458.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    458.01

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3HCys_change {c |}{col 17}{res}{space 2} .2065132{col 29}{space 2} .0334078{col 40}{space 5} .1408616{col 54}{space 3} .2721647
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: prop Sex  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}Sex {c |}
{space 6}Women  {c |}{col 14}{res}{space 2} .5746421{col 26}{space 2} .0223574{col 37}{space 5}  .530713{col 51}{space 3} .6185712
{txt}{space 8}Men  {c |}{col 14}{res}{space 2} .4253579{col 26}{space 2} .0223574{col 37}{space 5} .3814288{col 51}{space 3}  .469287
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1Age  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1Age {c |}{col 14}{res}{space 2} 48.30143{col 26}{space 2} .4249627{col 37}{space 5} 47.46644{col 51}{space 3} 49.13642
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop Race  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}Race {c |}
{space 6}White  {c |}{col 14}{res}{space 2} .4355828{col 26}{space 2} .0224223{col 37}{space 5} .3915261{col 51}{space 3} .4796395
{txt}{space 6}AfrAm  {c |}{col 14}{res}{space 2} .5644172{col 26}{space 2} .0224223{col 37}{space 5} .5203605{col 51}{space 3} .6084739
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop PovStat  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PovStat {c |}
{space 6}Above  {c |}{col 14}{res}{space 2} .6359918{col 26}{space 2} .0217584{col 37}{space 5} .5932397{col 51}{space 3}  .678744
{txt}{space 6}Below  {c |}{col 14}{res}{space 2} .3640082{col 26}{space 2} .0217584{col 37}{space 5}  .321256{col 51}{space 3} .4067603
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1edubr  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0085
{txt}{col 35}Largest FMI{col 51}= {res}    0.0130
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    470.43
{txt}{col 35}        avg{col 51}= {res}    477.93
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    484.76

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1edubr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0601227{col 26}{space 2} .0108195{col 37}{space 5} .0388622{col 51}{space 3} .0813832
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .5550102{col 26}{space 2} .0225625{col 37}{space 5} .5106763{col 51}{space 3} .5993441
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3848671{col 26}{space 2} .0220259{col 37}{space 5}  .341589{col 51}{space 3} .4281452
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1currdrugs if sample4part==1 & HNDwave==1 & w1HCystert==2 
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0814
{txt}{col 35}Largest FMI{col 51}= {res}    0.0782
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    274.61
{txt}{col 35}        avg{col 51}= {res}    274.61
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    274.61

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1currdrugs {c |}
{space 10}0  {c |}{col 14}{res}{space 2}  .805317{col 26}{space 2} .0186193{col 37}{space 5} .7686624{col 51}{space 3} .8419716
{txt}{space 10}1  {c |}{col 14}{res}{space 2}  .194683{col 26}{space 2} .0186193{col 37}{space 5} .1580284{col 51}{space 3} .2313376
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1smoke if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0819
{txt}{col 35}Largest FMI{col 51}= {res}    0.0786
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    273.38
{txt}{col 35}        avg{col 51}= {res}    273.38
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    273.38

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1smoke {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .5648262{col 26}{space 2} .0233184{col 37}{space 5} .5189197{col 51}{space 3} .6107326
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .4351738{col 26}{space 2} .0233184{col 37}{space 5} .3892674{col 51}{space 3} .4810803
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1BMI if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1BMI {c |}{col 14}{res}{space 2} 29.98691{col 26}{space 2} .3440114{col 37}{space 5} 29.31098{col 51}{space 3} 30.66284
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1SRH if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1SRH {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1881391{col 26}{space 2} .0176736{col 37}{space 5} .1534129{col 51}{space 3} .2228652
{txt}{space 10}2  {c |}{col 14}{res}{space 2}  .394683{col 26}{space 2} .0221035{col 37}{space 5} .3512528{col 51}{space 3} .4381133
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .4171779{col 26}{space 2} .0222984{col 37}{space 5} .3733647{col 51}{space 3} .4609911
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1hei2010_total_score if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.1878
{txt}{col 35}Largest FMI{col 51}= {res}    0.1690
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    115.01
{txt}{col 35}        avg{col 51}= {res}    115.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    115.01

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1hei2010_total_score {c |}{col 23}{res}{space 2} 43.34161{col 35}{space 2}  .587292{col 46}{space 5}  42.1783{col 60}{space 3} 44.50492
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxHTN if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0202
{txt}{col 35}Largest FMI{col 51}= {res}    0.0201
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    455.17
{txt}{col 35}        avg{col 51}= {res}    455.17
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    455.17

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1dxHTN {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .5828221{col 26}{space 2} .0225221{col 37}{space 5}  .538562{col 51}{space 3} .6270822
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .4171779{col 26}{space 2} .0225221{col 37}{space 5} .3729178{col 51}{space 3}  .461438
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxDiabetes if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0057
{txt}{col 35}Largest FMI{col 51}= {res}    0.0064
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    480.55
{txt}{col 35}        avg{col 51}= {res}    481.37
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.18

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1dxDiabetes {c |}
{space 7}NoDx  {c |}{col 14}{res}{space 2} .6871166{col 26}{space 2} .0210274{col 37}{space 5} .6457997{col 51}{space 3} .7284334
{txt}preDiabetes  {c |}{col 14}{res}{space 2} .1807771{col 26}{space 2} .0174459{col 37}{space 5} .1464977{col 51}{space 3} .2150565
{txt}{space 3}Diabetes  {c |}{col 14}{res}{space 2} .1321063{col 26}{space 2} .0153613{col 37}{space 5} .1019227{col 51}{space 3}   .16229
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1CVhighChol  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.1418
{txt}{col 35}Largest FMI{col 51}= {res}    0.1313
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    161.22
{txt}{col 35}        avg{col 51}= {res}    161.22
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    161.22

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1CVhighChol {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .7676892{col 26}{space 2} .0204041{col 37}{space 5} .7273954{col 51}{space 3} .8079829
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .2323108{col 26}{space 2} .0204041{col 37}{space 5} .1920171{col 51}{space 3} .2726046
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1cvdbr  if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.3829
{txt}{col 35}Largest FMI{col 51}= {res}    0.3039
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}     45.43
{txt}{col 35}        avg{col 51}= {res}     45.43
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}     45.43

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1cvdbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8642127{col 26}{space 2} .0182123{col 37}{space 5} .8275408{col 51}{space 3} .9008845
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1357873{col 26}{space 2} .0182123{col 37}{space 5} .0991155{col 51}{space 3} .1724592
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean CES if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}CES {c |}{col 14}{res}{space 2} 13.20412{col 26}{space 2}  .488536{col 37}{space 5}  12.2442{col 51}{space 3} 14.16405
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_DA if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_DA {c |}{col 14}{res}{space 2} 4.026749{col 26}{space 2} .2130869{col 37}{space 5} 3.608057{col 51}{space 3} 4.445441
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_IP if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_IP {c |}{col 14}{res}{space 2}  .882716{col 26}{space 2}  .055967{col 37}{space 5} .7727473{col 51}{space 3} .9926848
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_SC if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_SC {c |}{col 14}{res}{space 2} 6.088477{col 26}{space 2}  .196391{col 37}{space 5} 5.702591{col 51}{space 3} 6.474364
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_WB if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_WB {c |}{col 14}{res}{space 2} 9.796296{col 26}{space 2} .1166405{col 37}{space 5} 9.567111{col 51}{space 3} 10.02548
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop CESDcut16 if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}CESDcut16 {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .6474227{col 26}{space 2} .0216945{col 37}{space 5} .6047951{col 51}{space 3} .6900502
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .3525773{col 26}{space 2} .0216945{col 37}{space 5} .3099498{col 51}{space 3} .3952049
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean w1ANXIETY_ORD if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       390
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       389
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    387.02
{txt}{col 35}        avg{col 51}= {res}    387.02
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    387.02

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1ANXIETY_ORD {c |}{col 15}{res}{space 2} 2.938462{col 27}{space 2}  .167187{col 38}{space 5} 2.609753{col 52}{space 3}  3.26717
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean zR_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       462
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       461
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    459.01
{txt}{col 35}        avg{col 51}= {res}    459.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    459.01

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zR_traj_ProbG2ANXIETY {c |}{col 23}{res}{space 2}-.0201355{col 35}{space 2} .0467461{col 46}{space 5}-.1119984{col 60}{space 3} .0717274
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean R_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       462
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       461
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    459.01
{txt}{col 35}        avg{col 51}= {res}    459.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    459.01

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
R_traj_ProbG2ANXIETY {c |}{col 22}{res}{space 2} .4553336{col 34}{space 2} .0218626{col 45}{space 5} .4123705{col 59}{space 3} .4982968
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnodds_highANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       405
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       404
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    402.01
{txt}{col 35}        avg{col 51}= {res}    402.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    402.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
Lnodds_highANXIETY {c |}{col 20}{res}{space 2}-.9779944{col 32}{space 2} .3779366{col 43}{space 5}-1.720973{col 57}{space 3}-.2350154
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1ANXIETYbr if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       390
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       389
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    387.02
{txt}{col 35}        avg{col 51}= {res}    387.02
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    387.02

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1ANXIETYbr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .5076923{col 26}{space 2} .0253155{col 37}{space 5} .4579192{col 51}{space 3} .5574654
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .4923077{col 26}{space 2} .0253155{col 37}{space 5} .4425346{col 51}{space 3} .5420808
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1AnxietyDisorder if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       440
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       439
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    437.01
{txt}{col 35}        avg{col 51}= {res}    437.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    437.01

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}{col 42}             N{col 56}ormal
{col 19}{c |} Proportion{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1AnxietyDisorder {c |}
{space 14}No  {c |}{col 19}{res}{space 2} .8840909{col 31}{space 2} .0152609{col 42}{space 5}  .854097{col 56}{space 3} .9140848
{txt}{space 13}Yes  {c |}{col 19}{res}{space 2} .1159091{col 31}{space 2} .0152609{col 42}{space 5} .0859152{col 56}{space 3}  .145903
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean w1w3w4bayes1CES if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES {c |}{col 17}{res}{space 2}-.1061578{col 29}{space 2} .0047882{col 40}{space 5}-.1155659{col 54}{space 3}-.0967498
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_DA if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_DA {c |}{col 20}{res}{space 2}-.0685608{col 32}{space 2} .0026827{col 43}{space 5}-.0738318{col 57}{space 3}-.0632897
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_IP if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_IP {c |}{col 20}{res}{space 2}-.0134082{col 32}{space 2} .0005121{col 43}{space 5}-.0144144{col 57}{space 3}-.0124019
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_SC if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_SC {c |}{col 20}{res}{space 2}-.0746493{col 32}{space 2} .0018557{col 43}{space 5}-.0782955{col 57}{space 3}-.0710031
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_WB if sample4part==1 & HNDwave==1 & w1HCystert==2
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       489
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       488
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    486.01
{txt}{col 35}        avg{col 51}= {res}    486.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    486.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_WB {c |}{col 20}{res}{space 2}-.0561558{col 32}{space 2} .0026505{col 43}{space 5}-.0613637{col 57}{space 3}-.0509479
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. *************Third HCys load tertile********************************************
. mi estimate: mean w1HCys if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}w1HCys {c |}{col 14}{res}{space 2} 12.81728{col 26}{space 2} .3476781{col 37}{space 5} 12.13414{col 51}{space 3} 13.50043
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnw1HCys if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}Lnw1HCys {c |}{col 14}{res}{space 2} 2.489648{col 26}{space 2}  .012824{col 37}{space 5}  2.46445{col 51}{space 3} 2.514846
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4HCysTRAJ if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       485
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       484
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    482.01
{txt}{col 35}        avg{col 51}= {res}    482.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    482.01

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4HCysTRAJ {c |}{col 16}{res}{space 2} .2865647{col 28}{space 2} .0178625{col 39}{space 5} .2514668{col 53}{space 3} .3216627
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3HCys_change if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       459
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       458
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    456.01
{txt}{col 35}        avg{col 51}= {res}    456.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    456.01

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3HCys_change {c |}{col 17}{res}{space 2} .2466333{col 29}{space 2} .1295571{col 40}{space 5}-.0079697{col 54}{space 3} .5012363
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: prop Sex  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}Sex {c |}
{space 6}Women  {c |}{col 14}{res}{space 2} .3950617{col 26}{space 2} .0221753{col 37}{space 5} .3514897{col 51}{space 3} .4386337
{txt}{space 8}Men  {c |}{col 14}{res}{space 2} .6049383{col 26}{space 2} .0221753{col 37}{space 5} .5613663{col 51}{space 3} .6485103
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1Age  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1Age {c |}{col 14}{res}{space 2} 49.72654{col 26}{space 2} .3854793{col 37}{space 5} 48.96912{col 51}{space 3} 50.48397
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop Race  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}Race {c |}
{space 6}White  {c |}{col 14}{res}{space 2} .4156379{col 26}{space 2} .0223553{col 37}{space 5} .3717122{col 51}{space 3} .4595635
{txt}{space 6}AfrAm  {c |}{col 14}{res}{space 2} .5843621{col 26}{space 2} .0223553{col 37}{space 5} .5404365{col 51}{space 3} .6282878
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop PovStat  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PovStat {c |}
{space 6}Above  {c |}{col 14}{res}{space 2} .6296296{col 26}{space 2}  .021905{col 37}{space 5} .5865888{col 51}{space 3} .6726704
{txt}{space 6}Below  {c |}{col 14}{res}{space 2} .3703704{col 26}{space 2}  .021905{col 37}{space 5} .3273296{col 51}{space 3} .4134112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1edubr  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0180
{txt}{col 35}Largest FMI{col 51}= {res}    0.0321
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    419.25
{txt}{col 35}        avg{col 51}= {res}    458.95
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1edubr {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0650206{col 26}{space 2} .0113643{col 37}{space 5} .0426825{col 51}{space 3} .0873587
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .5884774{col 26}{space 2} .0223225{col 37}{space 5} .5446161{col 51}{space 3} .6323386
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3465021{col 26}{space 2} .0216791{col 37}{space 5} .3039033{col 51}{space 3} .3891009
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1currdrugs if sample4part==1 & HNDwave==1 & w1HCystert==3 
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0739
{txt}{col 35}Largest FMI{col 51}= {res}    0.0712
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    293.62
{txt}{col 35}        avg{col 51}= {res}    293.62
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    293.62

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1currdrugs {c |}
{space 10}0  {c |}{col 14}{res}{space 2}  .799177{col 26}{space 2} .0188305{col 37}{space 5} .7621172{col 51}{space 3} .8362367
{txt}{space 10}1  {c |}{col 14}{res}{space 2}  .200823{col 26}{space 2} .0188305{col 37}{space 5} .1637633{col 51}{space 3} .2378828
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1smoke if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.1110
{txt}{col 35}Largest FMI{col 51}= {res}    0.1047
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    208.54
{txt}{col 35}        avg{col 51}= {res}    208.54
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    208.54

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1smoke {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .5283951{col 26}{space 2} .0238656{col 37}{space 5} .4813462{col 51}{space 3} .5754439
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .4716049{col 26}{space 2} .0238656{col 37}{space 5} .4245561{col 51}{space 3} .5186538
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1BMI if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0020
{txt}{col 35}Largest FMI{col 51}= {res}    0.0020
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    481.83
{txt}{col 35}        avg{col 51}= {res}    481.83
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    481.83

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1BMI {c |}{col 14}{res}{space 2} 29.60757{col 26}{space 2} .3326573{col 37}{space 5} 28.95393{col 51}{space 3} 30.26121
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1SRH if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0031
{txt}{col 35}Largest FMI{col 51}= {res}    0.0040
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    480.22
{txt}{col 35}        avg{col 51}= {res}    480.96
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    481.72

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}w1SRH {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .2497942{col 26}{space 2} .0196752{col 37}{space 5} .2111342{col 51}{space 3} .2884543
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .3876543{col 26}{space 2} .0221349{col 37}{space 5} .3441612{col 51}{space 3} .4311474
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3625514{col 26}{space 2} .0218299{col 37}{space 5} .3196578{col 51}{space 3} .4054451
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1hei2010_total_score if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0610
{txt}{col 35}Largest FMI{col 51}= {res}    0.0593
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    330.81
{txt}{col 35}        avg{col 51}= {res}    330.81
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    330.81

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1hei2010_total_score {c |}{col 23}{res}{space 2}  41.6594{col 35}{space 2} .4992179{col 46}{space 5} 40.67735{col 60}{space 3} 42.64144
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxHTN if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0179
{txt}{col 35}Largest FMI{col 51}= {res}    0.0178
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    457.69
{txt}{col 35}        avg{col 51}= {res}    457.69
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    457.69

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1dxHTN {c |}
{space 9}No  {c |}{col 14}{res}{space 2} .5440329{col 26}{space 2} .0227936{col 37}{space 5} .4992399{col 51}{space 3} .5888259
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2} .4559671{col 26}{space 2} .0227936{col 37}{space 5} .4111741{col 51}{space 3} .5007601
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1dxDiabetes if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0716
{txt}{col 35}Largest FMI{col 51}= {res}    0.0815
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    264.50
{txt}{col 35}        avg{col 51}= {res}    316.09
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    381.72

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1dxDiabetes {c |}
{space 7}NoDx  {c |}{col 14}{res}{space 2} .6333333{col 26}{space 2} .0223413{col 37}{space 5}  .589406{col 51}{space 3} .6772607
{txt}preDiabetes  {c |}{col 14}{res}{space 2}  .209465{col 26}{space 2}  .019226{col 37}{space 5} .1716096{col 51}{space 3} .2473205
{txt}{space 3}Diabetes  {c |}{col 14}{res}{space 2} .1572016{col 26}{space 2} .0170848{col 37}{space 5} .1235813{col 51}{space 3}  .190822
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1CVhighChol  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0336
{txt}{col 35}Largest FMI{col 51}= {res}    0.0331
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    416.04
{txt}{col 35}        avg{col 51}= {res}    416.04
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    416.04

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1CVhighChol {c |}
{space 9}No  {c |}{col 14}{res}{space 2}  .726749{col 26}{space 2} .0205502{col 37}{space 5} .6863539{col 51}{space 3} .7671441
{txt}{space 8}Yes  {c |}{col 14}{res}{space 2}  .273251{col 26}{space 2} .0205502{col 37}{space 5} .2328559{col 51}{space 3} .3136461
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1cvdbr  if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.2230
{txt}{col 35}Largest FMI{col 51}= {res}    0.1962
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}     92.20
{txt}{col 35}        avg{col 51}= {res}     92.20
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}     92.20

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}w1cvdbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8580247{col 26}{space 2} .0175061{col 37}{space 5} .8232571{col 51}{space 3} .8927923
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1419753{col 26}{space 2} .0175061{col 37}{space 5} .1072077{col 51}{space 3} .1767429
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean CES if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       480
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       479
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    477.01
{txt}{col 35}        avg{col 51}= {res}    477.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    477.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}CES {c |}{col 14}{res}{space 2} 14.49583{col 26}{space 2} .5291683{col 37}{space 5} 13.45604{col 51}{space 3} 15.53562
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_DA if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       482
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       481
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    479.01
{txt}{col 35}        avg{col 51}= {res}    479.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    479.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_DA {c |}{col 14}{res}{space 2} 4.489627{col 26}{space 2} .2299625{col 37}{space 5} 4.037767{col 51}{space 3} 4.941487
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_IP if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       482
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       481
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    479.01
{txt}{col 35}        avg{col 51}= {res}    479.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    479.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_IP {c |}{col 14}{res}{space 2} .8879668{col 26}{space 2} .0588136{col 37}{space 5} .7724023{col 51}{space 3} 1.003531
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_SC if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       482
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       481
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    479.01
{txt}{col 35}        avg{col 51}= {res}    479.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    479.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_SC {c |}{col 14}{res}{space 2} 6.612033{col 26}{space 2} .2053919{col 37}{space 5} 6.208453{col 51}{space 3} 7.015614
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean CES_WB if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       482
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       481
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    479.01
{txt}{col 35}        avg{col 51}= {res}    479.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    479.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}CES_WB {c |}{col 14}{res}{space 2} 9.504149{col 26}{space 2} .1212865{col 37}{space 5}  9.26583{col 51}{space 3} 9.742469
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop CESDcut16 if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       480
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       479
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    477.01
{txt}{col 35}        avg{col 51}= {res}    477.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    477.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}CESDcut16 {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .6229167{col 26}{space 2} .0221214{col 37}{space 5} .5794492{col 51}{space 3} .6663841
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .3770833{col 26}{space 2} .0221214{col 37}{space 5} .3336159{col 51}{space 3} .4205508
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mean w1ANXIETY_ORD if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       401
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       400
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    398.01
{txt}{col 35}        avg{col 51}= {res}    398.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    398.01

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1ANXIETY_ORD {c |}{col 15}{res}{space 2} 2.620948{col 27}{space 2} .1604308{col 38}{space 5}  2.30555{col 52}{space 3} 2.936345
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean zR_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    457.01
{txt}{col 35}        avg{col 51}= {res}    457.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    457.01

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zR_traj_ProbG2ANXIETY {c |}{col 23}{res}{space 2}-.1076511{col 35}{space 2} .0466536{col 46}{space 5}-.1993333{col 60}{space 3}-.0159688
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean R_traj_ProbG2ANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       460
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       459
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    457.01
{txt}{col 35}        avg{col 51}= {res}    457.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    457.01

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
R_traj_ProbG2ANXIETY {c |}{col 22}{res}{space 2} .4144036{col 34}{space 2} .0218194{col 45}{space 5} .3715249{col 59}{space 3} .4572824
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean Lnodds_highANXIETY if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       402
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       401
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    399.01
{txt}{col 35}        avg{col 51}= {res}    399.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    399.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
Lnodds_highANXIETY {c |}{col 20}{res}{space 2}-1.730856{col 32}{space 2} .3729394{col 43}{space 5}-2.464028{col 57}{space 3}-.9976846
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1ANXIETYbr if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       401
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       400
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    398.01
{txt}{col 35}        avg{col 51}= {res}    398.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    398.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             N{col 51}ormal
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}w1ANXIETYbr {c |}
{space 10}1  {c |}{col 14}{res}{space 2}  .553616{col 26}{space 2} .0248248{col 37}{space 5} .5048118{col 51}{space 3} .6024202
{txt}{space 10}2  {c |}{col 14}{res}{space 2}  .446384{col 26}{space 2} .0248248{col 37}{space 5} .3975798{col 51}{space 3} .4951882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: prop w1AnxietyDisorder if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Proportion estimation{col 35}Number of obs{col 51}= {res}       453
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       452
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    450.01
{txt}{col 35}        avg{col 51}= {res}    450.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    450.01

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}{col 42}             N{col 56}ormal
{col 19}{c |} Proportion{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1AnxietyDisorder {c |}
{space 14}No  {c |}{col 19}{res}{space 2} .9072848{col 31}{space 2} .0136269{col 42}{space 5} .8805044{col 56}{space 3} .9340651
{txt}{space 13}Yes  {c |}{col 19}{res}{space 2} .0927152{col 31}{space 2} .0136269{col 42}{space 5} .0659349{col 56}{space 3} .1194956
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: mean w1w3w4bayes1CES if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES {c |}{col 17}{res}{space 2}-.1276652{col 29}{space 2} .0052303{col 40}{space 5}-.1379422{col 54}{space 3}-.1173881
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_DA if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_DA {c |}{col 20}{res}{space 2}-.0703534{col 32}{space 2} .0026323{col 43}{space 5}-.0755256{col 57}{space 3}-.0651812
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_IP if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_IP {c |}{col 20}{res}{space 2}-.0131808{col 32}{space 2}  .000475{col 43}{space 5} -.014114{col 57}{space 3}-.0122475
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_SC if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_SC {c |}{col 20}{res}{space 2}-.0806678{col 32}{space 2} .0019468{col 43}{space 5}-.0844931{col 57}{space 3}-.0768426
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. mi estimate: mean w1w3w4bayes1CES_WB if sample4part==1 & HNDwave==1 & w1HCystert==3
{res}
{txt}Multiple-imputation estimates{col 35}Imputations{col 51}= {res}         5
{txt}Mean estimation{col 35}Number of obs{col 51}= {res}       486
{txt}{col 35}Average RVI{col 51}= {res}    0.0000
{txt}{col 35}Largest FMI{col 51}= {res}    0.0000
{txt}{col 35}Complete DF{col 51}= {res}       485
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 35}DF:     min{col 51}= {res}    483.01
{txt}{col 35}        avg{col 51}= {res}    483.01
{txt}Within VCE type: {ralign 12:{res:Analytic}}{col 35}        max{col 51}= {res}    483.01

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
w1w3w4bayes1CES_WB {c |}{col 20}{res}{space 2}-.0445887{col 32}{space 2} .0023191{col 43}{space 5}-.0491455{col 57}{space 3}-.0400318
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. *********************DIFFERENCE BY HCys load tertiles**************************
. 
. mi estimate: reg w1HCys i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}    270.60
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      w1HCys{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 2.135355{col 26}{space 2} .2858301{col 37}{space 1}    7.47{col 46}{space 3}0.000{col 54}{space 4} 1.574672{col 67}{space 3} 2.696038
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 6.529387{col 26}{space 2}  .286269{col 37}{space 1}   22.81{col 46}{space 3}0.000{col 54}{space 4} 5.967843{col 67}{space 3} 7.090931
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 6.287897{col 26}{space 2}  .202527{col 37}{space 1}   31.05{col 46}{space 3}0.000{col 54}{space 4} 5.890621{col 67}{space 3} 6.685173
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Lnw1HCys i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}   1523.81
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    Lnw1HCys{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}  .298778{col 26}{space 2} .0119566{col 37}{space 1}   24.99{col 46}{space 3}0.000{col 54}{space 4} .2753239{col 67}{space 3} .3222321
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .6600709{col 26}{space 2}  .011975{col 37}{space 1}   55.12{col 46}{space 3}0.000{col 54}{space 4} .6365808{col 67}{space 3} .6835609
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.829577{col 26}{space 2}  .008472{col 37}{space 1}  215.96{col 46}{space 3}0.000{col 54}{space 4} 1.812958{col 67}{space 3} 1.846196
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4HCysTRAJ i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,457
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1454
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,452.00
{txt}{col 49}        avg{col 67}= {res}  1,452.00
{txt}{col 49}        max{col 67}= {res}  1,452.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1452.0{txt}){col 67}= {res}    161.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4HCys~J{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0269969{col 26}{space 2} .0162012{col 37}{space 1}    1.67{col 46}{space 3}0.096{col 54}{space 4}-.0047833{col 67}{space 3} .0587772
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2646983{col 26}{space 2} .0162261{col 37}{space 1}   16.31{col 46}{space 3}0.000{col 54}{space 4} .2328691{col 67}{space 3} .2965275
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0218664{col 26}{space 2} .0114795{col 37}{space 1}    1.90{col 46}{space 3}0.057{col 54}{space 4}-.0006518{col 67}{space 3} .0443847
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3HCys_change i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,382
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1379
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,377.00
{txt}{col 49}        avg{col 67}= {res}  1,377.00
{txt}{col 49}        max{col 67}= {res}  1,377.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1377.0{txt}){col 67}= {res}      0.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6880

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3HCys_c~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0944429{col 26}{space 2} .1096096{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-.3094628{col 67}{space 3} .1205771
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0543227{col 26}{space 2} .1097291{col 37}{space 1}   -0.50{col 46}{space 3}0.621{col 54}{space 4}-.2695771{col 67}{space 3} .1609316
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .300956{col 26}{space 2} .0774637{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .1489963{col 67}{space 3} .4529157
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mlogit Sex  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}  4.51e+60
{txt}{col 49}        avg{col 67}= {res}  4.51e+60
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 4.6e+60{txt}){col 67}= {res}     62.25
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         Sex{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Women       {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Men          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .8450924{col 26}{space 2}   .14011{col 37}{space 1}    6.03{col 46}{space 3}0.000{col 54}{space 4} .5704819{col 67}{space 3} 1.119703
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 1.571993{col 26}{space 2} .1409755{col 37}{space 1}   11.15{col 46}{space 3}0.000{col 54}{space 4} 1.295686{col 67}{space 3}   1.8483
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.145909{col 26}{space 2} .1061339{col 37}{space 1}  -10.80{col 46}{space 3}0.000{col 54}{space 4}-1.353928{col 67}{space 3}-.9378904
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1Age  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}     24.43
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       w1Age{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 2.568648{col 26}{space 2} .5781646{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} 1.434523{col 67}{space 3} 3.702773
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  3.99376{col 26}{space 2} .5790525{col 37}{space 1}    6.90{col 46}{space 3}0.000{col 54}{space 4} 2.857893{col 67}{space 3} 5.129627
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 45.73278{col 26}{space 2} .4096627{col 37}{space 1}  111.64{col 46}{space 3}0.000{col 54}{space 4} 44.92919{col 67}{space 3} 46.53638
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit Race  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   2,      .)}{col 67}= {res}      0.40
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.6681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        Race{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}White        {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0313248{col 26}{space 2} .1291235{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.2844023{col 67}{space 3} .2217527
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1129226{col 26}{space 2}  .129717{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4}-.3671632{col 67}{space 3}  .141318
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2277839{col 26}{space 2}  .091405{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-.4069344{col 67}{space 3}-.0486335
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}AfrAm       {col 14}{txt}{c |}  (base outcome)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit PovStat  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   2,      .)}{col 67}= {res}      0.05
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.9547

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     PovStat{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Above       {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Below        {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0394787{col 26}{space 2} .1328448{col 37}{space 1}   -0.30{col 46}{space 3}0.766{col 54}{space 4}-.2998498{col 67}{space 3} .2208924
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0120976{col 26}{space 2} .1328076{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.2723957{col 67}{space 3} .2482006
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5185307{col 26}{space 2} .0938847{col 37}{space 1}   -5.52{col 46}{space 3}0.000{col 54}{space 4}-.7025413{col 67}{space 3}-.3345201
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1edubr  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0154
{txt}{col 49}Largest FMI{col 67}= {res}    0.0378
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  2,895.89
{txt}{col 49}        avg{col 67}= {res}503,561.35
{txt}{col 49}        max{col 67}= {res}1551658.40
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   4{txt},{res}36805.3{txt}){col 67}= {res}      0.48
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.7492

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1edubr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0132124{col 26}{space 2} .2763129{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.5548113{col 67}{space 3} .5283865
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0063699{col 26}{space 2} .2747445{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-.5323445{col 67}{space 3} .5450843
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.209521{col 26}{space 2}  .196816{col 37}{space 1}  -11.23{col 46}{space 3}0.000{col 54}{space 4}-2.595388{col 67}{space 3}-1.823653
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}2           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0061858{col 26}{space 2} .1346057{col 37}{space 1}    0.05{col 46}{space 3}0.963{col 54}{space 4}-.2576367{col 67}{space 3} .2700083
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1573887{col 26}{space 2} .1362296{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 54}{space 4}-.4243941{col 67}{space 3} .1096167
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.3722723{col 26}{space 2} .0956329{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.5597113{col 67}{space 3}-.1848332
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1currdrugs i.w1HCystert if sample4part==1 & HNDwave==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0992
{txt}{col 49}Largest FMI{col 67}= {res}    0.1329
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    251.92
{txt}{col 49}        avg{col 67}= {res}  1,837.23
{txt}{col 49}        max{col 67}= {res}  4,524.89
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res}  775.5{txt}){col 67}= {res}      2.23
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.1082

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} w1currdrugs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .3045882{col 26}{space 2} .1732324{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0350318{col 67}{space 3} .6442082
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3433187{col 26}{space 2} .1766212{col 37}{space 1}    1.94{col 46}{space 3}0.052{col 54}{space 4}-.0034237{col 67}{space 3} .6900611
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.724664{col 26}{space 2} .1355934{col 37}{space 1}  -12.72{col 46}{space 3}0.000{col 54}{space 4}-1.991705{col 67}{space 3}-1.457623
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1smoke i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0769
{txt}{col 49}Largest FMI{col 67}= {res}    0.1067
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    384.32
{txt}{col 49}        avg{col 67}= {res}  1,321.27
{txt}{col 49}        max{col 67}= {res}  2,968.34
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res}  273.0{txt}){col 67}= {res}      2.45
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0882

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1smoke{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1550052{col 26}{space 2} .1357226{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4} -.111534{col 67}{space 3} .4215444
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .302089{col 26}{space 2} .1370558{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .0326159{col 67}{space 3}  .571562
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.4158073{col 26}{space 2} .0945392{col 37}{space 1}   -4.40{col 46}{space 3}0.000{col 54}{space 4}-.6011763{col 67}{space 3}-.2304383
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1BMI i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0011
{txt}{col 49}Largest FMI{col 67}= {res}    0.0027
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,447.29
{txt}{col 49}        avg{col 67}= {res}  1,451.20
{txt}{col 49}        max{col 67}= {res}  1,453.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1453.1{txt}){col 67}= {res}      0.55
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.5798

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       w1BMI{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.091758{col 26}{space 2} .4775784{col 37}{space 1}   -0.19{col 46}{space 3}0.848{col 54}{space 4}-1.028574{col 67}{space 3} .8450583
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.4710988{col 26}{space 2} .4788083{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-1.410331{col 67}{space 3} .4681338
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 30.07867{col 26}{space 2} .3384956{col 37}{space 1}   88.86{col 46}{space 3}0.000{col 54}{space 4} 29.41468{col 67}{space 3} 30.74266
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1SRH i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0010
{txt}{col 49}Largest FMI{col 67}= {res}    0.0015
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}1878249.77
{txt}{col 49}        avg{col 67}= {res}  3.88e+48
{txt}{col 49}        max{col 67}= {res}  1.68e+49
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   4{txt},{res} 9.2e+06{txt}){col 67}= {res}      1.98
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0943

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       w1SRH{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0206632{col 26}{space 2} .1774111{col 37}{space 1}   -0.12{col 46}{space 3}0.907{col 54}{space 4}-.3683826{col 67}{space 3} .3270562
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .4031338{col 26}{space 2} .1722186{col 37}{space 1}    2.34{col 46}{space 3}0.019{col 54}{space 4} .0655914{col 67}{space 3} .7406762
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.7756682{col 26}{space 2} .1253123{col 37}{space 1}   -6.19{col 46}{space 3}0.000{col 54}{space 4}-1.021276{col 67}{space 3}-.5300605
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0058138{col 26}{space 2} .1424674{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-.2734172{col 67}{space 3} .2850448
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1281905{col 26}{space 2} .1456777{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 54}{space 4}-.1573327{col 67}{space 3} .4137136
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0612436{col 26}{space 2} .1010626{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-.2593227{col 67}{space 3} .1368355
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}3           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1hei2010_total_score i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.1831
{txt}{col 49}Largest FMI{col 67}= {res}    0.2517
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     69.87
{txt}{col 49}        avg{col 67}= {res}     94.11
{txt}{col 49}        max{col 67}= {res}    122.33
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res}   93.3{txt}){col 67}= {res}      5.52
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0054

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1hei2010_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-1.002141{col 26}{space 2} .8202213{col 37}{space 1}   -1.22{col 46}{space 3}0.224{col 54}{space 4}-2.625807{col 67}{space 3} .6215244
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-2.684354{col 26}{space 2} .8372512{col 37}{space 1}   -3.21{col 46}{space 3}0.002{col 54}{space 4}-4.347668{col 67}{space 3} -1.02104
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 44.34375{col 26}{space 2} .6035379{col 37}{space 1}   73.47{col 46}{space 3}0.000{col 54}{space 4} 43.13999{col 67}{space 3} 45.54751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1dxHTN i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0320
{txt}{col 49}Largest FMI{col 67}= {res}    0.0562
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,332.17
{txt}{col 49}        avg{col 67}= {res}  7,766.20
{txt}{col 49}        max{col 67}= {res} 19,845.15
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 3537.8{txt}){col 67}= {res}      8.39
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0002

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1dxHTN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}No          {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Yes          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .3818056{col 26}{space 2} .1362691{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .1145706{col 67}{space 3} .6490405
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .5395906{col 26}{space 2} .1337948{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} .2773416{col 67}{space 3} .8018396
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.7161841{col 26}{space 2} .0994689{col 37}{space 1}   -7.20{col 46}{space 3}0.000{col 54}{space 4} -.911317{col 67}{space 3}-.5210513
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1dxDiabetes i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0372
{txt}{col 49}Largest FMI{col 67}= {res}    0.0668
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    950.67
{txt}{col 49}        avg{col 67}= {res}393,371.68
{txt}{col 49}        max{col 67}= {res}1189291.87
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   4{txt},{res} 6553.8{txt}){col 67}= {res}      2.26
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0599

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1dxDiabetes{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}NoDx        {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}preDiabetes  {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .2462698{col 26}{space 2} .1801997{col 37}{space 1}    1.37{col 46}{space 3}0.172{col 54}{space 4}-.1071224{col 67}{space 3} .5996621
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .4748805{col 26}{space 2} .1774231{col 37}{space 1}    2.68{col 46}{space 3}0.008{col 54}{space 4} .1268486{col 67}{space 3} .8229124
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.581523{col 26}{space 2} .1338491{col 37}{space 1}  -11.82{col 46}{space 3}0.000{col 54}{space 4}-1.844196{col 67}{space 3}-1.318849
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Diabetes     {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0658632{col 26}{space 2} .1930189{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.3124473{col 67}{space 3} .4441736
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3210786{col 26}{space 2} .1905195{col 37}{space 1}    1.69{col 46}{space 3}0.092{col 54}{space 4}-.0524611{col 67}{space 3} .6946184
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.714787{col 26}{space 2} .1369841{col 37}{space 1}  -12.52{col 46}{space 3}0.000{col 54}{space 4}-1.983271{col 67}{space 3}-1.446303
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1CVhighChol  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0740
{txt}{col 49}Largest FMI{col 67}= {res}    0.1425
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    220.29
{txt}{col 49}        avg{col 67}= {res}  1,962.93
{txt}{col 49}        max{col 67}= {res}  3,864.58
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res}  325.8{txt}){col 67}= {res}      2.54
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0802

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1CVhighChol{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}No          {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Yes          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1325617{col 26}{space 2} .1662879{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4} -.195157{col 67}{space 3} .4602805
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3499118{col 26}{space 2} .1535386{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .0488874{col 67}{space 3} .6509363
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.328154{col 26}{space 2} .1143185{col 37}{space 1}  -11.62{col 46}{space 3}0.000{col 54}{space 4}-1.552365{col 67}{space 3}-1.103944
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1cvdbr  i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.2157
{txt}{col 49}Largest FMI{col 67}= {res}    0.2207
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}     95.58
{txt}{col 49}        avg{col 67}= {res}    592.62
{txt}{col 49}        max{col 67}= {res}  1,164.16
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res}  116.4{txt}){col 67}= {res}      0.36
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.6989

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1cvdbr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.1628034{col 26}{space 2} .2041439{col 37}{space 1}   -0.80{col 46}{space 3}0.427{col 54}{space 4}-.5680485{col 67}{space 3} .2424417
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1104349{col 26}{space 2} .1890359{col 37}{space 1}   -0.58{col 46}{space 3}0.559{col 54}{space 4}-.4818059{col 67}{space 3} .2609361
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -1.68946{col 26}{space 2} .1290442{col 37}{space 1}  -13.09{col 46}{space 3}0.000{col 54}{space 4}-1.942645{col 67}{space 3}-1.436275
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: reg CES i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,445
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1442
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,440.00
{txt}{col 49}        avg{col 67}= {res}  1,440.00
{txt}{col 49}        max{col 67}= {res}  1,440.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1440.0{txt}){col 67}= {res}      1.92
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1467

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         CES{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-1.131293{col 26}{space 2} .7188139{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-2.541327{col 67}{space 3} .2787416
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1604167{col 26}{space 2} .7206737{col 37}{space 1}    0.22{col 46}{space 3}0.824{col 54}{space 4}-1.253266{col 67}{space 3} 1.574099
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 14.33542{col 26}{space 2} .5095933{col 37}{space 1}   28.13{col 46}{space 3}0.000{col 54}{space 4} 13.33579{col 67}{space 3} 15.33504
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_DA i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1446
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,444.00
{txt}{col 49}        avg{col 67}= {res}  1,444.00
{txt}{col 49}        max{col 67}= {res}  1,444.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1444.0{txt}){col 67}= {res}      1.54
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_DA{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.4826065{col 26}{space 2} .3117506{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-1.094139{col 67}{space 3}  .128926
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.019729{col 26}{space 2} .3123934{col 37}{space 1}   -0.06{col 46}{space 3}0.950{col 54}{space 4}-.6325224{col 67}{space 3} .5930645
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.509356{col 26}{space 2} .2210102{col 37}{space 1}   20.40{col 46}{space 3}0.000{col 54}{space 4}  4.07582{col 67}{space 3} 4.942891
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_IP i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1446
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,444.00
{txt}{col 49}        avg{col 67}= {res}  1,444.00
{txt}{col 49}        max{col 67}= {res}  1,444.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1444.0{txt}){col 67}= {res}      0.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6952

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_IP{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0632299{col 26}{space 2} .0821814{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.2244376{col 67}{space 3} .0979778
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0579791{col 26}{space 2} .0823508{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.2195192{col 67}{space 3} .1035609
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .9459459{col 26}{space 2} .0582611{col 37}{space 1}   16.24{col 46}{space 3}0.000{col 54}{space 4} .8316606{col 67}{space 3} 1.060231
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_SC i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1446
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,444.00
{txt}{col 49}        avg{col 67}= {res}  1,444.00
{txt}{col 49}        max{col 67}= {res}  1,444.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1444.0{txt}){col 67}= {res}      2.07
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1262

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_SC{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.4749322{col 26}{space 2} .2844618{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-1.032935{col 67}{space 3} .0830703
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0486236{col 26}{space 2} .2850483{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.5105294{col 67}{space 3} .6077767
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  6.56341{col 26}{space 2} .2016642{col 37}{space 1}   32.55{col 46}{space 3}0.000{col 54}{space 4} 6.167823{col 67}{space 3} 6.958996
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_WB i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1446
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,444.00
{txt}{col 49}        avg{col 67}= {res}  1,444.00
{txt}{col 49}        max{col 67}= {res}  1,444.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1444.0{txt}){col 67}= {res}      1.54
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2151

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_WB{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1081466{col 26}{space 2} .1684297{col 37}{space 1}    0.64{col 46}{space 3}0.521{col 54}{space 4}-.2222465{col 67}{space 3} .4385397
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1840003{col 26}{space 2}  .168777{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-.5150746{col 67}{space 3}  .147074
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  9.68815{col 26}{space 2} .1194053{col 37}{space 1}   81.14{col 46}{space 3}0.000{col 54}{space 4} 9.453923{col 67}{space 3} 9.922376
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit CESDcut16 i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,445
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   2,      .)}{col 67}= {res}      0.32
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.7240

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   CESDcut16{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0701463{col 26}{space 2} .1340996{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-.3329768{col 67}{space 3} .1926841
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0356365{col 26}{space 2} .1334893{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.2259977{col 67}{space 3} .2972707
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5375831{col 26}{space 2} .0946047{col 37}{space 1}   -5.68{col 46}{space 3}0.000{col 54}{space 4}-.7230049{col 67}{space 3}-.3521613
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg w1ANXIETY_ORD i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,181
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1178
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,176.01
{txt}{col 49}        avg{col 67}= {res}  1,176.01
{txt}{col 49}        max{col 67}= {res}  1,176.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1176.0{txt}){col 67}= {res}      0.98
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3753

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1ANXIETY_~D{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1615385{col 26}{space 2}   .22826{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.2863039{col 67}{space 3} .6093809
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1559754{col 26}{space 2} .2266893{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4} -.600736{col 67}{space 3} .2887851
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.776923{col 26}{space 2} .1614042{col 37}{space 1}   17.20{col 46}{space 3}0.000{col 54}{space 4} 2.460251{col 67}{space 3} 3.093595
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg zR_traj_ProbG2ANXIETY i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,383
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1380
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,378.00
{txt}{col 49}        avg{col 67}= {res}  1,378.00
{txt}{col 49}        max{col 67}= {res}  1,378.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1378.0{txt}){col 67}= {res}      1.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3615

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zR_traj_Pr~Y{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0141712{col 26}{space 2} .0657717{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-.1148523{col 67}{space 3} .1431946
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0733444{col 26}{space 2} .0658431{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.2025079{col 67}{space 3} .0558191
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0343067{col 26}{space 2} .0465328{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-.1255894{col 67}{space 3} .0569761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg R_traj_ProbG2ANXIETY i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,383
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1380
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,378.00
{txt}{col 49}        avg{col 67}= {res}  1,378.00
{txt}{col 49}        max{col 67}= {res}  1,378.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1378.0{txt}){col 67}= {res}      1.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3615

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}R_t~2ANXIETY{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0066277{col 26}{space 2} .0307607{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-.0537151{col 67}{space 3} .0669705
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0343023{col 26}{space 2}  .030794{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.0947106{col 67}{space 3} .0261059
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .448706{col 26}{space 2} .0217629{col 37}{space 1}   20.62{col 46}{space 3}0.000{col 54}{space 4} .4060141{col 67}{space 3} .4913979
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Lnodds_highANXIETY i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,224
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1221
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,219.00
{txt}{col 49}        avg{col 67}= {res}  1,219.00
{txt}{col 49}        max{col 67}= {res}  1,219.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1219.0{txt}){col 67}= {res}      2.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0977

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Lnodds_hig~Y{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.3577749{col 26}{space 2} .5230306{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-1.383915{col 67}{space 3} .6683652
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-1.110637{col 26}{space 2} .5240197{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-2.138717{col 67}{space 3}-.0825561
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.6202195{col 26}{space 2}  .367129{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-1.340494{col 67}{space 3} .1000553
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1ANXIETYbr i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,181
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   2,      .)}{col 67}= {res}      1.84
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.1596

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} w1ANXIETYbr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.082065{col 26}{space 2}  .143255{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-.3628396{col 67}{space 3} .1987097
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.2665848{col 26}{space 2} .1426683{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-.5462097{col 67}{space 3}   .01304
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0512933{col 26}{space 2} .1013072{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4}-.1472653{col 67}{space 3} .2498518
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1AnxietyDisorder i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,346
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}  6.89e+63
{txt}{col 49}        avg{col 67}= {res}  6.89e+63
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 9.3e+63{txt}){col 67}= {res}      0.80
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.4499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1AnxietyD~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}No          {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Yes          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}  .010964{col 26}{space 2} .2095306{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-.3997084{col 67}{space 3} .4216364
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.2382059{col 26}{space 2}  .219014{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-.6674655{col 67}{space 3} .1910537
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.042718{col 26}{space 2} .1473925{col 37}{space 1}  -13.86{col 46}{space 3}0.000{col 54}{space 4}-2.331602{col 67}{space 3}-1.753834
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: reg w1w3w4bayes1CES i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}      4.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0074

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~S{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}  .015789{col 26}{space 2} .0071045{col 37}{space 1}    2.22{col 46}{space 3}0.026{col 54}{space 4} .0018529{col 67}{space 3}  .029725
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0057184{col 26}{space 2} .0071154{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-.0196759{col 67}{space 3} .0082391
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.1219468{col 26}{space 2} .0050339{col 37}{space 1}  -24.23{col 46}{space 3}0.000{col 54}{space 4}-.1318213{col 67}{space 3}-.1120723
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_DA i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}      0.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4607

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~A{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0046405{col 26}{space 2} .0037573{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.0027297{col 67}{space 3} .0120108
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0028479{col 26}{space 2}  .003763{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-.0045337{col 67}{space 3} .0102295
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0732013{col 26}{space 2} .0026622{col 37}{space 1}  -27.50{col 46}{space 3}0.000{col 54}{space 4}-.0784236{col 67}{space 3}-.0679791
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_IP i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}      0.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.8692

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~P{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0001419{col 26}{space 2} .0007026{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.0012364{col 67}{space 3} .0015201
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0003693{col 26}{space 2} .0007037{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4}-.0010111{col 67}{space 3} .0017496
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0135501{col 26}{space 2} .0004978{col 37}{space 1}  -27.22{col 46}{space 3}0.000{col 54}{space 4}-.0145266{col 67}{space 3}-.0125735
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_SC i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}      3.04
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0481

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~C{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0054588{col 26}{space 2} .0026988{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0001649{col 67}{space 3} .0107527
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0005597{col 26}{space 2} .0027029{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.0058617{col 67}{space 3} .0047424
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0801081{col 26}{space 2} .0019122{col 37}{space 1}  -41.89{col 46}{space 3}0.000{col 54}{space 4}-.0838592{col 67}{space 3}-.0763571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_WB i.w1HCystert if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1457
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,455.00
{txt}{col 49}        avg{col 67}= {res}  1,455.00
{txt}{col 49}        max{col 67}= {res}  1,455.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   2{txt},{res} 1455.0{txt}){col 67}= {res}      6.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0022

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~B{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0092954{col 26}{space 2} .0035018{col 37}{space 1}   -2.65{col 46}{space 3}0.008{col 54}{space 4}-.0161646{col 67}{space 3}-.0024261
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0022718{col 26}{space 2} .0035072{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-.0046079{col 67}{space 3} .0091516
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0468605{col 26}{space 2} .0024813{col 37}{space 1}  -18.89{col 46}{space 3}0.000{col 54}{space 4}-.0517277{col 67}{space 3}-.0419933
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********************Difference by HCys load tertile, age, sex, race and poverty status-adjusted*******************
. mi estimate: reg w1HCys i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}     92.13
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      w1HCys{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 1.980697{col 26}{space 2} .2913025{col 37}{space 1}    6.80{col 46}{space 3}0.000{col 54}{space 4} 1.409278{col 67}{space 3} 2.552116
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 6.254956{col 26}{space 2} .3055721{col 37}{space 1}   20.47{col 46}{space 3}0.000{col 54}{space 4} 5.655546{col 67}{space 3} 6.854367
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0326472{col 26}{space 2} .0130341{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0070796{col 67}{space 3} .0582149
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .3159393{col 26}{space 2} .2375945{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-.1501262{col 67}{space 3} .7820048
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .3721645{col 26}{space 2} .2483988{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.1150947{col 67}{space 3} .8594237
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .0177465{col 26}{space 2} .2448254{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4} -.462503{col 67}{space 3} .4979961
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.816712{col 26}{space 2} .8947731{col 37}{space 1}    4.27{col 46}{space 3}0.000{col 54}{space 4} 2.061525{col 67}{space 3} 5.571899
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Lnw1HCys i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}    519.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    Lnw1HCys{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .2871844{col 26}{space 2} .0121189{col 37}{space 1}   23.70{col 46}{space 3}0.000{col 54}{space 4}  .263412{col 67}{space 3} .3109568
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .6394937{col 26}{space 2} .0127125{col 37}{space 1}   50.30{col 46}{space 3}0.000{col 54}{space 4} .6145568{col 67}{space 3} .6644306
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0023358{col 26}{space 2} .0005422{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0012721{col 67}{space 3} .0033995
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0056827{col 26}{space 2} .0098845{col 37}{space 1}    0.57{col 46}{space 3}0.565{col 54}{space 4}-.0137068{col 67}{space 3} .0250721
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0305611{col 26}{space 2}  .010334{col 37}{space 1}    2.96{col 46}{space 3}0.003{col 54}{space 4} .0102899{col 67}{space 3} .0508323
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .0083783{col 26}{space 2} .0101853{col 37}{space 1}    0.82{col 46}{space 3}0.411{col 54}{space 4}-.0116013{col 67}{space 3} .0283578
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.66447{col 26}{space 2} .0372247{col 37}{space 1}   44.71{col 46}{space 3}0.000{col 54}{space 4}  1.59145{col 67}{space 3} 1.737491
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4HCysTRAJ i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,457
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1450
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,448.00
{txt}{col 49}        avg{col 67}= {res}  1,448.00
{txt}{col 49}        max{col 67}= {res}  1,448.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1448.0{txt}){col 67}= {res}     60.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4HCys~J{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0329347{col 26}{space 2} .0163672{col 37}{space 1}    2.01{col 46}{space 3}0.044{col 54}{space 4} .0008288{col 67}{space 3} .0650407
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .271934{col 26}{space 2} .0171745{col 37}{space 1}   15.83{col 46}{space 3}0.000{col 54}{space 4} .2382444{col 67}{space 3} .3056237
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0032339{col 26}{space 2} .0007327{col 37}{space 1}   -4.41{col 46}{space 3}0.000{col 54}{space 4}-.0046711{col 67}{space 3}-.0017966
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0212327{col 26}{space 2} .0133635{col 37}{space 1}    1.59{col 46}{space 3}0.112{col 54}{space 4}-.0049813{col 67}{space 3} .0474466
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0142523{col 26}{space 2} .0139593{col 37}{space 1}    1.02{col 46}{space 3}0.307{col 54}{space 4}-.0131303{col 67}{space 3} .0416349
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .0362784{col 26}{space 2} .0137701{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4}  .009267{col 67}{space 3} .0632899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .069262{col 26}{space 2} .0502795{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-.0293664{col 67}{space 3} .1678905
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3HCys_change i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,382
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1375
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,373.00
{txt}{col 49}        avg{col 67}= {res}  1,373.00
{txt}{col 49}        max{col 67}= {res}  1,373.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1373.0{txt}){col 67}= {res}      1.63
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1365

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3HCys_c~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.1555081{col 26}{space 2} .1118723{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-.3749673{col 67}{space 3}  .063951
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1634604{col 26}{space 2} .1170184{col 37}{space 1}   -1.40{col 46}{space 3}0.163{col 54}{space 4}-.3930147{col 67}{space 3} .0660939
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}  .006377{col 26}{space 2} .0050054{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4} -.003442{col 67}{space 3} .0161961
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0907012{col 26}{space 2} .0911345{col 37}{space 1}    1.00{col 46}{space 3}0.320{col 54}{space 4}-.0880768{col 67}{space 3} .2694791
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .2294147{col 26}{space 2} .0953878{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0422931{col 67}{space 3} .4165363
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .1091163{col 26}{space 2} .0941675{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0756114{col 67}{space 3} .2938441
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.565965{col 26}{space 2} .3447009{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-1.242162{col 67}{space 3} .1102324
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: mlogit Sex  i.w1HCystert w1Age Race  PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}  4.79e+60
{txt}{col 49}        avg{col 67}= {res}  4.79e+60
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1.7e+62{txt}){col 67}= {res}     27.06
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         Sex{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Women       {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Men          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .9043684{col 26}{space 2} .1422187{col 37}{space 1}    6.36{col 46}{space 3}0.000{col 54}{space 4} .6256249{col 67}{space 3} 1.183112
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 1.669746{col 26}{space 2} .1454262{col 37}{space 1}   11.48{col 46}{space 3}0.000{col 54}{space 4} 1.384716{col 67}{space 3} 1.954776
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0207085{col 26}{space 2} .0062647{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-.0329871{col 67}{space 3}-.0084299
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0365369{col 26}{space 2} .1137692{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-.1864467{col 67}{space 3} .2595204
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.2563649{col 26}{space 2} .1175835{col 37}{space 1}   -2.18{col 46}{space 3}0.029{col 54}{space 4}-.4868243{col 67}{space 3}-.0259055
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0840773{col 26}{space 2} .3889162{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-.6781845{col 67}{space 3}  .846339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1Age  i.w1HCystert  Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1454
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,452.00
{txt}{col 49}        avg{col 67}= {res}  1,452.00
{txt}{col 49}        max{col 67}= {res}  1,452.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   5{txt},{res} 1452.0{txt}){col 67}= {res}     14.74
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       w1Age{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}  2.86303{col 26}{space 2} .5812845{col 37}{space 1}    4.93{col 46}{space 3}0.000{col 54}{space 4} 1.722783{col 67}{space 3} 4.003277
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 4.608055{col 26}{space 2} .6028313{col 37}{space 1}    7.64{col 46}{space 3}0.000{col 54}{space 4} 3.425542{col 67}{space 3} 5.790569
{txt}{space 12} {c |}
{space 8}Race {c |}{col 14}{res}{space 2}-.6525551{col 26}{space 2} .4777444{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-1.589698{col 67}{space 3} .2845878
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.651898{col 26}{space 2} .4979085{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-2.628595{col 67}{space 3}-.6752014
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1.611033{col 26}{space 2} .4907844{col 37}{space 1}   -3.28{col 46}{space 3}0.001{col 54}{space 4}-2.573755{col 67}{space 3}-.6483104
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 51.01128{col 26}{space 2} 1.204788{col 37}{space 1}   42.34{col 46}{space 3}0.000{col 54}{space 4} 48.64797{col 67}{space 3} 53.37459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit Race  i.w1HCystert w1Age  Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   5,      .)}{col 67}= {res}      5.70
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        Race{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}White        {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0514889{col 26}{space 2} .1331795{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4} -.312516{col 67}{space 3} .2095382
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.135802{col 26}{space 2} .1400669{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.4103279{col 67}{space 3}  .138724
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}  .008149{col 26}{space 2} .0059665{col 37}{space 1}    1.37{col 46}{space 3}0.172{col 54}{space 4}-.0035452{col 67}{space 3} .0198431
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0365184{col 26}{space 2} .1138656{col 37}{space 1}   -0.32{col 46}{space 3}0.748{col 54}{space 4}-.2596909{col 67}{space 3} .1866541
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.5587162{col 26}{space 2} .1126936{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4}-.7795916{col 67}{space 3}-.3378408
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .206602{col 26}{space 2} .3773291{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 54}{space 4}-.5329494{col 67}{space 3} .9461534
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}AfrAm       {col 14}{txt}{c |}  (base outcome)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit PovStat  i.w1HCystert w1Age Race Sex  if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   5,      .)}{col 67}= {res}      7.88
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     PovStat{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Above       {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Below        {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0549058{col 26}{space 2} .1377144{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.2150094{col 67}{space 3} .3248211
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1492642{col 26}{space 2}  .144452{col 37}{space 1}    1.03{col 46}{space 3}0.301{col 54}{space 4}-.1338565{col 67}{space 3}  .432385
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0200769{col 26}{space 2} .0061457{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.0321223{col 67}{space 3}-.0080316
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .5589548{col 26}{space 2} .1126887{col 37}{space 1}    4.96{col 46}{space 3}0.000{col 54}{space 4}  .338089{col 67}{space 3} .7798205
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2572515{col 26}{space 2} .1179137{col 37}{space 1}   -2.18{col 46}{space 3}0.029{col 54}{space 4}-.4883582{col 67}{space 3}-.0261449
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.168679{col 26}{space 2}  .385332{col 37}{space 1}   -0.44{col 46}{space 3}0.662{col 54}{space 4}-.9239159{col 67}{space 3} .5865579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1edubr  i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0220
{txt}{col 49}Largest FMI{col 67}= {res}    0.0535
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,468.14
{txt}{col 49}        avg{col 67}= {res}102,989.47
{txt}{col 49}        max{col 67}= {res}984,674.60
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}78167.2{txt}){col 67}= {res}      8.74
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1edubr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.1342041{col 26}{space 2} .2865713{col 37}{space 1}   -0.47{col 46}{space 3}0.640{col 54}{space 4}-.6959331{col 67}{space 3}  .427525
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1856467{col 26}{space 2} .2966476{col 37}{space 1}   -0.63{col 46}{space 3}0.532{col 54}{space 4}-.7674639{col 67}{space 3} .3961705
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0483808{col 26}{space 2} .0134548{col 37}{space 1}    3.60{col 46}{space 3}0.000{col 54}{space 4} .0220039{col 67}{space 3} .0747577
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.9112787{col 26}{space 2} .2345629{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-1.371167{col 67}{space 3}-.4513909
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0842122{col 26}{space 2} .2385685{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-.3833788{col 67}{space 3} .5518032
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .7669201{col 26}{space 2} .2373609{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .3013174{col 67}{space 3} 1.232523
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.387844{col 26}{space 2} .9455291{col 37}{space 1}   -4.64{col 46}{space 3}0.000{col 54}{space 4}-6.241547{col 67}{space 3}-2.534141
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}2           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0126567{col 26}{space 2} .1408314{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}-.2633681{col 67}{space 3} .2886815
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1284379{col 26}{space 2} .1492206{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-.4209064{col 67}{space 3} .1640305
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0072033{col 26}{space 2} .0064459{col 37}{space 1}    1.12{col 46}{space 3}0.264{col 54}{space 4}-.0054362{col 67}{space 3} .0198429
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.1633527{col 26}{space 2} .1158869{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4} -.390501{col 67}{space 3} .0637955
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.1736165{col 26}{space 2} .1218838{col 37}{space 1}   -1.42{col 46}{space 3}0.154{col 54}{space 4}-.4125197{col 67}{space 3} .0652868
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.9155187{col 26}{space 2} .1267283{col 37}{space 1}   -7.22{col 46}{space 3}0.000{col 54}{space 4}-1.163933{col 67}{space 3}-.6671049
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9915737{col 26}{space 2}  .435008{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .1389274{col 67}{space 3}  1.84422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1currdrugs i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.1460
{txt}{col 49}Largest FMI{col 67}= {res}    0.2691
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}     65.52
{txt}{col 49}        avg{col 67}= {res}  1,708.29
{txt}{col 49}        max{col 67}= {res}  5,308.31
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1166.6{txt}){col 67}= {res}     11.42
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} w1currdrugs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .3166432{col 26}{space 2}  .182265{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.0406711{col 67}{space 3} .6739576
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3194891{col 26}{space 2} .1924435{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0579392{col 67}{space 3} .6969174
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0464857{col 26}{space 2} .0091698{col 37}{space 1}   -5.07{col 46}{space 3}0.000{col 54}{space 4}-.0647428{col 67}{space 3}-.0282285
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .4703171{col 26}{space 2} .1623762{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4}  .149227{col 67}{space 3} .7914072
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .6032325{col 26}{space 2}  .149969{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .3092155{col 67}{space 3} .8972496
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}  .417216{col 26}{space 2} .1528587{col 37}{space 1}    2.73{col 46}{space 3}0.007{col 54}{space 4} .1161052{col 67}{space 3} .7183268
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -1.78393{col 26}{space 2} .6182338{col 37}{space 1}   -2.89{col 46}{space 3}0.005{col 54}{space 4}-3.018443{col 67}{space 3} -.549417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1smoke i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0968
{txt}{col 49}Largest FMI{col 67}= {res}    0.1985
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    117.04
{txt}{col 49}        avg{col 67}= {res}  1,191.13
{txt}{col 49}        max{col 67}= {res}  2,865.71
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1774.1{txt}){col 67}= {res}     12.66
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1smoke{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1530718{col 26}{space 2} .1422291{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.1261409{col 67}{space 3} .4322845
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2661033{col 26}{space 2} .1498448{col 37}{space 1}    1.78{col 46}{space 3}0.076{col 54}{space 4}-.0283029{col 67}{space 3} .5605095
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} -.015824{col 26}{space 2} .0062429{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-.0280659{col 67}{space 3}-.0035821
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .1467022{col 26}{space 2}  .123024{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-.0969396{col 67}{space 3} .3903439
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .3181811{col 26}{space 2} .1196146{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} .0834692{col 67}{space 3}  .552893
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}  .876202{col 26}{space 2} .1183041{col 37}{space 1}    7.41{col 46}{space 3}0.000{col 54}{space 4}  .643865{col 67}{space 3} 1.108539
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.539969{col 26}{space 2} .4259915{col 37}{space 1}   -3.62{col 46}{space 3}0.000{col 54}{space 4} -2.37525{col 67}{space 3} -.704688
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1BMI i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0010
{txt}{col 49}Largest FMI{col 67}= {res}    0.0026
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,443.70
{txt}{col 49}        avg{col 67}= {res}  1,448.31
{txt}{col 49}        max{col 67}= {res}  1,450.66
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1450.8{txt}){col 67}= {res}     10.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       w1BMI{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .3799633{col 26}{space 2} .4786987{col 37}{space 1}    0.79{col 46}{space 3}0.427{col 54}{space 4}-.5590528{col 67}{space 3} 1.318979
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .498205{col 26}{space 2} .5026434{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4}-.4877845{col 67}{space 3} 1.484194
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0296252{col 26}{space 2} .0214191{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-.0123906{col 67}{space 3} .0716409
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .1055252{col 26}{space 2} .3903595{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.6602043{col 67}{space 3} .8712548
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-3.001896{col 26}{space 2} .4081661{col 37}{space 1}   -7.35{col 46}{space 3}0.000{col 54}{space 4}-3.802555{col 67}{space 3}-2.201237
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.4439791{col 26}{space 2} .4026394{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4}-1.233799{col 67}{space 3}  .345841
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 32.89529{col 26}{space 2} 1.470757{col 37}{space 1}   22.37{col 46}{space 3}0.000{col 54}{space 4} 30.01025{col 67}{space 3} 35.78033
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1SRH i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0013
{txt}{col 49}Largest FMI{col 67}= {res}    0.0023
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}755,889.80
{txt}{col 49}        avg{col 67}= {res}  2.47e+12
{txt}{col 49}        max{col 67}= {res}  2.46e+13
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res} 2.1e+07{txt}){col 67}= {res}      7.03
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       w1SRH{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0276976{col 26}{space 2} .1851026{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}-.3904921{col 67}{space 3} .3350968
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .4190274{col 26}{space 2} .1885396{col 37}{space 1}    2.22{col 46}{space 3}0.026{col 54}{space 4} .0494963{col 67}{space 3} .7885585
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0261581{col 26}{space 2} .0082414{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .0100053{col 67}{space 3} .0423109
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.1818064{col 26}{space 2} .1477205{col 37}{space 1}   -1.23{col 46}{space 3}0.218{col 54}{space 4}-.4713336{col 67}{space 3} .1077207
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2526615{col 26}{space 2}   .15452{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.5555154{col 67}{space 3} .0501923
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.113059{col 26}{space 2} .1505905{col 37}{space 1}    7.39{col 46}{space 3}0.000{col 54}{space 4} .8179065{col 67}{space 3} 1.408211
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.970699{col 26}{space 2} .5709124{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-4.089667{col 67}{space 3}-1.851731
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0544474{col 26}{space 2} .1465042{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.2326956{col 67}{space 3} .3415904
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2361456{col 26}{space 2} .1570798{col 37}{space 1}    1.50{col 46}{space 3}0.133{col 54}{space 4}-.0717253{col 67}{space 3} .5440165
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0093158{col 26}{space 2} .0066229{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-.0036649{col 67}{space 3} .0222965
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .1573411{col 26}{space 2} .1212707{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-.0803451{col 67}{space 3} .3950273
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.3870182{col 26}{space 2} .1268203{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.6355816{col 67}{space 3}-.1384548
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .2165271{col 26}{space 2} .1288687{col 37}{space 1}    1.68{col 46}{space 3}0.093{col 54}{space 4} -.036051{col 67}{space 3} .4691051
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5380243{col 26}{space 2} .4528435{col 37}{space 1}   -1.19{col 46}{space 3}0.235{col 54}{space 4}-1.425581{col 67}{space 3} .3495327
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}3           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1hei2010_total_score i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.1500
{txt}{col 49}Largest FMI{col 67}= {res}    0.2546
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     68.43
{txt}{col 49}        avg{col 67}= {res}    221.33
{txt}{col 49}        max{col 67}= {res}    402.49
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  610.3{txt}){col 67}= {res}     11.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1hei2010_~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-1.227794{col 26}{space 2} .8228989{col 37}{space 1}   -1.49{col 46}{space 3}0.138{col 54}{space 4}-2.857455{col 67}{space 3} .4018661
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-2.902128{col 26}{space 2}  .895765{col 37}{space 1}   -3.24{col 46}{space 3}0.002{col 54}{space 4}-4.689396{col 67}{space 3}-1.114861
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}   .17153{col 26}{space 2} .0349971{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4} .1027156{col 67}{space 3} .2403444
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .5545281{col 26}{space 2} .6365829{col 37}{space 1}    0.87{col 46}{space 3}0.384{col 54}{space 4}-.6969166{col 67}{space 3} 1.805973
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.352084{col 26}{space 2} .7072536{col 37}{space 1}   -1.91{col 46}{space 3}0.059{col 54}{space 4}-2.754755{col 67}{space 3} .0505871
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3.234867{col 26}{space 2} .6559444{col 37}{space 1}   -4.93{col 46}{space 3}0.000{col 54}{space 4}-4.524372{col 67}{space 3}-1.945362
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 41.75633{col 26}{space 2}  2.59312{col 37}{space 1}   16.10{col 46}{space 3}0.000{col 54}{space 4} 36.59526{col 67}{space 3} 46.91741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1dxHTN i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0350
{txt}{col 49}Largest FMI{col 67}= {res}    0.0588
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1,219.44
{txt}{col 49}        avg{col 67}= {res} 24,632.10
{txt}{col 49}        max{col 67}= {res}135,097.85
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}17092.6{txt}){col 67}= {res}     28.95
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1dxHTN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}No          {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Yes          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .2527091{col 26}{space 2} .1486343{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.0387477{col 67}{space 3}  .544166
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .3504522{col 26}{space 2} .1513223{col 37}{space 1}    2.32{col 46}{space 3}0.021{col 54}{space 4} .0538633{col 67}{space 3} .6470412
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0851839{col 26}{space 2} .0071739{col 37}{space 1}   11.87{col 46}{space 3}0.000{col 54}{space 4} .0711094{col 67}{space 3} .0992585
{txt}{space 8}Race {c |}{col 14}{res}{space 2}  .540478{col 26}{space 2} .1196066{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} .3060373{col 67}{space 3} .7749187
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2571849{col 26}{space 2} .1257279{col 37}{space 1}   -2.05{col 46}{space 3}0.041{col 54}{space 4}-.5037177{col 67}{space 3}-.0106521
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .1969281{col 26}{space 2} .1219208{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.0420566{col 67}{space 3} .4359128
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.508255{col 26}{space 2} .4970657{col 37}{space 1}  -11.08{col 46}{space 3}0.000{col 54}{space 4}-6.483406{col 67}{space 3}-4.533105
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1dxDiabetes i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0356
{txt}{col 49}Largest FMI{col 67}= {res}    0.0721
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    819.37
{txt}{col 49}        avg{col 67}= {res} 11,518.78
{txt}{col 49}        max{col 67}= {res} 98,177.81
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}33705.2{txt}){col 67}= {res}      6.05
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1dxDiabetes{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}NoDx        {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}preDiabetes  {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}   .06436{col 26}{space 2} .1850885{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 54}{space 4}-.2985302{col 67}{space 3} .4272502
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .171251{col 26}{space 2} .1903396{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-.2020552{col 67}{space 3} .5445571
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0386409{col 26}{space 2} .0082885{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .0223877{col 67}{space 3} .0548942
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.2428792{col 26}{space 2} .1440056{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-.5251563{col 67}{space 3} .0393979
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .4793415{col 26}{space 2} .1513394{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .1826083{col 67}{space 3} .7760746
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.1167036{col 26}{space 2} .1525085{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-.4156331{col 67}{space 3} .1822259
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.451146{col 26}{space 2} .5745139{col 37}{space 1}   -6.01{col 46}{space 3}0.000{col 54}{space 4}-4.577888{col 67}{space 3}-2.324403
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Diabetes     {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0755753{col 26}{space 2} .1999665{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-.4675072{col 67}{space 3} .3163566
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1225604{col 26}{space 2} .2046533{col 37}{space 1}    0.60{col 46}{space 3}0.549{col 54}{space 4}-.2786301{col 67}{space 3} .5237509
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0565267{col 26}{space 2} .0094832{col 37}{space 1}    5.96{col 46}{space 3}0.000{col 54}{space 4} .0379173{col 67}{space 3} .0751361
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.0034145{col 26}{space 2} .1625722{col 37}{space 1}   -0.02{col 46}{space 3}0.983{col 54}{space 4}-.3221945{col 67}{space 3} .3153654
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0151351{col 26}{space 2} .1704605{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 54}{space 4}-.3493061{col 67}{space 3} .3190358
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .1767999{col 26}{space 2} .1651591{col 37}{space 1}    1.07{col 46}{space 3}0.284{col 54}{space 4} -.147026{col 67}{space 3} .5006258
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.589896{col 26}{space 2} .6632313{col 37}{space 1}   -6.92{col 46}{space 3}0.000{col 54}{space 4}-5.891728{col 67}{space 3}-3.288064
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1CVhighChol  i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0904
{txt}{col 49}Largest FMI{col 67}= {res}    0.1628
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}    170.71
{txt}{col 49}        avg{col 67}= {res} 11,465.35
{txt}{col 49}        max{col 67}= {res} 74,886.76
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 2094.1{txt}){col 67}= {res}     17.15
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1CVhighChol{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}No          {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Yes          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0249043{col 26}{space 2}  .175454{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.3702619{col 67}{space 3} .3204534
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1656781{col 26}{space 2} .1679046{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.1634143{col 67}{space 3} .4947704
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0749052{col 26}{space 2} .0079362{col 37}{space 1}    9.44{col 46}{space 3}0.000{col 54}{space 4} .0593433{col 67}{space 3} .0904672
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.4227224{col 26}{space 2} .1343696{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-.6864587{col 67}{space 3}-.1589862
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.1448545{col 26}{space 2} .1494649{col 37}{space 1}   -0.97{col 46}{space 3}0.334{col 54}{space 4}-.4398919{col 67}{space 3} .1501829
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.1247863{col 26}{space 2} .1428392{col 37}{space 1}   -0.87{col 46}{space 3}0.383{col 54}{space 4} -.405185{col 67}{space 3} .1556124
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.898888{col 26}{space 2} .5436927{col 37}{space 1}   -7.17{col 46}{space 3}0.000{col 54}{space 4}-4.966262{col 67}{space 3}-2.831513
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1cvdbr  i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.2177
{txt}{col 49}Largest FMI{col 67}= {res}    0.4188
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}     27.91
{txt}{col 49}        avg{col 67}= {res}    444.64
{txt}{col 49}        max{col 67}= {res}  1,383.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  606.9{txt}){col 67}= {res}      5.95
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     w1cvdbr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.238968{col 26}{space 2} .2056919{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-.6451175{col 67}{space 3} .1671814
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1915414{col 26}{space 2} .2064027{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-.5972846{col 67}{space 3} .2142019
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0470515{col 26}{space 2} .0112012{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .0241037{col 67}{space 3} .0699994
{txt}{space 8}Race {c |}{col 14}{res}{space 2}  .248441{col 26}{space 2} .1611075{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.0676005{col 67}{space 3} .5644825
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.3083635{col 26}{space 2}  .172114{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}  -.64619{col 67}{space 3} .0294629
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .4603907{col 26}{space 2} .1658867{col 37}{space 1}    2.78{col 46}{space 3}0.006{col 54}{space 4} .1336916{col 67}{space 3} .7870897
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.565253{col 26}{space 2} .7523347{col 37}{space 1}   -6.07{col 46}{space 3}0.000{col 54}{space 4}-6.084935{col 67}{space 3}-3.045572
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. mi estimate: reg CES i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,445
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1438
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,436.00
{txt}{col 49}        avg{col 67}= {res}  1,436.00
{txt}{col 49}        max{col 67}= {res}  1,436.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1436.0{txt}){col 67}= {res}     15.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         CES{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.267465{col 26}{space 2} .7129608{col 37}{space 1}   -0.38{col 46}{space 3}0.708{col 54}{space 4}-1.666021{col 67}{space 3} 1.131091
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 1.677012{col 26}{space 2} .7477423{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .2102279{col 67}{space 3} 3.143796
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.1093606{col 26}{space 2} .0318765{col 37}{space 1}   -3.43{col 46}{space 3}0.001{col 54}{space 4}  -.17189{col 67}{space 3}-.0468311
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-1.299626{col 26}{space 2} .5816491{col 37}{space 1}   -2.23{col 46}{space 3}0.026{col 54}{space 4}-2.440599{col 67}{space 3}-.1586531
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -2.82973{col 26}{space 2} .6074595{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-4.021333{col 67}{space 3}-1.638127
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 4.236923{col 26}{space 2} .5998052{col 37}{space 1}    7.06{col 46}{space 3}0.000{col 54}{space 4} 3.060335{col 67}{space 3} 5.413512
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 19.04564{col 26}{space 2} 2.185935{col 37}{space 1}    8.71{col 46}{space 3}0.000{col 54}{space 4} 14.75767{col 67}{space 3} 23.33361
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_DA i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1442
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,440.00
{txt}{col 49}        avg{col 67}= {res}  1,440.00
{txt}{col 49}        max{col 67}= {res}  1,440.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1440.0{txt}){col 67}= {res}     14.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_DA{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0930896{col 26}{space 2} .3096809{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.7005636{col 67}{space 3} .5143844
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .681375{col 26}{space 2} .3247066{col 37}{space 1}    2.10{col 46}{space 3}0.036{col 54}{space 4} .0444264{col 67}{space 3} 1.318324
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0347666{col 26}{space 2} .0138457{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.0619265{col 67}{space 3}-.0076067
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.4794032{col 26}{space 2} .2524928{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.9746964{col 67}{space 3}   .01589
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.501095{col 26}{space 2} .2636782{col 37}{space 1}   -5.69{col 46}{space 3}0.000{col 54}{space 4}-2.018329{col 67}{space 3}-.9838602
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.675709{col 26}{space 2} .2604386{col 37}{space 1}    6.43{col 46}{space 3}0.000{col 54}{space 4} 1.164829{col 67}{space 3} 2.186588
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.407559{col 26}{space 2} .9495568{col 37}{space 1}    6.75{col 46}{space 3}0.000{col 54}{space 4} 4.544896{col 67}{space 3} 8.270221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_IP i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1442
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,440.00
{txt}{col 49}        avg{col 67}= {res}  1,440.00
{txt}{col 49}        max{col 67}= {res}  1,440.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1440.0{txt}){col 67}= {res}      5.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_IP{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0434894{col 26}{space 2} .0830638{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-.2064285{col 67}{space 3} .1194497
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0379638{col 26}{space 2} .0870941{col 37}{space 1}   -0.44{col 46}{space 3}0.663{col 54}{space 4}-.2088086{col 67}{space 3} .1328811
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0125118{col 26}{space 2} .0037137{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.0197967{col 67}{space 3}-.0052268
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0502576{col 26}{space 2} .0677246{col 37}{space 1}    0.74{col 46}{space 3}0.458{col 54}{space 4}-.0825919{col 67}{space 3}  .183107
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   .08509{col 26}{space 2} .0707248{col 37}{space 1}    1.20{col 46}{space 3}0.229{col 54}{space 4}-.0536447{col 67}{space 3} .2238247
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .2798093{col 26}{space 2} .0698559{col 37}{space 1}    4.01{col 46}{space 3}0.000{col 54}{space 4} .1427791{col 67}{space 3} .4168395
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9489593{col 26}{space 2} .2546938{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4} .4493486{col 67}{space 3}  1.44857
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_SC i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1442
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,440.00
{txt}{col 49}        avg{col 67}= {res}  1,440.00
{txt}{col 49}        max{col 67}= {res}  1,440.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1440.0{txt}){col 67}= {res}     14.04
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_SC{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.1684981{col 26}{space 2} .2831243{col 37}{space 1}   -0.60{col 46}{space 3}0.552{col 54}{space 4}-.7238783{col 67}{space 3} .3868821
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .5811759{col 26}{space 2} .2968615{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4}-.0011514{col 67}{space 3} 1.163503
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0379031{col 26}{space 2} .0126584{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.0627339{col 67}{space 3}-.0130723
{txt}{space 8}Race {c |}{col 14}{res}{space 2} -.227405{col 26}{space 2} .2308404{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-.6802244{col 67}{space 3} .2254143
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.015344{col 26}{space 2} .2410665{col 37}{space 1}   -4.21{col 46}{space 3}0.000{col 54}{space 4}-1.488223{col 67}{space 3}-.5424645
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.651193{col 26}{space 2} .2381047{col 37}{space 1}    6.93{col 46}{space 3}0.000{col 54}{space 4} 1.184124{col 67}{space 3} 2.118262
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.642276{col 26}{space 2} .8681277{col 37}{space 1}    8.80{col 46}{space 3}0.000{col 54}{space 4} 5.939345{col 67}{space 3} 9.345206
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg CES_WB i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,449
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1442
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,440.00
{txt}{col 49}        avg{col 67}= {res}  1,440.00
{txt}{col 49}        max{col 67}= {res}  1,440.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1440.0{txt}){col 67}= {res}      9.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      CES_WB{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0400914{col 26}{space 2} .1689968{col 37}{space 1}   -0.24{col 46}{space 3}0.813{col 54}{space 4}-.3715977{col 67}{space 3} .2914149
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.4465683{col 26}{space 2} .1771965{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.7941593{col 67}{space 3}-.0989774
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0245173{col 26}{space 2} .0075558{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .0096958{col 67}{space 3} .0393388
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .6371623{col 26}{space 2} .1377886{col 37}{space 1}    4.62{col 46}{space 3}0.000{col 54}{space 4} .3668745{col 67}{space 3} .9074501
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .4033853{col 26}{space 2} .1438926{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .1211238{col 67}{space 3} .6856467
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.6211161{col 26}{space 2} .1421247{col 37}{space 1}   -4.37{col 46}{space 3}0.000{col 54}{space 4}-.8999096{col 67}{space 3}-.3423225
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.927989{col 26}{space 2} .5181852{col 37}{space 1}   15.30{col 46}{space 3}0.000{col 54}{space 4} 6.911511{col 67}{space 3} 8.944468
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit CESDcut16 i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,445
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}  2.97e+62
{txt}{col 49}        avg{col 67}= {res}  1.95e+68
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 4.1e+64{txt}){col 67}= {res}      8.81
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   CESDcut16{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0404642{col 26}{space 2} .1393813{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-.2327181{col 67}{space 3} .3136465
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2333798{col 26}{space 2} .1456034{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.0519976{col 67}{space 3} .5187572
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} -.014796{col 26}{space 2} .0062341{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.0270146{col 67}{space 3}-.0025774
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.2195485{col 26}{space 2}  .113632{col 37}{space 1}   -1.93{col 46}{space 3}0.053{col 54}{space 4} -.442263{col 67}{space 3}  .003166
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.3594503{col 26}{space 2} .1194453{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-.5935587{col 67}{space 3}-.1253419
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .6803945{col 26}{space 2} .1150455{col 37}{space 1}    5.91{col 46}{space 3}0.000{col 54}{space 4} .4549096{col 67}{space 3} .9058795
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0277717{col 26}{space 2} .4223622{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-.8555865{col 67}{space 3}  .800043
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: reg w1ANXIETY_ORD i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,181
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1174
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,172.01
{txt}{col 49}        avg{col 67}= {res}  1,172.01
{txt}{col 49}        max{col 67}= {res}  1,172.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1172.0{txt}){col 67}= {res}     20.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1ANXIETY_~D{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .5543841{col 26}{space 2} .2229827{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .1168942{col 67}{space 3} .9918741
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .461584{col 26}{space 2} .2320456{col 37}{space 1}    1.99{col 46}{space 3}0.047{col 54}{space 4} .0063128{col 67}{space 3} .9168552
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0524648{col 26}{space 2} .0098962{col 37}{space 1}   -5.30{col 46}{space 3}0.000{col 54}{space 4}-.0718811{col 67}{space 3}-.0330485
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.8452431{col 26}{space 2} .1812302{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-1.200815{col 67}{space 3}-.4896712
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.9843068{col 26}{space 2} .1893824{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-1.355873{col 67}{space 3}-.6127404
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.251397{col 26}{space 2} .1848451{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4}  .888733{col 67}{space 3} 1.614061
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.941195{col 26}{space 2} .6626834{col 37}{space 1}    8.97{col 46}{space 3}0.000{col 54}{space 4} 4.641016{col 67}{space 3} 7.241373
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg zR_traj_ProbG2ANXIETY i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,383
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1376
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,374.00
{txt}{col 49}        avg{col 67}= {res}  1,374.00
{txt}{col 49}        max{col 67}= {res}  1,374.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1374.0{txt}){col 67}= {res}     15.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zR_traj_Pr~Y{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0937466{col 26}{space 2} .0651117{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-.0339825{col 67}{space 3} .2214756
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0639914{col 26}{space 2} .0682592{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.0699122{col 67}{space 3}  .197895
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0112437{col 26}{space 2} .0029225{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4}-.0169768{col 67}{space 3}-.0055106
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.2423348{col 26}{space 2} .0531945{col 37}{space 1}   -4.56{col 46}{space 3}0.000{col 54}{space 4}-.3466861{col 67}{space 3}-.1379836
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2392633{col 26}{space 2} .0555977{col 37}{space 1}   -4.30{col 46}{space 3}0.000{col 54}{space 4}-.3483288{col 67}{space 3}-.1301978
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .3398456{col 26}{space 2} .0545874{col 37}{space 1}    6.23{col 46}{space 3}0.000{col 54}{space 4} .2327618{col 67}{space 3} .4469293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6843679{col 26}{space 2} .1997593{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .2925017{col 67}{space 3} 1.076234
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg R_traj_ProbG2ANXIETY i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,383
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1376
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,374.00
{txt}{col 49}        avg{col 67}= {res}  1,374.00
{txt}{col 49}        max{col 67}= {res}  1,374.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1374.0{txt}){col 67}= {res}     15.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}R_t~2ANXIETY{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0438442{col 26}{space 2}  .030452{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-.0158932{col 67}{space 3} .1035816
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .029928{col 26}{space 2} .0319241{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.0326971{col 67}{space 3} .0925532
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0052586{col 26}{space 2} .0013668{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4}-.0079399{col 67}{space 3}-.0025772
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.1133372{col 26}{space 2} .0248784{col 37}{space 1}   -4.56{col 46}{space 3}0.000{col 54}{space 4} -.162141{col 67}{space 3}-.0645333
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.1119007{col 26}{space 2} .0260024{col 37}{space 1}   -4.30{col 46}{space 3}0.000{col 54}{space 4}-.1629093{col 67}{space 3} -.060892
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .1589418{col 26}{space 2} .0255299{col 37}{space 1}    6.23{col 46}{space 3}0.000{col 54}{space 4}   .10886{col 67}{space 3} .2090236
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7848217{col 26}{space 2} .0934251{col 37}{space 1}    8.40{col 46}{space 3}0.000{col 54}{space 4} .6015504{col 67}{space 3} .9680929
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Lnodds_highANXIETY i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,224
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1217
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,215.00
{txt}{col 49}        avg{col 67}= {res}  1,215.00
{txt}{col 49}        max{col 67}= {res}  1,215.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1215.0{txt}){col 67}= {res}     10.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Lnodds_hig~Y{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .2016078{col 26}{space 2} .5244123{col 37}{space 1}    0.38{col 46}{space 3}0.701{col 54}{space 4}-.8272463{col 67}{space 3} 1.230462
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.122215{col 26}{space 2} .5529648{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-1.207087{col 67}{space 3} .9626569
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0674864{col 26}{space 2} .0234293{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.1134527{col 67}{space 3}-.0215201
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-1.909212{col 26}{space 2} .4306234{col 37}{space 1}   -4.43{col 46}{space 3}0.000{col 54}{space 4}-2.754059{col 67}{space 3}-1.064364
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.727725{col 26}{space 2} .4495913{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-2.609786{col 67}{space 3}-.8456635
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.903824{col 26}{space 2}  .448281{col 37}{space 1}    4.25{col 46}{space 3}0.000{col 54}{space 4} 1.024334{col 67}{space 3} 2.783315
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.038836{col 26}{space 2} 1.628132{col 37}{space 1}    3.09{col 46}{space 3}0.002{col 54}{space 4} 1.844573{col 67}{space 3} 8.233098
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1ANXIETYbr i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,181
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}{help mi_missingdf##|_new:F(   6,      .)}{col 67}= {res}     15.76
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} w1ANXIETYbr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1764648{col 26}{space 2}  .153333{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.1240622{col 67}{space 3} .4769919
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1210002{col 26}{space 2} .1600191{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.1926315{col 67}{space 3}  .434632
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0387851{col 26}{space 2} .0069157{col 37}{space 1}   -5.61{col 46}{space 3}0.000{col 54}{space 4}-.0523397{col 67}{space 3}-.0252305
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.5524654{col 26}{space 2} .1257095{col 37}{space 1}   -4.39{col 46}{space 3}0.000{col 54}{space 4}-.7988515{col 67}{space 3}-.3060793
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.6034314{col 26}{space 2} .1309204{col 37}{space 1}   -4.61{col 46}{space 3}0.000{col 54}{space 4}-.8600307{col 67}{space 3}-.3468321
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .7545525{col 26}{space 2} .1278325{col 37}{space 1}    5.90{col 46}{space 3}0.000{col 54}{space 4} .5040053{col 67}{space 3}   1.0051
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.364373{col 26}{space 2} .4591404{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4} 1.464475{col 67}{space 3} 3.264272
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: mlogit w1AnxietyDisorder i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     1,346
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}  2.36e+66
{txt}{col 49}        avg{col 67}= {res}  2.36e+66
{txt}{col 49}        max{col 67}= {res}         .
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1.8e+68{txt}){col 67}= {res}      9.25
{txt}Within VCE type: {ralign 12:{res:OIM}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1AnxietyD~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}No          {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Yes          {txt}{c |}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1014323{col 26}{space 2} .2180572{col 37}{space 1}    0.47{col 46}{space 3}0.642{col 54}{space 4}-.3259519{col 67}{space 3} .5288166
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0587171{col 26}{space 2} .2354494{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4}-.5201895{col 67}{space 3} .4027553
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0042159{col 26}{space 2} .0102008{col 37}{space 1}    0.41{col 46}{space 3}0.679{col 54}{space 4}-.0157772{col 67}{space 3}  .024209
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-1.203464{col 26}{space 2}  .190216{col 37}{space 1}   -6.33{col 46}{space 3}0.000{col 54}{space 4} -1.57628{col 67}{space 3}-.8306472
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.6365975{col 26}{space 2} .2022248{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-1.032951{col 67}{space 3}-.2402443
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .5078353{col 26}{space 2} .1840783{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 54}{space 4} .1470484{col 67}{space 3} .8686222
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4185336{col 26}{space 2} .6928744{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-1.776542{col 67}{space 3} .9394752
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. mi estimate: reg w1w3w4bayes1CES i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}     10.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~S{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0090288{col 26}{space 2}  .007138{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0049731{col 67}{space 3} .0230307
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0178512{col 26}{space 2} .0074876{col 37}{space 1}   -2.38{col 46}{space 3}0.017{col 54}{space 4} -.032539{col 67}{space 3}-.0031635
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0008637{col 26}{space 2} .0003194{col 37}{space 1}    2.70{col 46}{space 3}0.007{col 54}{space 4} .0002372{col 67}{space 3} .0014902
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0139442{col 26}{space 2} .0058219{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} .0025238{col 67}{space 3} .0253645
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0225807{col 26}{space 2} .0060867{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .0106411{col 67}{space 3} .0345204
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.0300818{col 26}{space 2} .0059991{col 37}{space 1}   -5.01{col 46}{space 3}0.000{col 54}{space 4}-.0418497{col 67}{space 3}-.0183139
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1698738{col 26}{space 2} .0219252{col 37}{space 1}   -7.75{col 46}{space 3}0.000{col 54}{space 4}-.2128823{col 67}{space 3}-.1268652
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_DA i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}     18.32
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~A{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0003148{col 26}{space 2} .0037061{col 37}{space 1}   -0.08{col 46}{space 3}0.932{col 54}{space 4}-.0075847{col 67}{space 3} .0069551
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0060783{col 26}{space 2} .0038877{col 37}{space 1}   -1.56{col 46}{space 3}0.118{col 54}{space 4}-.0137044{col 67}{space 3} .0015478
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0005539{col 26}{space 2} .0001658{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .0002286{col 67}{space 3} .0008792
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0078381{col 26}{space 2} .0030228{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0019086{col 67}{space 3} .0137677
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0176809{col 26}{space 2} .0031603{col 37}{space 1}    5.59{col 46}{space 3}0.000{col 54}{space 4} .0114817{col 67}{space 3} .0238801
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.0235774{col 26}{space 2} .0031148{col 37}{space 1}   -7.57{col 46}{space 3}0.000{col 54}{space 4}-.0296875{col 67}{space 3}-.0174674
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1003047{col 26}{space 2} .0113838{col 37}{space 1}   -8.81{col 46}{space 3}0.000{col 54}{space 4}-.1226352{col 67}{space 3}-.0779741
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_IP i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}      9.32
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~P{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.000088{col 26}{space 2}  .000705{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4} -.001471{col 67}{space 3}  .001295
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0001012{col 26}{space 2} .0007396{col 37}{space 1}    0.14{col 46}{space 3}0.891{col 54}{space 4}-.0013496{col 67}{space 3} .0015519
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0001197{col 26}{space 2} .0000315{col 37}{space 1}    3.79{col 46}{space 3}0.000{col 54}{space 4} .0000578{col 67}{space 3} .0001816
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.0003138{col 26}{space 2} .0005751{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-.0014419{col 67}{space 3} .0008142
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0005798{col 26}{space 2} .0006012{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-.0017591{col 67}{space 3} .0005995
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.0034424{col 26}{space 2} .0005926{col 37}{space 1}   -5.81{col 46}{space 3}0.000{col 54}{space 4}-.0046048{col 67}{space 3}-.0022801
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0130875{col 26}{space 2} .0021656{col 37}{space 1}   -6.04{col 46}{space 3}0.000{col 54}{space 4}-.0173356{col 67}{space 3}-.0088394
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_SC i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}     10.57
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~C{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0029339{col 26}{space 2} .0027067{col 37}{space 1}    1.08{col 46}{space 3}0.279{col 54}{space 4}-.0023756{col 67}{space 3} .0082435
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0050052{col 26}{space 2} .0028393{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-.0105748{col 67}{space 3} .0005644
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2} .0003391{col 26}{space 2} .0001211{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0001015{col 67}{space 3} .0005767
{txt}{space 8}Race {c |}{col 14}{res}{space 2} .0019573{col 26}{space 2} .0022077{col 37}{space 1}    0.89{col 46}{space 3}0.375{col 54}{space 4}-.0023733{col 67}{space 3} .0062879
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0082493{col 26}{space 2} .0023081{col 37}{space 1}    3.57{col 46}{space 3}0.000{col 54}{space 4} .0037218{col 67}{space 3} .0127768
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.0130491{col 26}{space 2} .0022749{col 37}{space 1}   -5.74{col 46}{space 3}0.000{col 54}{space 4}-.0175115{col 67}{space 3}-.0085868
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0909831{col 26}{space 2} .0083141{col 37}{space 1}  -10.94{col 46}{space 3}0.000{col 54}{space 4}-.1072919{col 67}{space 3}-.0746742
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg w1w3w4bayes1CES_WB i.w1HCystert w1Age Race Sex PovStat if sample4part==1 & HNDwave==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,460
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}      1453
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}  1,451.00
{txt}{col 49}        avg{col 67}= {res}  1,451.00
{txt}{col 49}        max{col 67}= {res}  1,451.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res} 1451.0{txt}){col 67}= {res}      5.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}w1w3w4baye~B{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}w1HCystert {c |}
{space 10}2  {c |}{col 14}{res}{space 2} -.008821{col 26}{space 2} .0035543{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.0157931{col 67}{space 3} -.001849
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0031666{col 26}{space 2} .0037284{col 37}{space 1}    0.85{col 46}{space 3}0.396{col 54}{space 4} -.004147{col 67}{space 3} .0104802
{txt}{space 12} {c |}
{space 7}w1Age {c |}{col 14}{res}{space 2}-.0002573{col 26}{space 2}  .000159{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-.0005693{col 67}{space 3} .0000546
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-.0092906{col 26}{space 2}  .002899{col 37}{space 1}   -3.20{col 46}{space 3}0.001{col 54}{space 4}-.0149771{col 67}{space 3} -.003604
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0010111{col 26}{space 2} .0030308{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-.0049341{col 67}{space 3} .0069562
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.0078599{col 26}{space 2} .0029872{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.0137195{col 67}{space 3}-.0020002
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0110911{col 26}{space 2} .0109174{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-.0325066{col 67}{space 3} .0103244
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}