{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\HANDLS_PAPER64_HCYDEPANXIETY_LONG\OUTPUT\TRAJ.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Jun 2024, 09:13:24
{txt}
{com}. 
. 
. //////STEP 19A: TRAJECTORY OF HCY BETWEEN WAVES 1 AND 3///////////////////
> 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. 
. keep if HNDwave==1
{txt}(8,359 observations deleted)

{com}. save HANDLS_PAPER64_HCYDEPANXIETY_LONG_wide, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG_wide.dta{rm}
saved
{p_end}

{com}. 
. capture drop sampleHCY
{txt}
{com}. gen sampleHCY=.
{txt}(3,720 missing values generated)

{com}. replace sampleHCY=1 if (w1HCys~=. & w1Age~=. & w3Age~=. | w3HCys~=. & w1Age~=. & w3Age~=. |w4HCys~=. & w1Age~=. & w4Age~=. )
{txt}(1,573 real changes made)

{com}. replace sampleHCY=0 if sampleHCY~=1
{txt}(2,147 real changes made)

{com}. 
. tab sampleHCY

  {txt}sampleHCY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,147       57.72       57.72
{txt}          1 {c |}{res}      1,573       42.28      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. tab sampleHCY if HNDwave==1

  {txt}sampleHCY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,147       57.72       57.72
{txt}          1 {c |}{res}      1,573       42.28      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. tab sampleHCY if HNDwave==3
{txt}no observations

{com}. tab sampleHCY if HNDwave==4
{txt}no observations

{com}. 
. 
. su w1Age if sampleHCY==1 & HNDwave==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}w1Age {c |}{res}      1,573    47.86313    9.124377       30.1       66.2
{txt}
{com}. su w3Age if sampleHCY==1 & HNDwave==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}w3Age {c |}{res}      1,542    52.53502      9.0934       32.9       70.8
{txt}
{com}. su w4Age if sampleHCY==1 & HNDwave==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}w4Age {c |}{res}      1,336    56.23024    9.150943       36.4         76
{txt}
{com}. 
. 
. su w1HCys if sampleHCY==1 & HNDwave==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}w1HCys {c |}{res}      1,457    9.177152     5.22321       2.88     112.59
{txt}
{com}. su w3HCys if sampleHCY==1 & HNDwave==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}w3HCys {c |}{res}      1,486    10.40221    10.36594       3.87     303.93
{txt}
{com}. su w4HCys if sampleHCY==1 & HNDwave==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}w4HCys {c |}{res}      1,280    10.68614    4.557427       4.18      53.11
{txt}
{com}. 
. 
. **Log transformation of HCY***
. 
. capture drop Lnw1HCys Lnw3HCys  Lnw4HCys
{txt}
{com}. foreach x of varlist w1HCys w3HCys  w4HCys {c -(}
{txt}  2{com}. gen Ln`x'=ln(`x')       
{txt}  3{com}. {c )-}
{txt}(2,260 missing values generated)
(2,234 missing values generated)
(2,440 missing values generated)

{com}.  
. save HANDLS_PAPER64_HCYDEPANXIETY_LONG_wide, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG_wide.dta{rm}
saved
{p_end}

{com}. 
. **w1w3HCysTRAJ**
. capture drop _traj* 
{txt}
{com}. 
. **One group**
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(3) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    2.22926,    0.00000,    0.00000,    0.00000,    0.35084 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1568.8941220
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1        1545.0477017   1.51995090
     2        1527.3809969   1.14344073
     3        1494.6645372   2.14199730
     4        1483.0038045   0.78015717
     5        1481.9609645   0.07031945
     6        1477.3835008   0.30887883
     7        1477.0734430   0.02098695
     8        1477.0120946   0.00415337
     9        1476.9684692   0.00295362
    10        1476.9455740   0.00155015
    11        1461.1525291   1.06930446
    12        1450.9154920   0.70061386
    13        1450.7821486   0.00919029
    14        1450.6714133   0.00763280
    15        1450.5790863   0.00636443
    16        1450.5771651   0.00013244
    17        1447.3172631   0.22473138
    18        1446.9479521   0.02551694
    19        1445.3624867   0.10957308
    20        1444.8357102   0.03644598
    21        1444.4404822   0.02735452
    22        1444.4238003   0.00115490
    23        1444.4236101   0.00001317
    24        1443.8006184   0.04313082
    25        1443.5872917   0.01477535
    26        1443.5211383   0.00458257
    27        1443.5207152   0.00002932
    28        1443.5207109   0.00000029
    29        1443.5207109   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         0.88919      0.56267           1.580       0.1141
         Linear            0.05857      0.03390           1.728       0.0841
         Quadratic        -0.00090      0.00067          -1.352       0.1765
         Cubic             0.00001      0.00000           1.226       0.2202
 
 1       Sigma             0.34058      0.00371          91.859       0.0000
 
  Group membership
 1       (%)             100.00000      0.00000           
 BIC= -1464.39 (N=4223)  BIC= -1461.92 (N=1573)  AIC= -1448.52  ll=  -1443.52
 
Parameter estimates
 
    0.88919,    0.05857,   -0.00090,    0.00001,    0.34058 
 

 Entropy =     .

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_1A.gph",replace
{res}{txt}file {bf:FIGURES2_1A.gph} saved

{com}. 
. 
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(2) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    2.22926,    0.00000,    0.00000,    0.35084 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1568.8941220
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1        1555.5890591   0.84805359
     2        1460.2016107   6.13191818
     3        1460.2015824   0.00000194
     4        1460.2015546   0.00000191
     5        1457.2574110   0.20162584
     6        1446.9341198   0.70840547
     7        1444.2894428   0.18277798
     8        1444.2734207   0.00110934
     9        1444.2732021   0.00001514
    10        1444.2731994   0.00000018
    11        1444.2731994   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.56030      0.13080          11.928       0.0000
         Linear            0.01748      0.00514           3.400       0.0007
         Quadratic        -0.00009      0.00005          -1.738       0.0822
 
 1       Sigma             0.34064      0.00371          91.869       0.0000
 
  Group membership
 1       (%)             100.00000      0.00000           
 BIC= -1460.97 (N=4223)  BIC= -1458.99 (N=1573)  AIC= -1448.27  ll=  -1444.27
 
Parameter estimates
 
    1.56030,    0.01748,   -0.00009,    0.34064 
 

 Entropy =     .

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_1B.gph",replace
{res}{txt}file {bf:FIGURES2_1B.gph} saved

{com}. 
. 
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(1) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    2.22926,    0.00000,    0.35084 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1568.8941220
too big of a step
too big of a step
too big of a step
too big of a step
     1        1564.8636493   0.25689897
     2        1560.9655225   0.24910329
     3        1482.3747797   5.03475200
     4        1481.5533093   0.05541584
     5        1480.7461490   0.05448068
     6        1478.5476459   0.14847266
     7        1477.6259539   0.06233765
     8        1457.8457836   1.33864530
     9        1456.5052465   0.09195329
    10        1455.4149845   0.07485466
    11        1451.8496830   0.24496803
    12        1447.7088644   0.28520987
    13        1445.8620860   0.12756560
    14        1445.7914429   0.00488588
    15        1445.7844465   0.00048391
    16        1445.7844274   0.00000132
    17        1445.7844272   0.00000001
    18        1445.7844272   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.78218      0.02857          62.380       0.0000
         Linear            0.00860      0.00054          15.919       0.0000
 
 1       Sigma             0.34076      0.00371          91.880       0.0000
 
  Group membership
 1       (%)             100.00000      0.00000           
 BIC= -1458.31 (N=4223)  BIC= -1456.83 (N=1573)  AIC= -1448.78  ll=  -1445.78
 
Parameter estimates
 
    1.78218,    0.00860,    0.34076 
 

 Entropy =     .

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_1C.gph",replace
{res}{txt}file {bf:FIGURES2_1C.gph} saved

{com}. 
. 
. **Two groups**
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(3 3) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    1.99536,    0.00000,    0.00000,    0.00000,    2.46315,    0.00000, 
    0.00000,    0.00000,    0.35084,    0.35084,   50.00000,   50.00000 
 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1438.5629082
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1        1373.0696818   4.55268421
     2        1370.7156726   0.17144135
     3        1370.6275006   0.00643255
     4        1370.6263538   0.00008367
     5        1370.6239940   0.00017217
     6        1370.6213933   0.00018974
     7        1339.1021053   2.29963490
     8        1329.9129691   0.68621625
     9        1328.7713713   0.08584003
    10        1326.1058365   0.20060147
    11        1325.9893975   0.00878052
    12        1325.9888673   0.00003999
    13        1325.9878075   0.00007992
    14        1325.9868018   0.00007585
    15        1311.3709065   1.10226552
    16        1310.9495753   0.03212907
    17        1310.9472927   0.00017411
    18        1310.9472273   0.00000499
    19        1310.9471345   0.00000708
    20        1310.9470606   0.00000564
    21        1310.9469308   0.00000990
    22        1309.7614955   0.09042588
    23        1309.7613848   0.00000845
    24        1309.7610719   0.00002389
    25        1309.7610345   0.00000286
    26        1309.7610311   0.00000026
    27        1309.7610266   0.00000034
    28        1226.2625991   6.37508872
    29         982.6298524  19.86790977
    30         964.4757287   1.84750378
    31         954.3662822   1.04818050
    32         950.9072080   0.36244724
    33         944.7133044   0.65136782
    34         943.3313839   0.14627935
    35         942.4277262   0.09579430
    36         941.9615025   0.04947050
    37         941.7954612   0.01762719
    38         941.6767190   0.01260807
    39         941.6266618   0.00531576
    40         941.5920307   0.00367779
    41         941.5512624   0.00432972
    42         886.5451178   5.84207645
    43         885.0373158   0.17007618
    44         884.7423937   0.03332313
    45         884.4962918   0.02781621
    46         884.4817316   0.00164616
    47         884.4769438   0.00054131
    48         884.4760163   0.00010487
    49         884.4754238   0.00006699
    50         877.3720090   0.80312178
    51         872.8276212   0.51795450
    52         863.9449124   1.01769337
    53         862.2420048   0.19710835
    54         816.6800601   5.28412493
    55         813.7236178   0.36200740
    56         810.8254647   0.35615939
    57         810.1611519   0.08193044
    58         810.1571498   0.00049399
    59         810.1160062   0.00507847
    60         810.1104299   0.00068833
    61         810.1087889   0.00020257
    62         810.1084720   0.00003912
    63         810.1084680   0.00000049
    64         810.1084677   0.00000004
    65         810.1084677   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.43025      0.47232           3.028       0.0025
         Linear            0.02244      0.02856           0.786       0.4321
         Quadratic        -0.00025      0.00056          -0.441       0.6594
         Cubic             0.00000      0.00000           0.373       0.7092
 
 2       Intercept         0.55286      1.32089           0.419       0.6756
         Linear            0.08804      0.07991           1.102       0.2706
         Quadratic        -0.00138      0.00158          -0.874       0.3821
         Cubic             0.00001      0.00001           0.843       0.3993
 
 1       Sigma             0.22814      0.00420          54.346       0.0000
 2       Sigma             0.36732      0.01022          35.934       0.0000
 
  Group membership
 1       (%)              75.44493      2.15364          35.031       0.0000
 2       (%)              24.55507      2.15364          11.402       0.0000
 BIC=  -856.02 (N=4223)  BIC=  -850.59 (N=1573)  AIC=  -821.11  ll=   -810.11
 
Parameter estimates for adding risk factors
 
    1.43025,    0.02244,   -0.00025,    0.00000,    0.55286,    0.08804, 
   -0.00138,    0.00001,    0.22814,    0.36732,   -1.12248 
 
 
Parameter estimates
 
    1.43025,    0.02244,   -0.00025,    0.00000,    0.55286,    0.08804, 
   -0.00138,    0.00001,    0.22814,    0.36732,   75.44493,   24.55507 
 
 

 Entropy = 0.721

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_2A.gph",replace
{res}{txt}file {bf:FIGURES2_2A.gph} saved

{com}. 
. 
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(2 2) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    1.99536,    0.00000,    0.00000,    2.46315,    0.00000,    0.00000, 
    0.35084,    0.35084,   50.00000,   50.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1438.5629082
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1        1380.8064343   4.01487301
     2        1379.0620801   0.12632866
     3        1379.0519595   0.00073387
     4        1379.0147132   0.00270086
     5        1379.0086587   0.00043905
     6        1361.8544100   1.24395511
     7        1325.5763208   2.66387427
     8        1309.0406887   1.24742966
     9        1307.7594150   0.09787882
    10        1300.5974668   0.54765029
    11        1294.0981739   0.49971595
    12        1294.0501186   0.00371342
    13        1294.0436811   0.00049747
    14        1294.0427978   0.00006826
    15        1294.0426282   0.00001311
    16        1294.0425448   0.00000645
    17        1294.0422905   0.00001965
    18        1291.5382794   0.19350304
    19        1283.7455491   0.60336812
    20        1283.7199663   0.00199283
    21         937.4466296  26.97421134
    22         902.5679440   3.72060494
    23         889.5482698   1.44251458
    24         882.0612856   0.84166138
    25         877.5677841   0.50943189
    26         875.4191128   0.24484392
    27         874.2664313   0.13167196
    28         873.7081655   0.06385534
    29         873.3405967   0.04206997
    30         862.5309981   1.23773000
    31         827.5555867   4.05497442
    32         827.2200935   0.04054027
    33         827.2040257   0.00194239
    34         827.1959909   0.00097132
    35         827.1891743   0.00082406
    36         827.1864449   0.00032996
    37         827.1841196   0.00028111
    38         827.1815405   0.00031179
    39         819.1856474   0.96664308
    40         814.3128476   0.59483462
    41         811.6781892   0.32354375
    42         810.9267403   0.09257966
    43         810.5568299   0.04561576
    44         810.5259974   0.00380387
    45         810.5162660   0.00120063
    46         810.5160215   0.00003017
    47         810.5160182   0.00000040
    48         810.5160182   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.59978      0.11239          14.235       0.0000
         Linear            0.01199      0.00439           2.730       0.0064
         Quadratic        -0.00004      0.00004          -0.935       0.3498
 
 2       Intercept         1.62959      0.32211           5.059       0.0000
         Linear            0.02167      0.01280           1.693       0.0905
         Quadratic        -0.00005      0.00012          -0.437       0.6622
 
 1       Sigma             0.22844      0.00418          54.660       0.0000
 2       Sigma             0.36769      0.01023          35.959       0.0000
 
  Group membership
 1       (%)              75.61579      2.12959          35.507       0.0000
 2       (%)              24.38421      2.12959          11.450       0.0000
 BIC=  -848.08 (N=4223)  BIC=  -843.64 (N=1573)  AIC=  -819.52  ll=   -810.52
 
Parameter estimates for adding risk factors
 
    1.59978,    0.01199,   -0.00004,    1.62959,    0.02167,   -0.00005, 
    0.22844,    0.36769,   -1.13173 
 
Parameter estimates
 
    1.59978,    0.01199,   -0.00004,    1.62959,    0.02167,   -0.00005, 
    0.22844,    0.36769,   75.61579,   24.38421 
 

 Entropy = 0.723

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_2B.gph",replace
{res}{txt}file {bf:FIGURES2_2B.gph} saved

{com}. 
. 
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(1 1) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    1.99536,    0.00000,    2.46315,    0.00000,    0.35084,    0.35084, 
   50.00000,   50.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1438.5629082
too big of a step
too big of a step
     1        1394.0731910   3.09265010
     2        1390.1494281   0.28146032
     3        1389.8706244   0.02005567
     4        1389.7917926   0.00567188
     5        1389.4921952   0.02155700
     6        1389.2948986   0.01419919
     7        1387.5537989   0.12532254
     8        1383.0763143   0.32268908
     9        1380.2340883   0.20550030
    10        1333.2380905   3.40492951
    11        1213.1498793   9.00725925
    12        1000.4755745  17.53075267
    13         980.8461479   1.96200957
    14         889.4856744   9.31445504
    15         838.3147980   5.75286122
    16         837.6172429   0.08320921
    17         835.6971295   0.22923518
    18         835.4388262   0.03090873
    19         835.0793193   0.04303210
    20         834.8254049   0.03040602
    21         825.9420297   1.06409977
    22         823.3793100   0.31027839
    23         823.2060322   0.02104472
    24         822.6133665   0.07199481
    25         822.4439021   0.02060074
    26         822.4264206   0.00212555
    27         814.6908921   0.94057394
    28         812.8173520   0.22996944
    29         812.0183834   0.09829621
    30         811.0440429   0.11998995
    31         811.0128366   0.00384768
    32         811.0127313   0.00001298
    33         811.0127298   0.00000018
    34         811.0127298   0.00000001
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.70129      0.02709          62.793       0.0000
         Linear            0.00792      0.00049          16.182       0.0000
 
 2       Intercept         1.76271      0.07611          23.160       0.0000
         Linear            0.01618      0.00153          10.586       0.0000
 
 1       Sigma             0.22835      0.00417          54.735       0.0000
 2       Sigma             0.36744      0.01018          36.081       0.0000
 
  Group membership
 1       (%)              75.54039      2.12280          35.585       0.0000
 2       (%)              24.45961      2.12280          11.522       0.0000
 BIC=  -840.23 (N=4223)  BIC=  -836.78 (N=1573)  AIC=  -818.01  ll=   -811.01
 
Parameter estimates for adding risk factors
 
    1.70129,    0.00792,    1.76271,    0.01618,    0.22835,    0.36744, 
   -1.12764 
 
Parameter estimates
 
    1.70129,    0.00792,    1.76271,    0.01618,    0.22835,    0.36744, 
   75.54039,   24.45961 
 

 Entropy = 0.723

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_2C.gph",replace
{res}{txt}file {bf:FIGURES2_2C.gph} saved

{com}. 
. 
. **Three groups**
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(3 3 3) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    1.87842,    0.00000,    0.00000,    0.00000,    2.22926,    0.00000, 
    0.00000,    0.00000,    2.58010,    0.00000,    0.00000,    0.00000, 
    0.35084,    0.35084,    0.35084,   33.33333,   33.33333,   33.33333 
 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1475.1363240
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1        1383.6462426   6.20214416
     2        1336.2598627   3.42474676
     3        1333.7811415   0.18549695
     4        1333.5727080   0.01562726
     5        1333.5565226   0.00121369
     6        1333.5517882   0.00035502
     7        1333.5477908   0.00029976
     8        1333.5254589   0.00167462
     9        1333.4653227   0.00450956
    10        1333.4632264   0.00015721
    11        1333.4614244   0.00013514
    12        1330.5820083   0.21593546
    13        1329.0522306   0.11497057
    14        1328.5474118   0.03798337
    15        1328.4998200   0.00358225
    16        1328.4548497   0.00338504
    17        1328.1476412   0.02312525
    18        1323.6421190   0.33923354
    19        1315.5561547   0.61088750
    20        1287.2876817   2.14878498
    21        1281.3338555   0.46250937
    22        1280.1781057   0.09019896
    23        1278.6168704   0.12195455
    24        1277.9834650   0.04953832
    25        1277.9580390   0.00198954
    26        1277.6971519   0.02041437
    27        1277.5753570   0.00953237
    28        1277.5745877   0.00006021
    29        1277.5742841   0.00002376
    30        1277.5732173   0.00008350
    31        1277.5727269   0.00003839
    32        1274.7847410   0.21822522
    33        1274.7799296   0.00037743
    34        1274.7791926   0.00005781
    35        1274.7789284   0.00002073
    36        1274.7788075   0.00000948
    37        1274.7783792   0.00003360
    38        1274.7779049   0.00003720
    39        1264.5907613   0.79913086
    40        1264.5321337   0.00463609
    41        1264.5263669   0.00045604
    42        1264.5253741   0.00007851
    43        1264.5250818   0.00002311
    44        1264.5249184   0.00001293
    45        1264.5247297   0.00001492
    46        1262.8372463   0.13344803
    47        1262.8345277   0.00021527
    48        1262.8316559   0.00022741
    49        1262.8305235   0.00008968
    50        1262.8295219   0.00007931
    51        1262.8288928   0.00004982
    52        1262.8283997   0.00003905
    53        1262.8277633   0.00005039
    54        1199.4355195   5.01986460
    55        1178.5390841   1.74218914
    56        1175.3023640   0.27463834
    57        1175.0563258   0.02093403
    58        1175.0084512   0.00407424
    59        1175.0015884   0.00058407
    60        1174.9754297   0.00222627
    61        1150.4863711   2.08421878
    62         942.4847410  18.07945190
    63         906.4092843   3.82769664
    64         899.4128265   0.77188726
    65         899.3157960   0.01078820
    66         899.2858579   0.00332898
    67         899.2584026   0.00305302
    68         899.2507974   0.00084572
    69         899.2460569   0.00052716
    70         899.2435212   0.00028198
    71         899.2416211   0.00021130
    72         899.2397527   0.00020778
    73         787.7728603  12.39568113
    74         787.7728603  -0.00000053
    74         787.7728603  -0.00000053
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
    75         777.0769362   1.35774214
    76         775.6682760   0.18127681
    77         775.5819495   0.01112930
    78         775.5767383   0.00067192
    79         775.5765903   0.00001908
    80         775.5758107   0.00010053
    81         775.5754773   0.00004298
    82         775.5753147   0.00002097
    83         775.5750472   0.00003449
    84         775.5749157   0.00001695
    85         775.5746034   0.00004027
    86         775.5744589   0.00001863
    87         775.5683498   0.00078768
    88         775.5548463   0.00174112
    89         775.5420497   0.00164999
    90         775.3285851   0.02752456
    91         775.1729920   0.02006802
    92         775.1056437   0.00868817
    93         775.0081365   0.01257985
    94         774.9493360   0.00758708
    95         774.8972906   0.00671597
    96         774.8576351   0.00511752
    97         774.8049948   0.00679355
    98         774.6939222   0.01433554
    99         774.5705754   0.01592201
   100         774.4563276   0.01474983
   101         774.3610710   0.01229980
   102         774.3154822   0.00588728
   103         774.2776863   0.00488120
   104         774.2698010   0.00101841
   105         774.2618158   0.00103132
   106         774.2573341   0.00057883
   107         774.2536481   0.00047608
   108         774.2477714   0.00075902
   109         774.0849757   0.02102630
   110         774.0750586   0.00128113
   111         774.0651836   0.00127572
   112         774.0595211   0.00073154
   113         774.0570353   0.00032113
   114         774.0554666   0.00020266
   115         774.0540092   0.00018828
   116         774.0528434   0.00015061
   117         774.0514896   0.00017489
   118         774.0263099   0.00325298
   119         774.0008964   0.00328328
   120         773.9523034   0.00627816
   121         773.8538806   0.01271691
   122         773.7358303   0.01525486
   123         772.9661770   0.09947236
   124         772.4656110   0.06475911
   125         772.4575898   0.00103838
   126         772.4573812   0.00002702
   127         772.4552846   0.00027142
   128         772.4550262   0.00003345
   129         772.4546789   0.00004496
   130         772.4544823   0.00002545
   131         772.4543955   0.00001123
   132         772.4542967   0.00001279
   133         772.2308656   0.02892483
   134         772.2227635   0.00104918
   135         772.2213942   0.00017733
   136         772.2184991   0.00037490
   137         772.2175981   0.00011667
   138         772.2171799   0.00005417
   139         772.2167595   0.00005443
   140         772.2164291   0.00004279
   141         772.2160337   0.00005121
   142         771.1398321   0.13936534
   143         771.0952977   0.00577515
   144         771.0835679   0.00152118
   145         771.0612953   0.00288848
   146         771.0543320   0.00090309
   147         771.0496366   0.00060896
   148         771.0458411   0.00049225
   149         771.0432617   0.00033453
   150         771.0409095   0.00030507
   151         771.0382521   0.00034465
   152         687.2791232  10.86316128
   153         685.4418622   0.26732385
   154         685.1455404   0.04323076
   155         684.9720419   0.02532288
   156         684.7816674   0.02779303
   157         684.6865076   0.01389638
   158         684.6089055   0.01133396
   159         684.5567197   0.00762271
   160         684.5195812   0.00542520
   161         684.4864679   0.00483745
   162         684.4547654   0.00463158
   163         684.4145068   0.00588185
   164         684.2211321   0.02825403
   165         684.1974292   0.00346422
   166         684.0272173   0.02487760
   167         680.1193145   0.57130808
   168         652.6749235   4.03523182
   169         652.2660062   0.06265253
   170         652.1761598   0.01377450
   171         652.1217162   0.00834799
   172         652.0772906   0.00681246
   173         652.0500281   0.00418087
   174         652.0295581   0.00313933
   175         652.0156630   0.00213106
   176         652.0053025   0.00158900
   177         651.9975139   0.00119455
   178         651.9907736   0.00103380
   179         651.9836828   0.00108756
   180         613.3536061   5.92500667
   181         570.4454166   6.99566922
   182         568.1655107   0.39967118
   183         567.8884512   0.04876387
   184         567.5721513   0.05569754
   185         567.5681280   0.00070886
   186         567.5658616   0.00039932
   187         567.5641612   0.00029958
   188         567.5626864   0.00025986
   189         567.5609988   0.00029734
   190         542.6312529   4.39243464
   191         528.2362427   2.65281627
   192         510.0007087   3.45215503
   193         498.9733277   2.16222857
   194         491.2513239   1.54757847
   195         481.0943216   2.06757759
   196         473.0005951   1.68235751
   197         461.2877112   2.47629370
   198         457.7166266   0.77415558
   199         456.5781473   0.24873016
   200         456.5095640   0.01502116
   201         456.4581796   0.01125593
   202         456.4143523   0.00960161
   203         456.3778585   0.00799576
   204         456.3471174   0.00673588
   205         456.3215746   0.00559724
   206         456.3000040   0.00472705
   207         456.2818979   0.00396804
   208         456.2662990   0.00341869
   209         456.2525216   0.00301958
   210         456.2393482   0.00288730
   211         456.2251182   0.00311898
   212         456.2066873   0.00403987
   213         449.0976522   1.55829261
   214         443.4107700   1.26629080
   215         439.4840690   0.88556734
   216         438.5941143   0.20249988
   217         438.4246525   0.03863751
   218         438.4208623   0.00086450
   219         438.3808252   0.00913212
   220         438.3770428   0.00086281
   221         438.3742331   0.00064092
   222         438.3718066   0.00055353
   223         438.3696658   0.00048835
   224         438.3677786   0.00043052
   225         438.3661042   0.00038195
   226         438.3646187   0.00033887
   227         438.3632836   0.00030457
   228         438.3620629   0.00027846
   229         438.3608957   0.00026627
   230         438.3596892   0.00027522
   231         438.3582686   0.00032408
   232         438.3563054   0.00044785
   233         435.5374134   0.64305953
   234         434.3807267   0.26557689
   235         431.8917846   0.57298630
   236         429.0851975   0.64983574
   237         428.4913053   0.13840892
   238         427.9584116   0.12436512
   239         427.4973898   0.10772582
   240         427.4029137   0.02209983
   241         427.3510917   0.01212485
   242         427.3371951   0.00325181
   243         427.3244035   0.00299332
   244         427.3157678   0.00202088
   245         427.3157152   0.00001231
   246         427.3123360   0.00079080
   247         427.3122477   0.00002065
   248         427.3122337   0.00000328
   249         427.3122335   0.00000005
   250         427.3122335   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.39392      0.55589           2.508       0.0122
         Linear            0.01609      0.03319           0.485       0.6279
         Quadratic        -0.00012      0.00065          -0.190       0.8493
         Cubic             0.00000      0.00000           0.152       0.8791
 
 2       Intercept         0.30017      0.53818           0.558       0.5771
         Linear            0.10571      0.03261           3.242       0.0012
         Quadratic        -0.00197      0.00064          -3.059       0.0022
         Cubic             0.00001      0.00000           3.156       0.0016
 
 3       Intercept         1.39706      2.30743           0.605       0.5449
         Linear            0.03931      0.13959           0.282       0.7782
         Quadratic        -0.00041      0.00275          -0.148       0.8825
         Cubic             0.00000      0.00002           0.161       0.8725
 
 1       Sigma             0.18704      0.00401          46.659       0.0000
 2       Sigma             0.18511      0.00486          38.107       0.0000
 3       Sigma             0.44943      0.01742          25.793       0.0000
 
  Group membership
 1       (%)              41.33410      2.24909          18.378       0.0000
 2       (%)              46.25777      2.21257          20.907       0.0000
 3       (%)              12.40813      1.27651           9.720       0.0000
 BIC=  -498.27 (N=4223)  BIC=  -489.88 (N=1573)  AIC=  -444.31  ll=   -427.31
 
Parameter estimates for adding risk factors
 
    1.39392,    0.01609,   -0.00012,    0.00000,    0.30017,    0.10571, 
   -0.00197,    0.00001,    1.39706,    0.03931,   -0.00041,    0.00000, 
    0.18704,    0.18511,    0.44943,    0.11254,   -1.20334 
 
 
Parameter estimates
 
    1.39392,    0.01609,   -0.00012,    0.00000,    0.30017,    0.10571, 
   -0.00197,    0.00001,    1.39706,    0.03931,   -0.00041,    0.00000, 
    0.18704,    0.18511,    0.44943,   41.33410,   46.25777,   12.40813 
 
 

 Entropy = 0.736

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_3A.gph",replace
{res}{txt}file {bf:FIGURES2_3A.gph} saved

{com}. 
. 
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(2 2 2) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    1.87842,    0.00000,    0.00000,    2.22926,    0.00000,    0.00000, 
    2.58010,    0.00000,    0.00000,    0.35084,    0.35084,    0.35084, 
   33.33333,   33.33333,   33.33333 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1475.1363240
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1        1346.6109591   8.71277880
     2        1337.0560902   0.70954932
     3        1335.8996404   0.08649224
     4        1334.0012717   0.14210414
     5        1333.8363291   0.01236450
     6        1333.8326829   0.00027336
     7        1333.8040058   0.00214998
     8        1333.7976349   0.00047765
     9        1333.7811715   0.00123432
    10        1333.4477718   0.02499658
    11        1332.7725917   0.05063417
    12        1332.2101470   0.04220110
    13        1331.6773880   0.03999061
    14        1330.8245414   0.06404303
    15        1324.6553376   0.46356252
    16        1313.7557335   0.82282566
    17        1309.2517985   0.34282895
    18        1299.0646604   0.77808853
    19        1284.9565387   1.08602152
    20        1268.2576171   1.29957092
    21        1264.0446407   0.33218617
    22        1259.3481091   0.37154792
    23        1245.5469165   1.09589973
    24        1244.4951410   0.08444287
    25        1244.3305091   0.01322881
    26        1244.2721389   0.00469089
    27        1244.2663139   0.00046814
    28        1244.2247897   0.00333724
    29        1244.2166711   0.00065250
    30        1244.2032837   0.00107597
    31        1208.2332149   2.89101221
    32        1207.4646165   0.06361342
    33        1207.1725078   0.02419190
    34        1206.6893782   0.04002159
    35        1206.6444589   0.00372252
    36        1206.4810374   0.01354347
    37        1073.4681997  11.02485937
    38        1069.7864469   0.34297735
    39        1043.2648614   2.47914764
    40        1042.6500529   0.05893120
    41        1042.5207493   0.01240144
    42        1042.3442346   0.01693153
    43        1042.2959606   0.00463129
    44        1042.2745077   0.00205824
    45        1042.2489341   0.00245363
    46         982.5445973   5.72841428
    47         780.2115696  20.59275765
    48         762.7423340   2.23903827
    49         749.9297939   1.67979926
    50         745.1800640   0.63335660
    51         735.1261754   1.34918916
    52         700.1344702   4.75995909
    53         668.1534694   4.56783692
    54         666.6163735   0.23005133
    55         646.6219014   2.99939708
    56         644.6318211   0.30776568
    57         637.5318236   1.10140351
    58         621.6428757   2.49225958
    59         608.2362706   2.15664100
    60         597.2825629   1.80089683
    61         578.2285735   3.19011311
    62         563.7389085   2.50587150
    63         548.1687941   2.76193716
    64         547.9094026   0.04731965
    65         547.8418033   0.01233769
    66         547.7957461   0.00840702
    67         547.7625753   0.00605532
    68         547.7332704   0.00534992
    69         547.7118627   0.00390842
    70         547.6929874   0.00344622
    71         547.6770957   0.00290157
    72         547.6610150   0.00293615
    73         547.6419426   0.00348252
    74         540.8084696   1.24779943
    75         498.4387954   7.83450641
    76         492.4790062   1.19569126
    77         477.8572313   2.96901488
    78         470.9269161   1.45028990
    79         464.3523469   1.39609120
    80         463.8211168   0.11440237
    81         463.2476537   0.12363885
    82         463.0607615   0.04034390
    83         462.8825365   0.03848847
    84         462.7721060   0.02385714
    85         462.6718243   0.02166976
    86         462.5886683   0.01797301
    87         462.5093133   0.01715454
    88         462.4318618   0.01674593
    89         462.3413414   0.01957486
    90         462.2187611   0.02651294
    91         458.0588172   0.89999461
    92         455.3900327   0.58262922
    93         446.5796843   1.93468187
    94         442.3323032   0.95109142
    95         437.0372241   1.19708173
    96         434.7130816   0.53179508
    97         433.5993935   0.25618924
    98         433.3387551   0.06011041
    99         432.8822517   0.10534562
   100         432.5380253   0.07951965
   101         432.5303824   0.00176699
   102         432.3389272   0.04426399
   103         432.3245203   0.00333231
   104         432.3024210   0.00511172
   105         432.2990298   0.00078445
   106         432.2982676   0.00017633
   107         432.2969231   0.00031101
   108         432.2969207   0.00000056
   109         432.2969206   0.00000001
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.94718      0.14112          13.798       0.0000
         Linear            0.00411      0.00559           0.736       0.4615
         Quadratic         0.00006      0.00005           1.044       0.2965
 
 2       Intercept         1.47811      0.13520          10.933       0.0000
         Linear            0.01094      0.00521           2.099       0.0359
         Quadratic        -0.00002      0.00005          -0.462       0.6439
 
 3       Intercept         1.61906      0.54501           2.971       0.0030
         Linear            0.02258      0.02160           1.045       0.2959
         Quadratic        -0.00002      0.00021          -0.084       0.9327
 
 1       Sigma             0.18560      0.00481          38.565       0.0000
 2       Sigma             0.18691      0.00402          46.514       0.0000
 3       Sigma             0.44811      0.01735          25.823       0.0000
 
  Group membership
 1       (%)              46.30444      2.22371          20.823       0.0000
 2       (%)              41.21296      2.27174          18.142       0.0000
 3       (%)              12.48260      1.27648           9.779       0.0000
 BIC=  -490.74 (N=4223)  BIC=  -483.82 (N=1573)  AIC=  -446.30  ll=   -432.30
 
Parameter estimates for adding risk factors
 
    1.94718,    0.00411,    0.00006,    1.47811,    0.01094,   -0.00002, 
    1.61906,    0.02258,   -0.00002,    0.18560,    0.18691,    0.44811, 
   -0.11648,   -1.31090 
 
Parameter estimates
 
    1.94718,    0.00411,    0.00006,    1.47811,    0.01094,   -0.00002, 
    1.61906,    0.02258,   -0.00002,    0.18560,    0.18691,    0.44811, 
   46.30444,   41.21296,   12.48260 
 

 Entropy = 0.736

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURES2_3B.gph",replace
{res}{txt}file {bf:FIGURES2_3B.gph} saved

{com}. 
. 
. 
. traj if sampleHCY==1, var(Lnw1HCys Lnw3HCys  Lnw4HCys) indep(w1Age w3Age w4Age) model(cnorm) max1(400) order(1 1 1) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
3720 observations read.
2147 excluded by if condition.
1573 observations used in the trajectory model.
 
Start 
Parameter estimates
 
    1.87842,    0.00000,    2.22926,    0.00000,    2.58010,    0.00000, 
    0.35084,    0.35084,    0.35084,   33.33333,   33.33333,   33.33333 
 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0        1475.1363240
too big of a step
     1        1431.9129874   2.93012489
     2        1363.7745202   4.75856199
     3        1362.0891499   0.12358131
     4        1351.1472816   0.80331513
     5        1348.3372525   0.20797357
     6        1339.9616118   0.62118291
     7        1339.1427429   0.06111137
     8        1338.9267953   0.01612581
     9        1338.5080319   0.03127605
    10        1338.1363321   0.02776971
    11        1215.8903455   9.13554051
    12        1037.4525584  14.67548351
    13        1007.4906260   2.88802916
    14         959.8937898   4.72429569
    15         923.6301471   3.77788076
    16         918.6220595   0.54221785
    17         909.2512065   1.02009884
    18         908.9279875   0.03554782
    19         908.8734336   0.00600200
    20         908.6275062   0.02705849
    21         741.6607671  18.37570820
    22         709.9397328   4.27702742
    23         637.4945219  10.20441701
    24         530.9841114  16.70765895
    25         490.6072639   7.60415360
    26         482.8626775   1.57857149
    27         482.4111723   0.09350593
    28         481.0636460   0.27933147
    29         480.7377472   0.06774548
    30         480.6950554   0.00888047
    31         480.6768068   0.00379629
    32         480.6521622   0.00512707
    33         480.6319518   0.00420478
    34         480.5996468   0.00672137
    35         465.1213082   3.22063045
    36         455.6796259   2.02993975
    37         449.5786568   1.33887247
    38         448.5743844   0.22338082
    39         447.8098934   0.17042679
    40         444.8019877   0.67169255
    41         442.8365854   0.44186006
    42         442.4657896   0.08373196
    43         442.3039382   0.03657942
    44         442.1520638   0.03433711
    45         442.0705490   0.01843592
    46         441.9887248   0.01850931
    47         441.8954433   0.02110494
    48         441.7686657   0.02868952
    49         439.7227055   0.46312931
    50         438.8115279   0.20721641
    51         437.3073267   0.34278980
    52         436.3124836   0.22749290
    53         435.9719749   0.07804239
    54         435.9454133   0.00609250
    55         435.9408376   0.00104961
    56         435.9393215   0.00034778
    57         435.9375848   0.00039838
    58         435.1944521   0.17046769
    59         434.8096683   0.08841651
    60         434.1104269   0.16081551
    61         433.9474463   0.03754358
    62         433.9405775   0.00158287
    63         433.3120020   0.14485290
    64         433.2231721   0.02050021
    65         433.1848211   0.00885249
    66         433.0900738   0.02187225
    67         433.0898633   0.00004861
    68         433.0891881   0.00015589
    69         433.0891881   0.00000001
    70         433.0891881   0.00000000
			Maximum Likelihood Estimates
			Model: Censored Normal (cnorm)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.80458      0.03398          53.113       0.0000
         Linear            0.00990      0.00064          15.550       0.0000
 
 2       Intercept         1.53898      0.03180          48.389       0.0000
         Linear            0.00854      0.00057          14.988       0.0000
 
 3       Intercept         1.67676      0.12696          13.207       0.0000
         Linear            0.02054      0.00247           8.299       0.0000
 
 1       Sigma             0.18600      0.00480          38.751       0.0000
 2       Sigma             0.18702      0.00403          46.446       0.0000
 3       Sigma             0.44940      0.01743          25.783       0.0000
 
  Group membership
 1       (%)              46.38826      2.23474          20.758       0.0000
 2       (%)              41.22277      2.28916          18.008       0.0000
 3       (%)              12.38897      1.27264           9.735       0.0000
 BIC=  -479.00 (N=4223)  BIC=  -473.57 (N=1573)  AIC=  -444.09  ll=   -433.09
 
Parameter estimates for adding risk factors
 
    1.80458,    0.00990,    1.53898,    0.00854,    1.67676,    0.02054, 
    0.18600,    0.18702,    0.44940,   -0.11806,   -1.32024 
 
 
Parameter estimates
 
    1.80458,    0.00990,    1.53898,    0.00854,    1.67676,    0.02054, 
    0.18600,    0.18702,    0.44940,   46.38826,   41.22277,   12.38897 
 
 

 Entropy = 0.735

{com}. trajplot, xtitle(Age (years)) ytitle(HCY) ci
{res}{txt}
{com}. graph save "FIGURE2.gph",replace
{res}{txt}file {bf:FIGURE2.gph} saved

{com}. 
. capture rename _traj_Group R_traj_GroupHCY 
{txt}
{com}. capture rename _traj_ProbG1 R_traj_ProbG1HCY 
{txt}
{com}. capture rename _traj_ProbG2  R_traj_ProbG2HCY
{txt}
{com}. capture rename _traj_ProbG3  R_traj_ProbG3HCY
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG_wide.dta{rm}
saved
{p_end}

{com}. 
. corr R_traj_ProbG1HCY Lnw1HCys Lnw3HCys Lnw4HCys
{txt}(obs=1,120)

             {c |} R_t~1HCY Lnw1HCys Lnw3HCys Lnw4HCys
{hline 13}{c +}{hline 36}
R_traj_~1HCY {c |}{res}   1.0000
    {txt}Lnw1HCys {c |}{res}   0.3260   1.0000
    {txt}Lnw3HCys {c |}{res}   0.2772   0.6856   1.0000
    {txt}Lnw4HCys {c |}{res}   0.2907   0.6123   0.6351   1.0000

{txt}
{com}. corr R_traj_ProbG2HCY Lnw1HCys Lnw3HCys Lnw4HCys
{txt}(obs=1,120)

             {c |} R_t~2HCY Lnw1HCys Lnw3HCys Lnw4HCys
{hline 13}{c +}{hline 36}
R_traj_~2HCY {c |}{res}   1.0000
    {txt}Lnw1HCys {c |}{res}  -0.6435   1.0000
    {txt}Lnw3HCys {c |}{res}  -0.6565   0.6856   1.0000
    {txt}Lnw4HCys {c |}{res}  -0.6811   0.6123   0.6351   1.0000

{txt}
{com}. corr R_traj_ProbG3HCY Lnw1HCys Lnw3HCys Lnw4HCys
{txt}(obs=1,120)

             {c |} R_t~3HCY Lnw1HCys Lnw3HCys Lnw4HCys
{hline 13}{c +}{hline 36}
R_traj_~3HCY {c |}{res}   1.0000
    {txt}Lnw1HCys {c |}{res}   0.5181   1.0000
    {txt}Lnw3HCys {c |}{res}   0.6117   0.6856   1.0000
    {txt}Lnw4HCys {c |}{res}   0.6299   0.6123   0.6351   1.0000

{txt}
{com}. 
. bysort R_traj_GroupHCY: su Lnw1HCys Lnw3HCys Lnw4HCys if (sampleHCY==1 & HNDwave==1)

{txt}{hline}
-> R_traj_GroupHCY = 1

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}Lnw1HCys {c |}{res}        700    2.249394    .1891939    1.76815   2.802754
{txt}{space 4}Lnw3HCys {c |}{res}        711     2.32834    .1921155   1.822935   2.942332
{txt}{space 4}Lnw4HCys {c |}{res}        615    2.386352    .1980258   1.682688    2.95178

{txt}{hline}
-> R_traj_GroupHCY = 2

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}Lnw1HCys {c |}{res}        604    1.914547    .1915985   1.283708   2.572612
{txt}{space 4}Lnw3HCys {c |}{res}        616    1.986065    .1849721   1.353255    2.70069
{txt}{space 4}Lnw4HCys {c |}{res}        523    2.054512    .1976784   1.430311   2.703373

{txt}{hline}
-> R_traj_GroupHCY = 3

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}Lnw1HCys {c |}{res}        153    2.619154    .4815178    1.05779   4.723753
{txt}{space 4}Lnw3HCys {c |}{res}        159    2.851522    .5479301   1.574847   5.716797
{txt}{space 4}Lnw4HCys {c |}{res}        142    2.873812    .3743469   1.581038   3.972365

{txt}{hline}
-> R_traj_GroupHCY = .

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}Lnw1HCys {c |}{res}          0
{txt}{space 4}Lnw3HCys {c |}{res}          0
{txt}{space 4}Lnw4HCys {c |}{res}          0

{txt}
{com}. 
. 
. capture drop w1w3w4HCysTRAJ
{txt}
{com}. gen w1w3w4HCysTRAJ=R_traj_ProbG3HCY
{txt}(2,147 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG_wide.dta{rm}
saved
{p_end}

{com}. 
. keep HNDID R_traj* w1w3w4HCysTRAJ
{txt}
{com}. 
. save HCY_TRAJ_DATA, replace
{txt}{p 0 4 2}
file {bf}
HCY_TRAJ_DATA.dta{rm}
saved
{p_end}

{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HCY_TRAJ_DATA.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using HCY_TRAJ_DATA
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}

{com}. save HANDLS_PAPER64_HCYDEPANXIETY_LONG, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. *******GBTM FOR ANXIETY******
. 
. capture drop w1ANXIETY_ORD
{txt}
{com}. gen w1ANXIETY_ORD=w1ANXIETY-10
{txt}(4,326 missing values generated)

{com}. 
. capture drop w4ANXIETY_ORD
{txt}
{com}. gen w4ANXIETY_ORD=w4ANXIETY-10
{txt}(4,745 missing values generated)

{com}. 
. capture drop sampleANXIETY
{txt}
{com}. gen sampleANXIETY=1 if w1ANXIETY~=. | w4ANXIETY~=. 
{txt}(2,326 missing values generated)

{com}. replace sampleANXIETY=0 if sampleANXIETY~=1
{txt}(2,326 real changes made)

{com}. 
. tab sampleANXIETY

{txt}sampleANXIE {c |}
         TY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,326       19.26       19.26
{txt}          1 {c |}{res}      9,753       80.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     12,079      100.00
{txt}
{com}. 
. **One group**
. 
. traj if sampleANXIETY==1, var(w1ANXIETY_ORD   w4ANXIETY_ORD) indep(w1Age  w4Age) model(zip) max1(10) order(3) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
12079 observations read.
2326 excluded by if condition.
9753 observations used in the trajectory model.
 
Start 
Parameter estimates
 
   -0.05863,    0.00000,    0.00000,    0.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0       62311.4443323
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1       52928.4827496  15.05816738
     2       52759.0533669   0.32011003
     3       52548.3995542   0.39927519
     4       45652.8107913  13.12235733
     5       45516.0858658   0.29948852
     6       45516.0018719   0.00018454
     7       45515.8077765   0.00042643
     8       45515.5758603   0.00050953
     9       45515.2696832   0.00067269
    10       45514.8125454   0.00100436
    11       44189.1572600   2.91257991
    12       44189.0353104   0.00027597
    13       44188.9586938   0.00017338
    14       44188.9174968   0.00009323
    15       44188.8761853   0.00009349
    16       44188.8344176   0.00009452
    17       44188.7917619   0.00009653
    18       44188.7472229   0.00010079
    19       44188.6989821   0.00010917
    20       44188.6431450   0.00012636
    21       44188.5725216   0.00015982
    22       44188.4716470   0.00022828
    23       44176.9613883   0.02604810
    24       44176.8475759   0.00025763
    25       44176.8301564   0.00003943
    26       44176.8122132   0.00004062
    27       44176.7942605   0.00004064
    28       44176.7763159   0.00004062
    29       44176.7583532   0.00004066
    30       44176.7403815   0.00004068
    31       44176.7223578   0.00004080
    32       44176.7042570   0.00004097
    33       44176.6859681   0.00004140
    34       44176.6673296   0.00004219
    35       44176.6479593   0.00004385
    36       44176.6271494   0.00004711
    37       44176.6034324   0.00005369
    38       44176.5739167   0.00006681
    39       44176.5327932   0.00009309
    40       43975.0055626   0.45618616
    41       43909.4670523   0.14903582
    42       43899.4760489   0.02275364
    43       43898.8375264   0.00145451
    44       43898.8284250   0.00002073
    45       43898.8284212   0.00000001
			Maximum Likelihood Estimates
			Model: Zero Inflated Poisson (zip)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         2.28778      0.49325           4.638       0.0000
         Linear           -0.08402      0.03027          -2.776       0.0055
         Quadratic         0.00220      0.00060           3.637       0.0003
         Cubic            -0.00002      0.00000          -5.007       0.0000
 
 
  Group membership
 1       (%)             100.00000      0.00000           
 BIC=-43918.07 (N=15087)  BIC=-43917.20 (N=9753)  AIC=-43902.83  ll= -43898.83
 
Parameter estimates
 
    2.28778,   -0.08402,    0.00220,   -0.00002 
 

 Entropy =     .

{com}. trajplot, xtitle(Age (years)) ytitle(ANXIETY) ci
{res}{txt}
{com}. graph save "ANXIETY_FINAL_cubic_one.gph",replace
{res}{txt}file {bf:ANXIETY_FINAL_cubic_one.gph} saved

{com}. 
. 
. 
. traj if sampleANXIETY==1, var(w1ANXIETY_ORD   w4ANXIETY_ORD) indep(w1Age  w4Age) model(zip) max1(10) order(2) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
12079 observations read.
2326 excluded by if condition.
9753 observations used in the trajectory model.
 
Start 
Parameter estimates
 
   -0.05863,    0.00000,    0.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0       62311.4443323
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1       56012.7552516  10.10839846
     2       49867.6749904  10.97085875
     3       44186.5036474  11.39249292
     4       44149.6506516   0.08340329
     5       44149.6048247   0.00010380
     6       44149.4423369   0.00036804
     7       44149.2768765   0.00037477
     8       44149.1175398   0.00036090
     9       44148.9464710   0.00038748
    10       44148.7630117   0.00041555
    11       44148.5334972   0.00051987
    12       44148.2267590   0.00069479
    13       44106.8085688   0.09381620
    14       43953.7851551   0.34693830
    15       43911.7848098   0.09555570
    16       43911.6367415   0.00033719
    17       43911.4848454   0.00034591
    18       43911.4484551   0.00008287
    19       43911.4484547   0.00000000
			Maximum Likelihood Estimates
			Model: Zero Inflated Poisson (zip)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        -0.12351      0.11734          -1.053       0.2926
         Linear            0.06618      0.00470          14.092       0.0000
         Quadratic        -0.00082      0.00005         -17.932       0.0000
 
 
  Group membership
 1       (%)             100.00000      0.00000           
 BIC=-43925.88 (N=15087)  BIC=-43925.23 (N=9753)  AIC=-43914.45  ll= -43911.45
 
Parameter estimates
 
   -0.12351,    0.06618,   -0.00082 
 

 Entropy =     .

{com}. trajplot, xtitle(Age (years)) ytitle(ANXIETY) ci
{res}{txt}
{com}. graph save "ANXIETY_FINAL_quadratic_one.gph",replace
{res}{txt}file {bf:ANXIETY_FINAL_quadratic_one.gph} saved

{com}. 
. 
. traj if sampleANXIETY==1, var(w1ANXIETY_ORD   w4ANXIETY_ORD) indep(w1Age  w4Age) model(zip) max1(10) order(1) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
12079 observations read.
2326 excluded by if condition.
9753 observations used in the trajectory model.
 
Start 
Parameter estimates
 
   -0.05863,    0.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0       62311.4443323
too big of a step
too big of a step
too big of a step
too big of a step
     1       53953.9821333  13.41240327
     2       47130.1826270  12.64744369
     3       46950.7947630   0.38062204
     4       46889.8643237   0.12977510
     5       44136.1773947   5.87266986
     6       44083.7476149   0.11879094
     7       44080.3240466   0.00776606
     8       44080.3181135   0.00001346
     9       44080.3181028   0.00000002
    10       44080.3181028   0.00000000
			Maximum Likelihood Estimates
			Model: Zero Inflated Poisson (zip)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.92540      0.02523          76.328       0.0000
         Linear           -0.01759      0.00049         -35.902       0.0000
 
 
  Group membership
 1       (%)             100.00000      0.00000           
 BIC=-44089.94 (N=15087)  BIC=-44089.50 (N=9753)  AIC=-44082.32  ll= -44080.32
 
Parameter estimates
 
    1.92540,   -0.01759 
 

 Entropy =     .

{com}. trajplot, xtitle(Age (years)) ytitle(ANXIETY) ci
{res}{txt}
{com}. graph save "ANXIETY_linear_one.gph",replace
{res}{txt}file {bf:ANXIETY_linear_one.gph} saved

{com}. 
. 
. **Two group**
. 
. traj if sampleANXIETY==1, var(w1ANXIETY_ORD   w4ANXIETY_ORD) indep(w1Age  w4Age) model(zip) max1(10) order(3 3) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
12079 observations read.
2326 excluded by if condition.
9753 observations used in the trajectory model.
 
Start 
Parameter estimates
 
   -1.05361,    0.00000,    0.00000,    0.00000,    0.43012,    0.00000, 
    0.00000,    0.00000,   50.00000,   50.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0       50512.9614674
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
too big of a step
     1       38755.1506588  23.27681939
     2       38700.7615297   0.14034039
     3       38687.4864682   0.03430181
     4       38676.7987811   0.02762570
     5       38668.2476111   0.02210930
     6       38651.1949832   0.04409982
     7       38641.9209249   0.02399423
     8       33183.7613523  14.12496957
too big of a step
too big of a step
too big of a step
     9       33170.9763012   0.03852803
    10       33160.1836809   0.03253634
    11       33148.1040324   0.03642817
    12       33135.8577574   0.03694412
    13       33123.9564431   0.03591672
    14       33116.7723853   0.02168840
    15       33112.5246584   0.01282651
    16       33110.6778552   0.00557736
    17       33109.6381582   0.00314007
    18       32903.5388108   0.62247538
    19       32894.4428337   0.02764437
    20       32892.6988823   0.00530166
    21       32891.8430330   0.00260194
    22       32891.7143392   0.00039126
    23       32891.4085555   0.00092967
    24       32891.1909225   0.00066167
    25       32891.1606216   0.00009212
    26       32891.1565442   0.00001240
    27       32891.1549076   0.00000498
    28       32891.1540295   0.00000267
    29       32891.1525084   0.00000462
    30       32891.1517859   0.00000220
    31       32890.8432778   0.00093797
    32       32890.8427327   0.00000166
    33       32890.8421907   0.00000165
    34       32890.8416039   0.00000178
    35       32890.8410140   0.00000179
    36       32890.8403231   0.00000210
    37       32890.8394427   0.00000268
    38       32890.8381700   0.00000387
    39       32704.8934345   0.56533900
    40       32695.4660920   0.02882548
    41       32695.0551815   0.00125678
    42       32694.8278296   0.00069537
    43       32694.6331771   0.00059536
    44       32694.5216137   0.00034123
    45       32694.4115472   0.00033665
    46       32694.3502604   0.00018745
    47       32694.3029497   0.00014471
    48       32694.2645287   0.00011752
    49       32694.2351036   0.00009000
    50       32694.2101987   0.00007618
    51       32694.1878526   0.00006835
    52       32694.1639974   0.00007296
    53       32694.1325375   0.00009622
    54       32683.7510513   0.03175336
    55       32677.8318177   0.01811063
    56       32677.1303293   0.00214668
    57       32677.1301901   0.00000043
    58       32677.1300724   0.00000036
    59       32677.1299657   0.00000033
    60       32677.1298631   0.00000031
    61       32677.1297473   0.00000035
    62       32677.1295949   0.00000047
    63       32676.9332867   0.00060075
    64       32673.2404166   0.01130115
    65       32669.7320508   0.01073773
    66       32649.2109154   0.06281391
    67       32643.2422595   0.01828116
    68       32642.1382789   0.00338196
    69       32641.0789275   0.00324535
    70       32638.4232264   0.00813607
    71       32634.8552348   0.01093187
    72       32633.9979391   0.00262693
    73       32633.9040088   0.00028783
    74       32633.9022430   0.00000541
    75       32633.9021213   0.00000037
    76       32633.9021199   0.00000000
			Maximum Likelihood Estimates
			Model: Zero Inflated Poisson (zip)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        10.22603      2.35287           4.346       0.0000
         Linear           -0.63918      0.14530          -4.399       0.0000
         Quadratic         0.01300      0.00292           4.448       0.0000
         Cubic            -0.00009      0.00002          -4.706       0.0000
 
 2       Intercept         0.89882      0.55428           1.622       0.1049
         Linear            0.03607      0.03392           1.063       0.2876
         Quadratic        -0.00030      0.00068          -0.445       0.6566
         Cubic            -0.00000      0.00000          -0.400       0.6895
 
 
  Group membership
 1       (%)              53.73192      0.59219          90.735       0.0000
 2       (%)              46.26808      0.59219          78.131       0.0000
 BIC=-32677.20 (N=15087)  BIC=-32675.24 (N=9753)  AIC=-32642.90  ll= -32633.90
 
Parameter estimates for adding risk factors
 
   10.22603,   -0.63918,    0.01300,   -0.00009,    0.89882,    0.03607, 
   -0.00030,   -0.00000,   -0.14955 
 
Parameter estimates
 
   10.22603,   -0.63918,    0.01300,   -0.00009,    0.89882,    0.03607, 
   -0.00030,   -0.00000,   53.73192,   46.26808 
 

 Entropy = 0.849

{com}. trajplot, xtitle(Age (years)) ytitle(ANXIETY) ci
{res}{txt}
{com}. graph save "ANXIETY_FINAL_cubic.gph",replace
{res}{txt}file {bf:ANXIETY_FINAL_cubic.gph} saved

{com}. 
. 
. 
. traj if sampleANXIETY==1, var(w1ANXIETY_ORD   w4ANXIETY_ORD) indep(w1Age  w4Age) model(zip) max1(10) order(2 2) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
12079 observations read.
2326 excluded by if condition.
9753 observations used in the trajectory model.
 
Start 
Parameter estimates
 
   -1.05361,    0.00000,    0.00000,    0.43012,    0.00000,    0.00000, 
   50.00000,   50.00000 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0       50512.9614674
too big of a step
too big of a step
too big of a step
     1       36384.3823992  27.97020538
     2       36298.3708112   0.23639700
     3       36293.1472369   0.01439066
     4       36272.5301650   0.05680707
     5       36268.5488061   0.01097624
     6       36249.7346231   0.05187465
     7       36243.7977595   0.01637767
     8       36239.7325012   0.01121642
     9       36236.5660222   0.00873759
    10       36229.6118765   0.01919096
    11       33521.3602223   7.47524335
too big of a step
too big of a step
    12       33478.0969446   0.12906182
    13       33437.0938899   0.12247726
    14       33396.2505274   0.12214986
    15       33356.1651823   0.12002948
    16       33314.9724723   0.12349354
    17       33271.4582810   0.13061452
    18       33221.1953516   0.15106921
    19       33160.1894787   0.18363539
    20       33081.9977119   0.23580012
    21       32987.3668974   0.28604927
    22       32925.0062084   0.18904416
    23       32877.2474747   0.14505307
    24       32818.4643970   0.17879562
    25       32798.9521632   0.05945505
    26       32775.9082180   0.07025817
    27       32770.1214757   0.01765547
    28       32758.3313513   0.03597827
    29       32745.4828361   0.03922213
    30       32719.7371724   0.07862356
    31       32705.2110414   0.04439562
    32       32686.4029384   0.05750797
    33       32676.6605715   0.02980556
    34       32673.7161667   0.00901073
    35       32670.6381559   0.00942045
    36       32670.4737182   0.00050332
    37       32670.4173184   0.00017263
    38       32670.3834302   0.00010373
    39       32670.3470494   0.00011136
    40       32670.3279259   0.00005853
    41       32670.3110811   0.00005156
    42       32670.2926017   0.00005656
    43       32670.2694366   0.00007091
    44       32666.9813312   0.01006452
    45       32651.3430287   0.04787189
    46       32647.6210359   0.01139920
    47       32646.8804312   0.00226848
    48       32646.5556367   0.00099487
    49       32646.3300711   0.00069093
    50       32646.1268525   0.00062249
    51       32645.9931779   0.00040947
    52       32645.8867048   0.00032614
    53       32645.8056924   0.00024816
    54       32645.7429092   0.00019232
    55       32645.6928371   0.00015338
    56       32645.6515947   0.00012633
    57       32645.6132585   0.00011743
    58       32645.5660555   0.00014459
    59       32644.7478626   0.00250629
    60       32644.7081899   0.00012153
    61       32644.6957517   0.00003810
    62       32644.6730764   0.00006946
    63       32644.6553870   0.00005419
    64       32644.6504024   0.00001527
    65       32644.6497359   0.00000204
    66       32644.6495651   0.00000052
    67       32644.6494997   0.00000020
    68       32644.6494862   0.00000004
    69       32644.6494837   0.00000001
			Maximum Likelihood Estimates
			Model: Zero Inflated Poisson (zip)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept        -1.04307      0.52722          -1.978       0.0479
         Linear            0.05594      0.02096           2.669       0.0076
         Quadratic        -0.00090      0.00020          -4.434       0.0000
 
 2       Intercept         0.70122      0.13386           5.239       0.0000
         Linear            0.04861      0.00538           9.029       0.0000
         Quadratic        -0.00056      0.00005         -10.575       0.0000
 
 
  Group membership
 1       (%)              53.55884      0.59019          90.748       0.0000
 2       (%)              46.44116      0.59019          78.688       0.0000
 BIC=-32678.33 (N=15087)  BIC=-32676.80 (N=9753)  AIC=-32651.65  ll= -32644.65
 
Parameter estimates for adding risk factors
 
   -1.04307,    0.05594,   -0.00090,    0.70122,    0.04861,   -0.00056, 
   -0.14259 
 
Parameter estimates
 
   -1.04307,    0.05594,   -0.00090,    0.70122,    0.04861,   -0.00056, 
   53.55884,   46.44116 
 

 Entropy = 0.850

{com}. trajplot, xtitle(Age (years)) ytitle(ANXIETY) ci
{res}{txt}
{com}. graph save "ANXIETY_FINAL_quadratic.gph",replace
{res}{txt}file {bf:ANXIETY_FINAL_quadratic.gph} saved

{com}. 
. 
. traj if sampleANXIETY==1, var(w1ANXIETY_ORD   w4ANXIETY_ORD) indep(w1Age  w4Age) model(zip) max1(10) order(1 1) sigmabygroup detail
{txt} 
==== traj stata plugin ====  Jones BL  Nagin DS,  build: May  2 2023
 
12079 observations read.
2326 excluded by if condition.
9753 observations used in the trajectory model.
 
Start 
Parameter estimates
 
   -1.05361,    0.00000,    0.43012,    0.00000,   50.00000,   50.00000 
 
 
              Neg. Log       Percent
              Likelihood     Decrease

 
     0       50512.9614674
     1       35240.3719538  30.23499132
     2       34355.9980636   2.50954755
     3       34161.1235178   0.56722132
     4       34125.1817427   0.10521251
     5       34120.7043846   0.01312039
     6       34119.1063165   0.00468357
     7       34118.1942668   0.00267313
     8       34114.6770014   0.01030906
     9       32933.1692572   3.46334144
    10       32890.0901290   0.13080772
    11       32888.2272769   0.00566387
    12       32888.1480874   0.00024078
    13       32888.0519341   0.00029236
    14       32822.4025727   0.19961462
    15       32761.4738128   0.18563163
    16       32760.2494808   0.00373711
    17       32724.1319209   0.11024812
    18       32711.4973522   0.03860933
    19       32708.5775173   0.00892602
    20       32707.0931531   0.00453815
    21       32707.0925716   0.00000178
    22       32707.0450825   0.00014520
    23       32707.0441619   0.00000281
    24       32707.0334260   0.00003282
    25       32707.0333750   0.00000016
    26       32707.0333746   0.00000000
			Maximum Likelihood Estimates
			Model: Zero Inflated Poisson (zip)

			       Standard       T for H0:
 Group   Parameter        Estimate        Error     Parameter=0   Prob > |T|
 
 1       Intercept         1.19175      0.10547          11.299       0.0000
         Linear           -0.03566      0.00204         -17.455       0.0000
 
 2       Intercept         2.08219      0.03126          66.615       0.0000
         Linear           -0.00810      0.00061         -13.333       0.0000
 
 
  Group membership
 1       (%)              53.52493      0.58830          90.983       0.0000
 2       (%)              46.47507      0.58830          78.999       0.0000
 BIC=-32731.09 (N=15087)  BIC=-32730.00 (N=9753)  AIC=-32712.03  ll= -32707.03
 
Parameter estimates for adding risk factors
 
    1.19175,   -0.03566,    2.08219,   -0.00810,   -0.14123 
 
 
Parameter estimates
 
    1.19175,   -0.03566,    2.08219,   -0.00810,   53.52493,   46.47507 
 
 

 Entropy = 0.852

{com}. trajplot, xtitle(Age (years)) ytitle(ANXIETY) ci
{res}{txt}
{com}. graph save "ANXIETY_FINAL.gph",replace
{res}{txt}file {bf:ANXIETY_FINAL.gph} saved

{com}. 
. capture rename _traj_Group R_traj_GroupANXIETY 
{txt}
{com}. capture rename _traj_ProbG1 R_traj_ProbG1ANXIETY 
{txt}
{com}. capture rename _traj_ProbG2  R_traj_ProbG2ANXIETY
{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. corr R_traj_ProbG1ANXIETY w1ANXIETY_ORD  w4ANXIETY_ORD
{txt}(obs=5,334)

             {c |} R_traj.. w1ANXI~D w4ANXI~D
{hline 13}{c +}{hline 27}
R_t~1ANXIETY {c |}{res}   1.0000
{txt}w1ANXIETY_~D {c |}{res}  -0.7482   1.0000
{txt}w4ANXIETY_~D {c |}{res}  -0.7331   0.4981   1.0000

{txt}
{com}. corr R_traj_ProbG2ANXIETY w1ANXIETY_ORD  w4ANXIETY_ORD
{txt}(obs=5,334)

             {c |} R_traj.. w1ANXI~D w4ANXI~D
{hline 13}{c +}{hline 27}
R_t~2ANXIETY {c |}{res}   1.0000
{txt}w1ANXIETY_~D {c |}{res}   0.7482   1.0000
{txt}w4ANXIETY_~D {c |}{res}   0.7331   0.4981   1.0000

{txt}
{com}. 
. bysort R_traj_GroupANXIETY: su w1ANXIETY_ORD w4ANXIETY_ORD if (sampleANXIETY==1 & HNDwave==1)

{txt}{hline}
-> R_traj_GroupANXIETY = 1

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
w1ANXIETY_~D {c |}{res}      1,148    .5914634    .9455057          0          5
{txt}w4ANXIETY_~D {c |}{res}      1,021    .3907933    .7612383          0          4

{txt}{hline}
-> R_traj_GroupANXIETY = 2

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
w1ANXIETY_~D {c |}{res}      1,077    5.531105    2.816278          0         10
{txt}w4ANXIETY_~D {c |}{res}        859    5.185099    3.069811          0         10

{txt}{hline}
-> R_traj_GroupANXIETY = .

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
w1ANXIETY_~D {c |}{res}          0
{txt}w4ANXIETY_~D {c |}{res}          0

{txt}
{com}. twoway (contour R_traj_ProbG1ANXIETY w1ANXIETY_ORD  w4ANXIETY_ORD) if (sampleANXIETY==1 & HNDwave==1)
{res}{txt}
{com}. graph save "ANXIETY_PROBG1_COMPA.gph",replace
{res}{txt}file {bf:ANXIETY_PROBG1_COMPA.gph} saved

{com}. twoway (contour R_traj_ProbG2ANXIETY w1ANXIETY_ORD  w4ANXIETY_ORD) if (sampleANXIETY==1 & HNDwave==1)
{res}{txt}
{com}. graph save "ANXIETY_PROBG2_COMPA.gph",replace
{res}{txt}file {bf:ANXIETY_PROBG2_COMPA.gph} saved

{com}. 
. graph combine "ANXIETY_FINAL.gph" "ANXIETY_PROBG1_COMPA.gph" "ANXIETY_PROBG2_COMPA.gph" 
{res}{txt}
{com}. graph save "FIGURE3.gph",replace
{res}{txt}file {bf:FIGURE3.gph} saved

{com}. 
. capture drop w1w4ANXIETYTRAJ
{txt}
{com}. gen w1w4ANXIETYTRAJ=R_traj_ProbG2ANXIETY
{txt}(2,326 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. keep HNDID R_traj* w1w4ANXIETYTRAJ
{txt}
{com}. 
. save ANXIETY_TRAJ_DATA, replace
{txt}{p 0 4 2}
file {bf}
ANXIETY_TRAJ_DATA.dta{rm}
saved
{p_end}

{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
ANXIETY_TRAJ_DATA.dta{rm}
saved
{p_end}

{com}. 
. use HANDLS_PAPER64_HCYDEPANXIETY_LONG,clear
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_HCYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. merge HNDID using ANXIETY_TRAJ_DATA
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
the master data
{p_end}
{p 0 4 2}
variable{txt} HNDID
does not uniquely identify observations in
ANXIETY_TRAJ_DATA.dta
{p_end}

{com}. save HANDLS_PAPER64_ANXIETYDEPANXIETY_LONG, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_PAPER64_ANXIETYDEPANXIETY_LONG.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}